[
  {
    "title": "Efficient operator-splitting minimax algorithm for robust optimization.",
    "authors": [
      "Jiulong Liu",
      "Ya-Nan Zhu",
      "Xiaoqun Zhang",
      "Hao Gao"
    ],
    "abstract": "The treatment uncertainties such as patient positioning can significantly affect the accuracy of proton radiation therapy (RT). Robust optimization can account for these uncertainties during treatment planning, for which the minimax approach optimizes the worst-case plan quality.",
    "journal": "Medical physics",
    "pubdate": ""
  },
  {
    "title": "Design and characterization of a novel scintillator array for UHDR PBS proton therapy surface dosimetry.",
    "authors": [
      "Roman Vasyltsiv",
      "Joseph Harms",
      "Megan Clark",
      "David J Gladstone",
      "Brian W Pogue",
      "Rongxiao Zhang",
      "Petr Bruza"
    ],
    "abstract": "Ultrahigh dose rate (UHDR) proton therapy has shown promise in normal tissue sparing by enhancing the therapeutic ratio through a method termed the FLASH effect. As in all radiotherapy, accurate in vivo dosimetry is crucial for quality assurance of safe and efficient treatment delivery. However, this remains a challenge for UHDR as existing dosimetry systems lack the spatial and temporal resolution required to verify dose and dose rate in complex anatomical regions, especially for pencil beam scanning (PBS) proton therapy.",
    "journal": "Medical physics",
    "pubdate": ""
  },
  {
    "title": "Scenario-free robust optimization algorithm for IMRT and IMPT treatment planning.",
    "authors": [
      "Remo Cristoforetti",
      "Jennifer Josephine Hardt",
      "Niklas Wahl"
    ],
    "abstract": "Robust treatment planning algorithms for intensity modulated proton therapy (IMPT) and intensity modulated radiation therapy (IMRT) allow for uncertainty reduction in the delivered dose distributions through explicit inclusion of error scenarios. Due to the curse of dimensionality, application of such algorithms can easily become computationally prohibitive.",
    "journal": "Medical physics",
    "pubdate": ""
  },
  {
    "title": "Diffusion Schrödinger bridge models for high-quality MR-to-CT synthesis for proton treatment planning.",
    "authors": [
      "Muheng Li",
      "Xia Li",
      "Sairos Safai",
      "Antony J Lomax",
      "Ye Zhang"
    ],
    "abstract": "In recent advancements in proton therapy, magnetic resonance (MR)-based treatment planning is gaining momentum due to its excellent soft tissue contrast and high potential to minimize extra radiation exposure compared to traditional computed tomography (CT)-based methods. This transition underscores the critical need for accurate MR-to-CT image synthesis, which is essential for precise proton dose calculations.",
    "journal": "Medical physics",
    "pubdate": ""
  },
  {
    "title": "Characterization of a Commercial Ionization Chamber Array With Scanned Proton Beams for Applications in MRI-Guided Proton Therapy.",
    "authors": [
      "Benjamin Gebauer",
      "Sebastian Gantz",
      "Daniela Kunath",
      "Aswin Hoffmann",
      "Jörg Pawelke",
      "Felix Horst"
    ],
    "abstract": "The integration of MRI-guidance and proton therapy is a current research topic. Proton therapy with the patient being placed inside an in-beam MR scanner would require the presence of its static magnetic (  B 0 $B_0$  ) field to be taken into account in dose calculation and treatment planning. Therefore, dosimetric tools are needed to characterize dose distributions in presence of the  B 0 $B_0$  field of the MR scanner. Furthermore, patient-specific quality assurance (QA) and treatment plan verification measurements should also be performed within the magnetic field.",
    "journal": "Medical physics",
    "pubdate": ""
  },
  {
    "title": "Field dispersion in uniformly-excited radial parallel plate waveguides for a compact proton accelerator design.",
    "authors": [
      "Morgan J Maher",
      "Christopher M Lund",
      "Julien Bancheri",
      "David G Cooke",
      "Jan Seuntjens"
    ],
    "abstract": "Proton therapy (PT) is a beneficial modality for treating certain cancers but remains under utilized due in part to the high cost of existing PT devices. Dielectric wall accelerators (DWAs) are a proposed class of coreless induction accelerators that may present a suitable option for compact and affordable PT. To realize a compact device, acceleration modules must be designed to achieve field strengths approaching 100 MV/m delivered as pulses on the order of nanoseconds.",
    "journal": "Medical physics",
    "pubdate": ""
  },
  {
    "title": "Implementation of a novel pencil beam scanning Bragg peak FLASH technique to a commercial treatment planning system.",
    "authors": [
      "Alexander Bookbinder",
      "Miriam Krieger",
      "Pierre Lansonneur",
      "Anthony Magliari",
      "Xingyi Zhao",
      "J Isabelle Choi",
      "Charles B Simone",
      "Haibo Lin",
      "Michael Folkerts",
      "Minglei Kang"
    ],
    "abstract": "Ultra-high dose rate, or FLASH, radiotherapy has shown promise in preclinical experiments of sparing healthy tissue without compromising tumor control. This \"FLASH effect\" can compound with dosimetric sparing of the proton Bragg peak (BP) using a method called Single Energy Pristine Bragg Peak (SEPBP) FLASH. However, this and other proposed FLASH techniques are constrained by lack of familiar treatment planning systems (TPSs). Creating modules to implement SEPBP FLASH into a commercial TPS opens up the possibility of more widespread investigation of FLASH and lays the groundwork for future clinical translation.",
    "journal": "Medical physics",
    "pubdate": ""
  },
  {
    "title": "Instantaneous in vivo distal edge verification in intensity-modulated proton therapy by means of PET imaging.",
    "authors": [
      "Brian Zapien-Campos",
      "Zahra Ahmadi Ganjeh",
      "Giuliano Perotti-Bernardini",
      "Jeffrey Free",
      "Stefan Both",
      "Peter Dendooven"
    ],
    "abstract": "Intensity-modulated proton therapy (IMPT) holds promise for improving outcomes in head-and-neck cancer (HNC) patients by enhancing organ-at-risk (OAR) sparing. A key challenge in IMPT is ensuring an accurate dose delivery at the distal edge of the tumor, where the steep dose gradients make treatment precision highly sensitive to uncertainties in both proton range and patient setup. Thus, IMPT conformality is increased by incorporating robust margins in the treatment optimization. However, an increment in the plan robustness could lead to an OAR overdosing. Therefore, an accurate distal edge verification during dose delivery is crucial to increase IMPT conformality by reducing optimization settings in treatment planning.",
    "journal": "Medical physics",
    "pubdate": ""
  },
  {
    "title": "Patient-specific modeling of radiation-induced lymphopenia for head and neck cancer.",
    "authors": [
      "Jiaxin Li",
      "Rahul Mali",
      "Gregory N Gan",
      "Christopher Lominska",
      "Kenny Guida",
      "Aditya Juloori",
      "Matthew Wen-Ruey Chen",
      "Wangyao Li",
      "Jufri Setianegara",
      "Chao Wang",
      "Yuting Lin",
      "Qiang Li",
      "Weiqiang Chen",
      "Hao Gao"
    ],
    "abstract": "Radiation-induced lymphopenia (RIL) is a frequent complication in head and neck cancer (HNC) patients undergoing radiotherapy (RT), and its severity is associated with poorer survival outcomes.",
    "journal": "Medical physics",
    "pubdate": ""
  },
  {
    "title": "Postal dosimetry audit for scanning proton beam using radiophotoluminescence glass dosimeter: A multicenter pilot study.",
    "authors": [
      "Keisuke Yasui",
      "Miuna Hayashi",
      "Shiryu Otsuka",
      "Toshiyuki Toshito",
      "Chihiro Omachi",
      "Masaya Ichihara",
      "Riki Oshika",
      "Yuki Tominaga",
      "Hiromi Baba",
      "Hidetoshi Shimizu",
      "Naoki Hayashi"
    ],
    "abstract": "Accurate dosimetry is important in radiotherapy, and all equipment used for radiotherapy shoud be audited by an independent external dose audit. Radiophotoluminescence glass dosimeter (RPLD) has excellent characteristics and is widely used for postal dose audit; however, postal dose audit for proton therapy using RPLD has not been established.",
    "journal": "Medical physics",
    "pubdate": ""
  }
]