[
  {
    "title": "Physical phantom validation of clustering-initiated factorization in dynamic PET.",
    "authors": [
      "Valerie Kobzarenko",
      "Suzanne L Baker",
      "Mustafa Janabi",
      "Woon-Seng Choong",
      "Grant T Gullberg",
      "Youngho Seo",
      "Rostyslav Boutchko",
      "Debasis Mitra"
    ],
    "abstract": "BACKGROUND: Dynamic positron emission tomography (PET) enables the quantification of physiological parameters of radiotracers employed in the investigation of neuropsychiatric disorders. We previously introduced a factor analysis-based algorithm, Cluster-Initialized Factor Analysis (CIFA), designed to overcome the problem of specifying reference regions. CIFA is capable of automatically extracting distinct radiotracer binding distributions across many modalities based on the differences in tracer dynamics, and thus can distinguish regions of specific- and non-specific binding without requiring prior segmentation.\nPURPOSE: Our goal is to quantitatively validate the ability of CIFA to resolve different dynamic biological processes by comparing the output of the algorithm to an independent benchmark. As an intermediate goal, we aim to create a physical phantom capable of modeling unique aspects of dynamic imaging and to use this phantom as the benchmark in evaluating CIFA.\nMETHODS: CIFA was used to reconstruct 18F-flortaucipir dynamic brain PET datasets acquired at Lawrence Berkeley National Lab. The resulting factor curves served as the foundation for creating dynamic input time-activity curve (TAC) combinations in a physical brain phantom specifically constructed for this purpose. The phantom represented three components: two overlapping tissue types and free radiotracer, constructed with a combination of small hydraulic elements. The physical components were scanned separately to generate a library of images, allowing us to reproduce scans of any duration with prescribed dynamics and realistic partial volume effects. The phantom was designed to produce noisy instances with compartment mixing of dynamic scans with desired activity TACs for free, non-specifically bound, and specifically bound radiotracers. Ten distinct dynamic simulations with varying levels of TAC similarity were estimated with CIFA.\nRESULTS: We directly evaluated CIFA's performance in analyzing each of the 10 dynamic datasets by computing the Pearson correlation coefficient between the estimated outputs and the ground truth tissue TACs and corresponding tissue distributions. For seven out of 10 modeled dynamics, which captured the full spectrum of realistically expected tissue TAC shapes, the curve correlation of the specific binding tissue was above 95%.\nCONCLUSIONS: This work formulated an innovative process by combining a physical phantom design with PET images for evaluating the application of CIFA in the extraction of dynamic TACs from dynamic PET image data. In most cases the CIFA algorithm accurately reproduced the dynamics of the phantom simulated data.",
    "abstract_zh": "",
    "summary_zh": "",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17902",
    "link": "https://doi.org/10.1002/mp.17902"
  },
  {
    "title": "Generation of synthetic CT from MRI for MRI-based attenuation correction of brain PET images using radiomics and machine learning.",
    "authors": [
      "Amin Hoseinipourasl",
      "Gholam-Ali Hossein-Zadeh",
      "Peyman Sheikhzadeh",
      "Hossein Arabalibeik",
      "Shaghayegh Karimi Alavijeh",
      "Habib Zaidi",
      "Mohammad Reza Ay"
    ],
    "abstract": "BACKGROUND: Accurate quantitative PET imaging in neurological studies requires proper attenuation correction. MRI-guided attenuation correction in PET/MRI remains challenging owing to the lack of direct relationship between MRI intensities and linear attenuation coefficients.\nPURPOSE: This study aims at generating accurate patient-specific synthetic CT volumes, attenuation maps, and attenuation correction factor (ACF) sinograms with continuous values utilizing a combination of machine learning algorithms, image processing techniques, and voxel-based radiomics feature extraction approaches.\nMETHODS: Brain MR images of ten healthy volunteers were acquired using IR-pointwise encoding time reduction with radial acquisition (IR-PETRA) and VIBE-Dixon techniques. synthetic CT (SCT) images, attenuation maps, and attenuation correction factors (ACFs) were generated using the LightGBM, a fast and accurate machine learning algorithm, from the radiomics-based and image processing-based feature maps of MR images. Additionally, ultra-low-dose CT images of the same volunteers were acquired and served as the standard of reference for evaluation. The SCT images, attenuation maps, and ACF sinograms were assessed using qualitative and quantitative evaluation metrics and compared against their corresponding reference images, attenuation maps, and ACF sinograms.\nRESULTS: The voxel-wise and volume-wise comparison between synthetic and reference CT images yielded an average mean absolute error of 60.75 ± 8.8 HUs, an average structural similarity index of 0.88 ± 0.02, and an average peak signal-to-noise ratio of 32.83 ± 2.74 dB. Additionally, we compared MRI-based attenuation maps and ACF sinograms with their CT-based counterparts, revealing average normalized mean absolute errors of 1.48% and 1.33%, respectively.\nCONCLUSION: Quantitative assessments indicated higher correlations and similarities between LightGBM-synthesized CT and Reference CT images. Moreover, the cross-validation results showed the possibility of producing accurate SCT images, MRI-based attenuation maps, and ACF sinograms. This might spur the implementation of MRI-based attenuation correction on PET/MRI and dedicated brain PET scanners with lower computational time using CPU-based processors.",
    "abstract_zh": "",
    "summary_zh": "",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17867",
    "link": "https://doi.org/10.1002/mp.17867"
  },
  {
    "title": "Impact of tracer uptake rate on quantification accuracy of myocardial blood flow in PET: A simulation study.",
    "authors": [
      "Xiaotong Hong",
      "Amirhossein Sanaat",
      "Yazdan Salimi",
      "René Nkoulou",
      "Hossein Arabi",
      "Lijun Lu",
      "Habib Zaidi"
    ],
    "abstract": "BACKGROUND: Cardiac perfusion PET is commonly used to assess ischemia and cardiovascular risk, which enables quantitative measurements of myocardial blood flow (MBF) through kinetic modeling. However, the estimation of kinetic parameters is challenging due to the noisy nature of short dynamic frames and limited sample data points.\nPURPOSE: This work aimed to investigate the errors in MBF estimation in PET through a simulation study and to evaluate different parameter estimation approaches, including a deep learning (DL) method.\nMATERIALS AND METHODS: Simulated studies were generated using digital phantoms based on cardiac segmentations from 55 clinical CT images. We employed the irreversible 2-tissue compartmental model and simulated dynamic 13N-ammonia PET scans under both rest and stress conditions (220 cases each). The simulations covered a rest K1 range of 0.6 to 1.2 and a stress K1 range of 1.2 to 3.6 (unit: mL/min/g) in the myocardium. A transformer-based DL model was trained on the simulated dataset to predict parametric images (PIMs) from noisy PET image frames and was validated using 5-fold cross-validation. We compared the DL method with the voxel-wise nonlinear least squares (NLS) fitting applied to the dynamic images, using either Gaussian filter (GF) smoothing (GF-NLS) or a dynamic nonlocal means (DNLM) algorithm for denoising (DNLM-NLS). Two patients with coronary CT angiography (CTA) and fractional flow reserve (FFR) were enrolled to test the feasibility of applying DL models on clinical PET data.\nRESULTS: The DL method showed clearer image structures with reduced noise compared to the traditional NLS-based methods. In terms of mean absolute relative error (MARE), as the rest K1 values increased from 0.6 to 1.2 mL/min/g, the overall bias in myocardium K1 estimates decreased from approximately 58% to 45% for the NLS-based methods while the DL method showed a reduction in MARE from 42% to 18%. For stress data, as the stress K1 decreased from 3.6 to 1.2 mL/min/g, the MARE increased from 30% to 70% for the GF-NLS method. In contrast, both the DNLM-NLS (average: 42%) and the DL methods (average: 20%) demonstrated significantly smaller MARE changes as stress K1 varied. Regarding the regional mean bias (±standard deviation), the GF-NLS method had a bias of 6.30% (±8.35%) of rest K1, compared to 1.10% (±8.21%) for DNLM-NLS and 6.28% (±14.05%) for the DL method. For the stress K1, the GF-NLS showed a mean bias of 10.72% (±9.34%) compared to 1.69% (±8.82%) for DNLM-NLS and -10.55% (±9.81%) for the DL method.\nSIGNIFICANCE: This study showed that an increase in the tracer uptake rate (K1) corresponded to improved accuracy and precision in MBF quantification, whereas lower tracer uptake resulted in higher noise in dynamic PET and poorer parameter estimates. Utilizing denoising techniques or DL approaches can mitigate noise-induced bias in PET parametric imaging.",
    "abstract_zh": "",
    "summary_zh": "",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17871",
    "link": "https://doi.org/10.1002/mp.17871"
  },
  {
    "title": "Instantaneous in vivo distal edge verification in intensity-modulated proton therapy by means of PET imaging.",
    "authors": [
      "Brian Zapien-Campos",
      "Zahra Ahmadi Ganjeh",
      "Giuliano Perotti-Bernardini",
      "Jeffrey Free",
      "Stefan Both",
      "Peter Dendooven"
    ],
    "abstract": "BACKGROUND: Intensity-modulated proton therapy (IMPT) holds promise for improving outcomes in head-and-neck cancer (HNC) patients by enhancing organ-at-risk (OAR) sparing. A key challenge in IMPT is ensuring an accurate dose delivery at the distal edge of the tumor, where the steep dose gradients make treatment precision highly sensitive to uncertainties in both proton range and patient setup. Thus, IMPT conformality is increased by incorporating robust margins in the treatment optimization. However, an increment in the plan robustness could lead to an OAR overdosing. Therefore, an accurate distal edge verification during dose delivery is crucial to increase IMPT conformality by reducing optimization settings in treatment planning.\nPURPOSE: This work aims to evaluate, in a quasi-clinical setting, a novel approach for accurate instantaneous proton beam distal edge verification in IMPT by means of spot-by-spot positron emission tomography (PET) imaging.\nMETHODS: An anthropomorphic head and neck phantom CIRS-731 HN was irradiated at the head and neck region. The targets were defined as 4 cm diameter spheres. A 60-ms delay was introduced between the proton beam spots in order to enable the spot-by-spot coincidence detection of the 511-keV photons resulting from positron annihilation following the positron emission from very short-lived positron-emitting, mainly 12N (T1/2  = 11.0 ms). Additionally, modified irradiations were carried out using solid water slabs of 2 and 5 mm thickness in the beam path to assess the precision of the approach for detecting range deviations. The positron activity range (PAR) was determined from the 50% distal fall-off position of the 1D longitudinal positron activity profile derived from the 2D image reconstructions. Furthermore, Monte Carlo (MC) simulations were performed using an in-house RayStation/GATE MC framework to predict the positron activity images and verify the PAR measurements.\nRESULTS: PAR measurements achieved a precision between 1.5 and 3.6 mm (at 1.5σ clinical level) at the beam spot level within sub-second time scales. Measured PAR shifts of 1.6-2.1  and 4.2--.7 mm were observed with the 2- and 5-mm thickness range shifters, respectively, aligning with the corresponding proton dose range (PDR) shifts of 1.3-1.8 and 3.9-4.3 mm. The simulated PAR agrees with the measured PARs, showing an average range difference of ∼0.4 mm.\nCONCLUSION: This study demonstrated the feasibility of instantaneous distal edge verification using PET imaging by introducing beam spot delays during dose delivery. The findings represent a first step toward the clinical implementation of instantaneous in vivo distal edge verification. The approach contributes to the development of real-time range verification aimed at improving IMPT treatments by mitigating range and setup uncertainties, thereby reducing dose to organs-at-risk and ultimately enhancing patient outcomes.",
    "abstract_zh": "",
    "summary_zh": "",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17850",
    "link": "https://doi.org/10.1002/mp.17850"
  },
  {
    "title": "Modeling inter-reader variability in clinical target volume delineation for soft tissue sarcomas using diffusion model.",
    "authors": [
      "Yafei Dong",
      "Thibault Marin",
      "Yue Zhuo",
      "Elie Najem",
      "Arnaud Beddok",
      "Laura Rozenblum",
      "Maryam Moteabbed",
      "Kira Grogg",
      "Fangxu Xing",
      "Jonghye Woo",
      "Yen-Lin E Chen",
      "Ruth Lim",
      "Xiaofeng Liu",
      "Chao Ma",
      "Georges El Fakhri"
    ],
    "abstract": "BACKGROUND: Accurate delineation of the clinical target volume (CTV) is essential in the radiotherapy treatment of soft tissue sarcomas. However, this process is subject to inter-reader variability due to the need for clinical assessment of risk and extent of potential microscopic spread. This can lead to inconsistencies in treatment planning, potentially impacting treatment outcomes. Most existing automatic CTV delineation methods do not account for this variability and can only generate a single CTV for each case.\nPURPOSE: This study aims to develop a deep learning-based technique to generate multiple CTV contours for each case, simulating the inter-reader variability in the clinical practice.\nMETHODS: We employed a publicly available dataset consisting of fluorodeoxyglucose positron emission tomography (FDG-PET), x-ray computed tomography (CT), and pre-contrast T1-weighted magnetic resonance imaging (MRI) scans from 51 patients with soft tissue sarcoma, along with an independent validation set containing five additional patients. An experienced reader drew a contour of the gross tumor volume (GTV) for each patient based on multi-modality images. Subsequently, two additional readers, together with the first one, were responsible for contouring three CTVs in total based on the GTV. We developed a diffusion model-based deep learning method that is capable of generating arbitrary number of different and plausible CTVs to mimic the inter-reader variability in CTV delineation. The proposed model incorporates a separate encoder to extract features from the GTV masks, leveraging the critical role of GTV information in accurate CTV delineation.\nRESULTS: The proposed diffusion model demonstrated superior performance with the highest Dice Index (0.902 compared to values below 0.881 for state-of-the-art models) and the best generalized energy distance (GED) (0.209 compared to values exceeding 0.221 for state-of-the-art models). It also achieved the second-highest recall and precision metrics among the compared ambiguous image segmentation models. Results from both datasets exhibited consistent trends, reinforcing the reliability of our findings. Additionally, ablation studies exploring different model structures and input configurations highlighted the significance of incorporating prior GTV information for accurate CTV delineation.\nCONCLUSIONS: The proposed diffusion model successfully generates multiple plausible CTV contours for soft tissue sarcomas, effectively capturing inter-reader variability in CTV delineation.",
    "abstract_zh": "",
    "summary_zh": "",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17865",
    "link": "https://doi.org/10.1002/mp.17865"
  },
  {
    "title": "Thorax-encompassing multi-modality PET/CT deep learning model for resected lung cancer prognostication: A retrospective, multicenter study.",
    "authors": [
      "Jaryd R Christie",
      "Perrin Romine",
      "Karen Eddy",
      "Delphine L Chen",
      "Omar Daher",
      "Mohamed Abdelrazek",
      "Richard A Malthaner",
      "Mehdi Qiabi",
      "Rahul Nayak",
      "Paul Kinahan",
      "Viswam S Nair",
      "Sarah A Mattonen"
    ],
    "abstract": "BACKGROUND: Patients with early-stage non-small cell lung cancer (NSCLC) typically receive surgery as their primary form of treatment. However, studies have shown that a high proportion of these patients will experience a recurrence after their resection, leading to an increased risk of death. Cancer staging is currently the gold standard for establishing a patient's prognosis and can help clinicians determine patients who may benefit from additional therapy. However, medical images which are used to help determine the cancer stage, have been shown to hold unutilized prognostic information that can augment clinical data and better identify high-risk NSCLC patients. There remains an unmet need for models to incorporate clinical, pathological, surgical, and imaging information, and extend beyond the current staging system to assist clinicians in identifying patients who could benefit from additional therapy immediately after surgery.\nPURPOSE: We aimed to determine whether a deep learning model (DLM) integrating FDG PET and CT imaging from the thoracic cavity along with clinical, surgical, and pathological information can predict NSCLC recurrence-free survival (RFS) and stratify patients into risk groups better than conventional staging.\nMATERIALS AND METHODS: Surgically resected NSCLC patients enrolled between 2009 and 2018 were retrospectively analyzed from two academic institutions (local institution: 305 patients; external validation: 195 patients). The thoracic cavity (including the lungs, mediastinum, pleural interfaces, and thoracic vertebrae) was delineated on the preoperative FDG PET and CT images and combined with each patient's clinical, surgical, and pathological information. Using the local cohort of patients, a multi-modal DLM using these features was built in a training cohort (n = 225), tuned on a validation cohort (n = 45), and evaluated on testing (n = 35) and external validation (n = 195) cohorts to predict RFS and stratify patients into risk groups. The area under the curve (AUC), Kaplan-Meier curves, and log-rank test were used to assess the prognostic value of the model. The DLM's stratification performance was compared to the conventional staging stratification.\nRESULTS: The multi-modal DLM incorporating imaging, pathological, surgical, and clinical data predicted RFS in the testing cohort (AUC = 0.78 [95% CI:0.63-0.94]) and external validation cohort (AUC = 0.66 [95% CI:0.58-0.73]). The DLM significantly stratified patients into high, medium, and low-risk groups of RFS in both the testing and external validation cohorts (multivariable log-rank p < 0.001) and outperformed conventional staging. Conventional staging was unable to stratify patients into three distinct risk groups of RFS (testing: p = 0.94; external validation: p = 0.38). Lastly, the DLM displayed the ability to further stratify patients significantly into sub-risk groups within each stage in the testing (stage I: p = 0.02, stage II: p = 0.03) and external validation (stage I: p = 0.05, stage II: p = 0.03) cohorts.\nCONCLUSION: This is the first study to use multi-modality imaging along with clinical, surgical, and pathological data to predict RFS of NSCLC patients after surgery. The multi-modal DLM better stratified patients into risk groups of poor outcomes when compared to conventional staging and further stratified patients within each staging classification. This model has the potential to assist clinicians in better identifying patients that may benefit from additional therapy.",
    "abstract_zh": "",
    "summary_zh": "",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17862",
    "link": "https://doi.org/10.1002/mp.17862"
  },
  {
    "title": "Evaluation of a motion correction algorithm in lung cancer PET/CT: Phantom validation and patient studies.",
    "authors": [
      "Ziyang Wang",
      "Jianjing Liu",
      "Di Lu",
      "Guoqing Sui",
      "Yaya Wang",
      "Lina Tong",
      "Xueyao Liu",
      "Yan Zhang",
      "Jie Fu",
      "Wengui Xu",
      "Dong Dai"
    ],
    "abstract": "BACKGROUND: Data-driven gating (DDG) is an emerging technology that can reduce the respiratory motion artifacts in positron emission tomography (PET) images.\nPURPOSE: The aim of this study is to use phantom and patient data to validate the performance of DDG with a motion correction algorithm based on the reconstruct, register, and average (RRA) method.\nMETHODS: A customized motion platform drove the phantom (five spheres with diameters of 10-28 mm) using a periodic motion that had a duration of 3-5 s and amplitudes of 2-4 cm. Normalized ratio of ungated and RRA PET relative to the ground-truth static PET was calculated for RSUVmax, RSUVmean, RSUVpeak, RVolume, and relative contrast-to-noise ratio (RCNR). Additionally, 30 lung cancer patients with 76 lung lesions less than 3 cm in diameter were prospectively studied. The overall image quality of patient examination was scored using a 5-point scale by two radiologists. SUVmax, SUVmean, SUVpeak, volume, and CNR of lesions measured in ungated and RRA PET were compared, and subgroup analysis was conducted.\nRESULTS: In RRA PET images, motion artifacts of the spheres in the phantom were effectively mitigated, regardless of changes in movement amplitudes or duration. For all spheres with different ranges of motion and cycles, RSUVmax, RSUVmean, RSUVpeak, and RCNR increased significantly (p ≤ 0.001) and RVolume decreased significantly (p < 0.001) in RRA PET images. The average radiologist scores of image quality were 3.90 ± 0.86 with RRA PET, and 3.03 ± 1.19 with ungated PET. In RRA PET images, the SUVmax (p < 0.001), SUVmean (p < 0.001), SUVpeak (p < 0.001), and CNR (p < 0.001) of the lesions increased, while the volume (p < 0.001) of the lesions decreased. Δ%SUVmax, Δ%SUVmean, Δ%SUVpeak, and Δ%CNR of the lesions increased by 3.9%, 6.5%, 5.6%, and 4.3%, respectively, while Δ%Volume of the lesions decreased by 18.4%. Subgroup analysis showed that in lesions in the upper and middle lobes, only SUVpeak (p < 0.001) significantly increased by 5.6% in RRA PET, while their volume (p < 0.001) notably decreased by 12.4% (p < 0.001).\nCONCLUSION: DDG integrated with RRA motion correction algorithm can effectively mitigate motion artifacts, thus enhancing the quantification accuracy and visual quality of images in lung cancer PET/CT.",
    "abstract_zh": "",
    "summary_zh": "",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17846",
    "link": "https://doi.org/10.1002/mp.17846"
  },
  {
    "title": "Hepatocellular carcinoma 18F-FDG PET/CT kinetic parameter estimation based on the advantage actor-critic algorithm.",
    "authors": [
      "Jianfeng He",
      "Siming Li",
      "Yiwei Xiong",
      "Yu Yao",
      "Siyu Wang",
      "Sidan Wang",
      "Shaobo Wang"
    ],
    "abstract": "BACKGROUND: Kinetic parameters estimated with dynamic 18F-fluorodeoxyglucose (18F-FDG) positron emission tomography (PET)/computed tomography (CT) help characterize hepatocellular carcinoma (HCC), and deep reinforcement learning (DRL) can improve kinetic parameter estimation.\nPURPOSE: The advantage actor-critic (A2C) algorithm is a DRL algorithm with neural networks that seek the optimal parameters. The aim of this study was to preliminarily assess the role of the A2C algorithm in estimating the kinetic parameters of 18F-FDG PET/CT in patients with HCC.\nMATERIALS AND METHODS: 18F-FDG PET data from 14 liver tissues and 17 HCC tumors obtained via a previously developed, abbreviated acquisition protocol (5-min dynamic PET/CT imaging supplemented with 1-min static imaging at 60 min) were prospectively collected. The A2C algorithm was used to estimate kinetic parameters with a reversible double-input, three-compartment model, and the results were compared with those of the conventional nonlinear least squares (NLLS) algorithm. Fitting errors were compared via the root-mean-square errors (RMSEs) of the time activity curves (TACs).\nRESULTS: Significant differences in K1, k2, k3, k4, fa, and vb according to the A2C algorithm and k3, fa, and vb according to the NLLS algorithm were detected between HCC and normal liver tissues (all p < 0.05). Furthermore, A2C demonstrated superior diagnostic performance over NLLS in terms of k3 and vb (both p < 0.05 in the Delong test). Notably, A2C yielded a smaller fitting error for normal liver tissue (0.62 ± 0.24 vs. 1.04 ± 1.00) and HCC tissue (1.40 ± 0.42 vs. 1.51 ± 0.97) than did NLLS.\nCONCLUSIONS: Compared with the conventional postreconstruction NLLS method, the A2C algorithm can more precisely estimate 18F-FDG kinetic parameters with a reversible double-input, three-compartment model for HCC tumors, attaining better TAC fitting with a lower RMSE.",
    "abstract_zh": "",
    "summary_zh": "",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17851",
    "link": "https://doi.org/10.1002/mp.17851"
  },
  {
    "title": "Predicting [177Lu]Lu-DOTA-TATE dosimetry by using pre-therapy [68Ga]Ga-DOTA-TATE PET/CT and biomarkers in patient with neuroendocrine tumors.",
    "authors": [
      "Hongxing Yang",
      "Ming Qi",
      "Zhihao Chen",
      "Fei Liu",
      "Junyan Xu",
      "Xiaoping Xu",
      "Qing Kong",
      "Jianping Zhang",
      "Shaoli Song"
    ],
    "abstract": "BACKGROUND: Lutetium-177 DOTA-TATE peptide receptor radionuclide therapy (PRRT) is an established and effective treatment modality for patients with metastatic neuroendocrine tumors (NETs).\nPURPOSE: This study aims to predict patient-absorbed doses from [177Lu]Lu-DOTA-TATE PRRT in the liver, kidney and lesion by utilizing patient-specific absorbed doses from pre-therapeutic [68Ga]Ga-DOTA-TATE PET/CT.\nMETHODS: Before the treatment of cycle 1, 11 patients with NETs underwent PET/CT scans at 0.5, 1.0, 2.0 and 4.0 h after the injection of [68Ga]Ga-DOTA-TATE. Patients then received [177Lu]Lu-DOTA-TATE PRRT and underwent SPECT/CT scans at 4, 24, 96, and 168 h post-administration. The segmentations and dosimetry were performed by using a professional software. The linear regression model used the absorbed doses from [68Ga]Ga-DOTA-TATE alone as the predictor variable. The multiple linear regression model used the absorbed doses from [68Ga]Ga-DOTA-TATE and the relevant clinical biomarkers as the predictor variables.\nRESULTS: The mean absorbed doses from [177Lu]Lu-DOTA-TATE PRRT in kidney and liver were 4.1 and 2.1 Gy, respectively. In comparison, the mean absorbed doses from [68Ga]Ga-DOTA-TATE were significantly lower: 18.0 mGy and 11.0 mGy, respectively. For lesions, the maximum absorbed dose from [68Ga]Ga-DOTA-TATE ranged from 24.1 to 170.4 mGy, while the maximum absorbed dose from [177Lu]Lu-DOTA-TATE PRRT was significantly higher, ranging from 9.6 to 77.9 Gy. The linear regression model yielded moderate R-squared values of 0.50, 0.59, and 0.36 for kidney, liver and lesion, respectively. The performance of multiple linear regression model was better, with R-squared values increasing to 0.81, 0.77, and 0.84.\nCONCLUSION: Absorbed doses from [177Lu]Lu-DOTA-TATE PRRT can be accurately predicted. Moreover, our models are formalized into simple equations.",
    "abstract_zh": "",
    "summary_zh": "",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17852",
    "link": "https://doi.org/10.1002/mp.17852"
  },
  {
    "title": "Predictive models of epidermal growth factor receptor mutation in lung adenocarcinoma using PET/CT-based radiomics features.",
    "authors": [
      "Zhikang Deng",
      "Di Jin",
      "Pei Huang",
      "Changchun Wang",
      "Yaohong Deng",
      "Rong Xu",
      "Bing Fan"
    ],
    "abstract": "BACKGROUND: Lung adenocarcinoma (LAC) comprises a substantial subset of non-small cell lung cancer (NSCLC) diagnoses, where epidermal growth factor receptor (EGFR) mutations play a pivotal role as indicators for therapeutic intervention with targeted agents. The emerging field of radiomics, which involves the extraction of numerous quantitative attributes from medical imaging, when coupled with positron emission tomography/ computed tomography (PET/CT) technology, has demonstrated promise in the prognostication of EGFR mutation status. The objective of this investigation is to construct and validate predictive models for EGFR mutations in LAC by leveraging PET/CT-derived radiomics features, thereby refining diagnostic precision and facilitating tailored treatment strategies.\nPURPOSE: The aim of this study was to develop a non-invasive radiomics model based on PET/CT with excellent performance for predicting the EGFR mutation status in LAC. Thus, it can provide the basis for the individualized treatment decision of patients.\nMETHODS: Positron emission tomography (PET), computed tomography (CT), clinical and pathological data of 112 patients with LAC admitted to our hospital from January 2019 to June 2023 were retrospectively analyzed. This research cohort encompassed 54 LAC patients with EGFR wild type and 58 LAC patients with EGFR mutated type. The participants were randomly assigned to the training group (n = 78) and the validation group (n = 34) in a 7:3 ratio. A sum of 3562 radiomics attributes were derived from PET/CT scans. The minimal absolute shrinkage and selection operator method was employed to identify 13 notable features. Based on these characteristics, support vector machine (SVM), gradient boosting decision tree (GBDT), random forest (RF) and extreme gradient boosting (XGBOOST) were constructed. The forecasting effectiveness of the model was assessed using the area under the receiver operating characteristic (ROC) Curve, the DeLong test, and decision curve analysis (DCA).\nRESULTS: SVM performance in PET/CT radiomics model was higher than that of other machine learning models (training group areas under the curve [AUC] of 0.916 and validation group AUC of 0.945, respectively). The integration of radiomics and clinical data did not yield a superior predictive performance compared to the radiomics model alone in terms of estimating EGFR mutation status (AUC: 0.916 vs. 0.921, 0.945 vs. 0.955, p> 0.05, in both the training and validation groups).\nCONCLUSIONS: The SVM model has emerged as a commendable non-invasive technique, showing high precision and dependability in forecasting EGFR mutation statuses in individuals with LAC. The radiomics model derived from PET/CT scans holds promise as a prognostic indicator of EGFR mutations in LAC, offering a valuable tool that could refine personalized therapeutic strategies and ultimately enhance the prognosis for LAC patients.",
    "abstract_zh": "",
    "summary_zh": "",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17780",
    "link": "https://doi.org/10.1002/mp.17780"
  }
]