[
  {
    "title": "Simulation and one-ring prototyping of 1 mm-rod-resolution hemispherical brain PET with TOF-DOI detectors.",
    "authors": [
      "Kurumi Narita",
      "Go Akamatsu",
      "Eiji Yoshida",
      "Hideaki Tashima",
      "Yuma Iwao",
      "Miwako Takahashi",
      "Taiga Yamaya"
    ],
    "abstract": "Objective.Brain positron emission tomography (PET) imaging plays crucial roles in research and diagnosis of various brain diseases. To achieve high spatial resolution and high sensitivity, we proposed a hemispherical geometry which offers higher sensitivity with fewer detectors than a conventional cylindrical geometry. Our developed hemispherical brain PET system, Vrain, has indeed achieved a rod resolution of 2.2 mm with a 229 ps time-of-flight (TOF) resolution. To further improve the spatial resolution, we will use TOF and depth-of-interaction (DOI) detectors with our original crosshair light-sharing (CLS) configuration. This study aimed at estimating the performance of the hemispherical brain PET with TOF-DOI detectors and at developing a one-ring PET prototype with 1.6 mm scintillator pitch CLS-based TOF-DOI detectors.Approach.The sensitivity, rod resolution, and image quality of the TOF-DOI hemispherical brain PET (TDHBP-sim) and Vrain (Vrain-sim) were estimated using Geant4 simulation. A one-ring prototype with a 30 cm diameter was developed using the CLS-based TOF-DOI detectors. The energy resolution, TOF timing resolution, rod resolution, and the Hoffman brain phantom image quality of the prototype were evaluated.Main results.In the simulation study, TDHBP-sim achieved 1.4 times better sensitivity than Vrain-sim. TDHBP-sim visualized 1.0 mm rods and gyri and sulci structures in the brain phantom. In the one-ring experiment, the energy resolution was 11.6% at 511 keV, the TOF timing resolution was 294.6 ps, and 1.0 mm rods were resolved at the central 10 cm-diameter field-of-view. The 0.8 mm-thick radioactivity distribution could be identified in the Hoffman phantom.Significance.The study findings suggested that a hemispherical brain PET with 1.6 mm scintillator pitch TOF-DOI detectors should offer excellent performance including 1 mm rod resolution.",
    "abstract_zh": "**翻译：**<br><br>**目的。** 脑部正电子发射断层扫描（PET）成像在各种脑部疾病的研究和诊断中发挥着关键作用。为了实现高空间分辨率和高灵敏度，我们提出了一种半球形几何结构，与传统的圆柱形几何结构相比，该结构能够以更少的探测器提供更高的灵敏度。我们开发的半球形脑部 PET 系统 Vrain 确实实现了 2.2 毫米的杆分辨率和 229 皮秒的飞行时间 (TOF) 分辨率。为了进一步提高空间分辨率，我们将使用具有我们独创的十字线光共享 (CLS) 配置的 TOF 和深度信息 (DOI) 探测器。本研究旨在评估具有 TOF-DOI 探测器的半球形脑部 PET 的性能，并开发一个基于 CLS 的 TOF-DOI 探测器（晶体闪烁体间距为 1.6 毫米）的单环 PET 原型机。<br><br>**方法。** 使用 Geant4 模拟评估了 TOF-DOI 半球形脑部 PET (TDHBP-sim) 和 Vrain (Vrain-sim) 的灵敏度、杆分辨率和图像质量。使用基于 CLS 的 TOF-DOI 探测器开发了一个直径为 30 厘米的单环原型机。评估了该原型机的能量分辨率、TOF 时间分辨率、杆分辨率和 Hoffman 脑部模型图像质量。<br><br>**主要结果。** 在模拟研究中，TDHBP-sim 的灵敏度比 Vrain-sim 提高了 1.4 倍。TDHBP-sim 可视化了脑部模型中的 1.0 毫米杆以及脑回和脑沟结构。在单环实验中，511 keV 时的能量分辨率为 11.6%，TOF 时间分辨率为 294.6 ps，并且在中心 10 厘米直径的视野范围内可以分辨出 1.0 毫米的杆。在 Hoffman 模型中可以识别出 0.8 毫米厚的放射性分布。<br><br>**意义。** 研究结果表明，具有 1.6 毫米晶体闪烁体间距的 TOF-DOI 探测器的半球形脑部 PET 应具有出色的性能，包括 1 毫米的杆分辨率。",
    "summary_zh": "本研究旨在通过改进PET系统设计，提高脑部PET成像的空间分辨率和灵敏度。研究者提出并模拟了一种半球形几何结构的PET系统，并结合TOF-DOI探测器和十字线光共享技术，预期能达到优于现有系统的性能。实验结果初步验证了该设计在分辨率和灵敏度方面的潜力，表明这种新型PET系统有望实现1毫米的杆分辨率，并清晰呈现脑部微小结构。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/ade2b4",
    "link": "https://doi.org/10.1088/1361-6560/ade2b4"
  },
  {
    "title": "Enhancing image quality in fast neutron-based range verification of proton therapy using a deep learning-based prior in LM-MAP-EM reconstruction.",
    "authors": [
      "Lena M Setterdahl",
      "Kyrre Skjerdal",
      "Hunter N Ratliff",
      "Kristian Smeland Ytre-Hauge",
      "William R B Lionheart",
      "Sean Holman",
      "Helge E S Pettersen",
      "Francesco Blangiardi",
      "Danny Lathouwers",
      "Ilker Meric"
    ],
    "abstract": "Objective.This study investigates the use of list-mode (LM) maximuma posteriori(MAP) expectation maximization (EM) incorporating prior information predicted by a convolutional neural network for image reconstruction in fast neutron (FN)-based proton therapy range verification.Approach. A conditional generative adversarial network (pix2pix) was trained on progressively noisier data, where detector resolution effects were introduced gradually to simulate realistic conditions. FN data were generated using Monte Carlo simulations of an 85 MeV proton pencil beam in a computed tomography-based lung cancer patient model, with range shifts emulating weight gain and loss. The network was trained to estimate the expected two-dimensional ground truth FN production distribution from simple back-projection images. Performance was evaluated using mean squared error, structural similarity index (SSIM), and the correlation between shifts in predicted distributions and true range shifts.Main results. Our results show that pix2pix performs well on noise-free data but suffers from significant degradation when detector resolution effects are introduced. Among the LM-MAP-EM approaches tested, incorporating a mean prior estimate into the reconstruction process improved performance, with LM-MAP-EM using a mean prior estimate outperforming naïve LM maximum likelihood EM (LM-MLEM) and conventional LM-MAP-EM with a smoothing quadratic energy function in terms of SSIM.Significance. Findings suggest that deep learning techniques can enhance iterative reconstruction for range verification in proton therapy. However, the effectiveness of the model is highly dependent on data quality, limiting its robustness in high-noise scenarios.",
    "abstract_zh": "翻译：<br><br>**目的：** 本研究探讨了使用列表模式（LM）最大后验（MAP）期望最大化（EM）算法，结合卷积神经网络预测的先验信息，进行基于快中子（FN）的质子治疗射程验证中的图像重建。<br><br>**方法：** 训练了一个条件生成对抗网络（pix2pix），该网络使用逐渐增加噪声的数据进行训练，其中逐渐引入探测器分辨率效应，以模拟真实条件。使用蒙特卡洛模拟生成快中子数据，模拟了一个基于计算机断层扫描（CT）的肺癌患者模型中85 MeV质子笔形束的情况，射程偏移模拟了体重增加和减少。该网络被训练成从简单的反投影图像中估计预期的二维真实快中子产生分布。使用均方误差（MSE）、结构相似性指数（SSIM）以及预测分布偏移与真实射程偏移之间的相关性来评估性能。<br><br>**主要结果：** 结果表明，pix2pix在无噪声数据上表现良好，但在引入探测器分辨率效应时性能显著下降。在测试的LM-MAP-EM方法中，将平均先验估计纳入重建过程可以提高性能，其中使用平均先验估计的LM-MAP-EM算法在SSIM方面优于朴素的LM最大似然EM（LM-MLEM）算法和具有平滑二次能量函数的传统LM-MAP-EM算法。<br><br>**意义：** 研究结果表明，深度学习技术可以增强质子治疗中射程验证的迭代重建。然而，该模型的有效性高度依赖于数据质量，限制了其在高噪声场景中的鲁棒性。",
    "summary_zh": "本研究探索利用深度学习中的条件生成对抗网络（pix2pix）辅助快中子质子治疗射程验证的图像重建。虽然pix2pix在理想条件下表现出色，但在引入实际探测器分辨率效应后性能下降。实验结果表明，在LM-MAP-EM算法中引入深度学习预测的平均先验信息可以改善图像重建效果，尤其是在结构相似性方面优于传统算法。然而，模型的鲁棒性受限于数据质量，在高噪声环境下表现不佳。该研究表明深度学习技术在质子治疗射程验证迭代重建中具有潜力，但也强调了其对数据质量的依赖性。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/ade198",
    "link": "https://doi.org/10.1088/1361-6560/ade198"
  },
  {
    "title": "Development of an ultrasensitive small animal PET with 4-layer DOI detectors for sub-second dynamic rodent imaging.",
    "authors": [
      "Han Gyu Kang",
      "Hideaki Tashima",
      "Hidekatsu Wakizaka",
      "Go Akamatsu",
      "Yuma Iwao",
      "Chie Toramatsu",
      "Taiga Yamaya"
    ],
    "abstract": "Objective.Dynamic positron emission tomography (PET) imaging is important for preclinical research since it can visualize the functional information of rodent models as a function of time. However, the temporal resolution of small animal PET imaging has been limited to a scale of seconds due to low sensitivity, and it is not sufficient to capture cardiac or brain function accurately. Here, we present an ultrasensitive small-animal PET scanner with total-body coverage for sub-second dynamic imaging of a rat.Methods.The ultrasensitive small animal PET scanner has a 155 mm inner diameter and 325.6 mm axial coverage. The PET scanner has six rings, each of which has 10 depth-of-interaction (DOI) detectors. Each DOI detector consists of a four-layer Zr-doped gadolinium oxyorthosilicate crystal array (2.85 mm pitch, 30 mm total thickness) and 8 × 8 multi-anode photomultiplier tubes. The physical PET performance was evaluated based on the National Electrical Manufacturers Association NU4 protocol. Sub-second dynamic rat imaging was performed with18F-FDG tracer.Main results.The peak absolute sensitivity was 20.2% and spatial resolution was 2.6 mm at the center of the field of view with an energy window of 400-600 keV. Total-body images of a rat were obtained with a single bed position. The cardiac function of a rat was visualized with 0.25 s temporal resolution, which was hardly possible with conventional small animal PET scanners.Significance. The developed ultrasensitive animal PET enabled sub-second dynamic PET imaging in rodent models with total-body coverage. In conclusion, the ultrasensitive small animal PET scanner can serve as a useful molecular imaging tool for preclinical research with its long axial coverage sub-second temporal resolution.",
    "abstract_zh": "**翻译：**<br><br>**目的。** 动态正电子发射断层扫描(PET)成像对于临床前研究至关重要，因为它能够以时间为函数可视化啮齿动物模型的功能信息。然而，由于灵敏度低，小动物PET成像的时间分辨率一直被限制在秒级，不足以准确捕捉心脏或大脑功能。在此，我们介绍一种超高灵敏度的小动物PET扫描仪，具有全身覆盖范围，能够对大鼠进行亚秒级动态成像。<br><br>**方法。** 该超高灵敏度小动物PET扫描仪的内径为155毫米，轴向覆盖范围为325.6毫米。该PET扫描仪有六个环，每个环都有10个深度交互(DOI)探测器。每个DOI探测器由一个四层掺锆钆硅酸钇晶体阵列（2.85毫米间距，30毫米总厚度）和8×8多阳极光电倍增管组成。基于美国国家电子制造商协会NU4协议评估了物理PET性能。使用<sup>18</sup>F-FDG示踪剂进行了亚秒级动态大鼠成像。<br><br>**主要结果。** 在400-600 keV的能量窗下，峰值绝对灵敏度为20.2%，视场中心的空间分辨率为2.6毫米。采用单床位获得了大鼠的全身图像。以0.25秒的时间分辨率可视化了大鼠的心脏功能，这在传统的的小动物PET扫描仪上几乎是不可能的。<br><br>**意义。** 开发的超高灵敏度动物PET能够对具有全身覆盖范围的啮齿动物模型进行亚秒级动态PET成像。总之，超高灵敏度小动物PET扫描仪凭借其较长的轴向覆盖范围和亚秒级时间分辨率，可以作为临床前研究的有用分子成像工具。",
    "summary_zh": "该研究开发了一种超高灵敏度的小动物PET扫描仪，具有全身覆盖范围和亚秒级时间分辨率。实验结果表明，该扫描仪具有优异的灵敏度和空间分辨率，能够以0.25秒的时间分辨率可视化大鼠的心脏功能，突破了传统小动物PET扫描仪的局限性。该扫描仪可作为临床前研究中一种强大的分子成像工具。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/ade112",
    "link": "https://doi.org/10.1088/1361-6560/ade112"
  },
  {
    "title": "Physical phantom validation of clustering-initiated factorization in dynamic PET.",
    "authors": [
      "Valerie Kobzarenko",
      "Suzanne L Baker",
      "Mustafa Janabi",
      "Woon-Seng Choong",
      "Grant T Gullberg",
      "Youngho Seo",
      "Rostyslav Boutchko",
      "Debasis Mitra"
    ],
    "abstract": "BACKGROUND: Dynamic positron emission tomography (PET) enables the quantification of physiological parameters of radiotracers employed in the investigation of neuropsychiatric disorders. We previously introduced a factor analysis-based algorithm, Cluster-Initialized Factor Analysis (CIFA), designed to overcome the problem of specifying reference regions. CIFA is capable of automatically extracting distinct radiotracer binding distributions across many modalities based on the differences in tracer dynamics, and thus can distinguish regions of specific- and non-specific binding without requiring prior segmentation.\nPURPOSE: Our goal is to quantitatively validate the ability of CIFA to resolve different dynamic biological processes by comparing the output of the algorithm to an independent benchmark. As an intermediate goal, we aim to create a physical phantom capable of modeling unique aspects of dynamic imaging and to use this phantom as the benchmark in evaluating CIFA.\nMETHODS: CIFA was used to reconstruct 18F-flortaucipir dynamic brain PET datasets acquired at Lawrence Berkeley National Lab. The resulting factor curves served as the foundation for creating dynamic input time-activity curve (TAC) combinations in a physical brain phantom specifically constructed for this purpose. The phantom represented three components: two overlapping tissue types and free radiotracer, constructed with a combination of small hydraulic elements. The physical components were scanned separately to generate a library of images, allowing us to reproduce scans of any duration with prescribed dynamics and realistic partial volume effects. The phantom was designed to produce noisy instances with compartment mixing of dynamic scans with desired activity TACs for free, non-specifically bound, and specifically bound radiotracers. Ten distinct dynamic simulations with varying levels of TAC similarity were estimated with CIFA.\nRESULTS: We directly evaluated CIFA's performance in analyzing each of the 10 dynamic datasets by computing the Pearson correlation coefficient between the estimated outputs and the ground truth tissue TACs and corresponding tissue distributions. For seven out of 10 modeled dynamics, which captured the full spectrum of realistically expected tissue TAC shapes, the curve correlation of the specific binding tissue was above 95%.\nCONCLUSIONS: This work formulated an innovative process by combining a physical phantom design with PET images for evaluating the application of CIFA in the extraction of dynamic TACs from dynamic PET image data. In most cases the CIFA algorithm accurately reproduced the dynamics of the phantom simulated data.",
    "abstract_zh": "**翻译：**<br><br>背景：动态正电子发射断层扫描（PET）能够量化放射性示踪剂的生理参数，这些示踪剂被用于神经精神疾病的研究。我们之前介绍了一种基于因子分析的算法，即簇初始化因子分析（CIFA），旨在克服指定参考区域的问题。CIFA能够基于示踪剂动力学的差异，自动提取跨多种模态的不同放射性示踪剂结合分布，从而区分特异性结合和非特异性结合区域，而无需预先分割。<br><br>目的：我们的目标是通过将算法的输出与独立的基准进行比较，来定量验证CIFA解决不同动态生物过程的能力。作为一个中间目标，我们旨在创建一个能够模拟动态成像独特方面的物理体模，并使用该体模作为评估CIFA的基准。<br><br>方法：我们使用CIFA重建了在劳伦斯伯克利国家实验室获取的18F-flortaucipir动态脑部PET数据集。由此产生的因子曲线为创建一个专门为此目的构建的物理脑部体模中的动态输入时间-放射性曲线（TAC）组合奠定了基础。该体模代表了三个组成部分：两种重叠的组织类型和游离的放射性示踪剂，由小型液压元件组合构成。物理组件被单独扫描以生成图像库，从而使我们能够重现具有规定动力学和真实部分容积效应的任何持续时间的扫描。该体模旨在生成具有所需放射性示踪剂游离、非特异性结合和特异性结合活动的TAC的动态扫描的噪声实例，并包含室间隔混合。使用CIFA估计了十个具有不同TAC相似度的不同动态模拟。<br><br>结果：我们通过计算估计输出与真实组织TAC及其相应组织分布之间的Pearson相关系数，直接评估了CIFA在分析10个动态数据集中的性能。对于捕获现实预期组织TAC形状完整频谱的10个建模动力学中的7个，特异性结合组织的曲线相关性高于95%。<br><br>结论：这项工作通过将物理体模设计与PET图像相结合，构建了一个创新的流程，用于评估CIFA在从动态PET图像数据中提取动态TAC的应用。在大多数情况下，CIFA算法准确地再现了体模模拟数据的动力学。",
    "summary_zh": "该研究旨在验证CIFA算法在动态PET数据分析中的性能。研究人员构建了一个能够模拟脑部动态成像的物理体模，并使用CIFA算法分析了基于该体模生成的18F-flortaucipir动态PET数据。通过比较CIFA的输出和体模的真实时间-放射性曲线（TAC），结果表明CIFA能够准确地提取动态TAC，尤其是在特异性结合组织中，证明了CIFA在动态PET数据处理中的有效性。该研究为评估和改进动态PET数据分析方法提供了一个创新途径。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17902",
    "link": "https://doi.org/10.1002/mp.17902"
  },
  {
    "title": "Modeling prompt gamma (PG) emission, detection and imaging in real patient anatomy using a novel Compton camera for dose verification in proton therapy.",
    "authors": [
      "V R Sharma",
      "Z Jiang",
      "S Mossahebi",
      "E Shakeri",
      "A Chalise",
      "M K Gobbert",
      "S W Peterson",
      "J C Polf",
      "L Ren"
    ],
    "abstract": "Objective. Prompt gamma (PG) imaging is a promising modality for proton dose verification. Currently, there is a lack of effective tools to investigate the entire PG imaging process in patient anatomy, from PG emission to camera detection and image reconstruction, to evaluate and optimize its efficacy for dose verification in proton therapy.Approach. To address this gap, we developed a Monte-Carlo package, POLARIS J Monte Carlo (PJ-MC), that simulates the entire PG emission and imaging workflow in patient anatomy. We utilized Geant4 classes and G4-ancillary tools, employing the DCMTK external tool with G4PhantomParameterisation to convert patient CT data into voxelized geometries. Proton beams were modeled based on medical physics commissioning data. A novel two-stage POLARIS-J3 Compton-Camera was simulated under the patient couch for recording total, double, and triple scattered PG signals. Proton maximum range calculations from the PJ-MC are compared with dose calculations from a clinical treatment planning system. The detected PG signals data in the simulation were used to reconstruct PG images using Kernel- Weighted-Back-Projection algorithm.Main results. Analysis of gamma energy distribution showed a decay pattern with clear emission lines from nuclear reactions involving oxygen, carbon, nitrogen, and calcium. Neutron-induced reactions contribute significantly less-by an order of magnitude-compared to proton-induced reactions in various tissues. Mean absolute percentage error analysis showed that PG range verification was more stable when considering the range at 80%or 50%ofDmax, as opposed to the range at theDmax, where energy gating slightly improves accuracy but may reduce localization due to photon loss. Results showed that patient anatomy can impact the location of hot spot in the PG images, affecting its accuracy for localizing Bragg peak.Significance. In summary, our simulation package provides additional insights into PG emission and imaging in patient anatomy and serves as a robust tool for evaluating and optimizing PG imaging, enhancing its precision for dose verification in proton therapy.",
    "abstract_zh": "**翻译：**<br><br>**目的。** 即发伽马（PG）成像是一种极具前景的质子剂量验证方法。目前，缺乏有效的工具来研究患者解剖结构中从PG发射到相机探测和图像重建的整个PG成像过程，从而评估和优化其在质子治疗中进行剂量验证的效能。<br><br>**方法。** 为了弥补这一不足，我们开发了一个蒙特卡洛软件包，POLARIS J Monte Carlo (PJ-MC)，该软件包能够模拟患者解剖结构中整个PG发射和成像流程。我们利用了Geant4类和G4辅助工具，并采用DCMTK外部工具与G4PhantomParameterisation结合，将患者CT数据转换为体素化几何结构。质子束根据医学物理调试数据进行建模。在患者治疗床下方模拟了一个新型的两级POLARIS-J3康普顿相机，用于记录总的、双重和三重散射的PG信号。将PJ-MC计算得到的质子最大射程与临床治疗计划系统的剂量计算结果进行比较。模拟中检测到的PG信号数据被用于使用核加权反投影算法重建PG图像。<br><br>**主要结果。** 伽马能量分布分析显示出一个衰减模式，并显示了来自涉及氧、碳、氮和钙的核反应的清晰发射线。中子诱导的反应与质子诱导的反应相比，在各种组织中的贡献明显较小，约为一个数量级。平均绝对百分比误差分析表明，在考虑80%或50%Dmax处的射程时，PG射程验证更加稳定，而不是在Dmax处的射程，能量门控略微提高了准确性，但可能由于光子损失而降低定位精度。结果表明，患者解剖结构会影响PG图像中热点的位置，从而影响其对布拉格峰进行定位的准确性。<br><br>**意义。** 总之，我们的模拟软件包为患者解剖结构中的PG发射和成像提供了额外的见解，并作为一个强大的工具来评估和优化PG成像，从而提高其在质子治疗中进行剂量验证的精度。",
    "summary_zh": "该摘要介绍了一个名为POLARIS J Monte Carlo (PJ-MC) 的蒙特卡洛模拟软件包，用于研究即发伽马（PG）成像在质子治疗剂量验证中的应用。该软件包能够模拟PG的发射、相机探测和图像重建全过程。研究结果表明，该软件包可以提供对PG发射和成像过程的深入理解，并有助于评估和优化PG成像的准确性。此外，研究也发现患者的解剖结构会影响PG图像中热点的位置，进而影响布拉格峰的定位准确性。该软件包是一个有力的工具，可以提高PG成像在质子治疗剂量验证中的精度。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/addf0d",
    "link": "https://doi.org/10.1088/1361-6560/addf0d"
  },
  {
    "title": "Machine learning positioning algorithms for long semi-monolithic scintillator PET detectors.",
    "authors": [
      "Samuel Mungai Kinyanjui",
      "Zhonghua Kuang",
      "Zheng Liu",
      "Ning Ren",
      "Yongfeng Yang"
    ],
    "abstract": "Objective.In this work, machine learning positioning algorithms are developed to improve the spatial resolutions of the semi-monolithic scintillator detectors in both monolithic (y) and depth of interaction (z) directions.Approach.Two long semi-monolithic scintillator detectors consisting of 12 lutetium yttrium oxyorthosilicate (LYSO) slabs of 0.96 × 56 × 10 mm3and 14 LYSO slabs of 0.81 × 56 × 10 mm3were manufactured. The scintillator arrays were read out by a 4 × 16 silicon photomultiplier array. 27 × 5 (y, z) positions of each detector were irradiated via a collimated22Na pencil beam. Extreme gradient boosting (XGBoost) machine learning model was used to predict the interaction positions foryandz. The genetic algorithm (GA) or particle swarm optimization (PSO) algorithm was used to optimize hyperparameters for the XGBoost model. The results of the machine learning positioning algorithms were compared to analytical positioning methods.Main results.The GA and PSO algorithms provided similar results. Compared to the analytical methods, the machine learning positioning methods improved bothyandzspatial resolutions especially at both ends of the detectors. The averageyspatial resolutions using the machine learning positioning methods were 0.92 ± 0.41 mm and 0.94 ± 0.44 mm as compared to those obtained with the squared center of gravity method of 1.38 ± 0.23 mm and 1.39 ± 0.25 mm for the two detectors, respectively. The averagezspatial resolutions obtained with the machine learning positioning methods were 1.67 ± 0.41 mm and 1.68 ± 0.45 mm as compared to those obtained with inverse standard deviation method of 2.09 ± 0.82 mm and 2.14 ± 0.81 mm for the two detectors, respectively.Significance.With the machine learning positioning algorithms, the semi-monolithic scintillator detectors with submillimeter slab thickness evaluated in this work provide less than 1 mmyspatial resolution and less than 2 mmzspatial resolution.",
    "abstract_zh": "**翻译：**<br><br>**目的。** 本研究旨在开发机器学习定位算法，以提高半单片闪烁体探测器在单片（y）方向和深度交互（z）方向上的空间分辨率。<br><br>**方法。** 制造了两个长的半单片闪烁体探测器，分别由 12 个 0.96 × 56 × 10 mm3的镥钇正硅酸盐 (LYSO) 板和 14 个 0.81 × 56 × 10 mm3的 LYSO 板组成。 闪烁体阵列由一个 4 × 16 硅光电倍增管阵列读出。 使用准直的 22Na 笔形束照射每个探测器的 27 × 5 个 (y, z) 位置。 采用极端梯度提升 (XGBoost) 机器学习模型来预测 y 和 z 方向上的相互作用位置。 使用遗传算法 (GA) 或粒子群优化 (PSO) 算法来优化 XGBoost 模型的超参数。 将机器学习定位算法的结果与解析定位方法进行了比较。<br><br>**主要结果。** GA 和 PSO 算法提供了相似的结果。 与解析方法相比，机器学习定位方法提高了 y 和 z 方向的空间分辨率，尤其是在探测器的两端。 使用机器学习定位方法获得的平均 y 方向空间分辨率分别为 0.92 ± 0.41 mm 和 0.94 ± 0.44 mm，而使用平方重心法获得的平均 y 方向空间分辨率对于这两个探测器分别为 1.38 ± 0.23 mm 和 1.39 ± 0.25 mm。 使用机器学习定位方法获得的平均 z 方向空间分辨率分别为 1.67 ± 0.41 mm 和 1.68 ± 0.45 mm，而使用逆标准差方法获得的平均 z 方向空间分辨率对于这两个探测器分别为 2.09 ± 0.82 mm 和 2.14 ± 0.81 mm。<br><br>**意义。** 通过机器学习定位算法，本研究评估的具有亚毫米级板厚度的半单片闪烁体探测器可提供小于 1 mm 的 y 方向空间分辨率和小于 2 mm 的 z 方向空间分辨率。",
    "summary_zh": "该研究利用XGBoost机器学习模型结合遗传算法(GA)或粒子群优化(PSO)算法，显著提升了半单片闪烁体探测器的空间分辨率，尤其是在探测器两端。相较于传统解析方法，机器学习方法在y和z方向上均实现了更高的分辨率，分别达到亚毫米级和毫米级水平，表明该方法在提升探测器性能方面具有显著优势。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/addbbe",
    "link": "https://doi.org/10.1088/1361-6560/addbbe"
  },
  {
    "title": "Uncertainty quantification for deep learning-based metastatic lesion segmentation on whole body PET/CT.",
    "authors": [
      "Brayden Schott",
      "Victor Santoro-Fernandes",
      "Žan Klaneček",
      "Scott Perlman",
      "Robert Jeraj"
    ],
    "abstract": "Objective.Deep learning models are increasingly being implemented for automated medical image analysis to inform patient care. Most models, however, lack uncertainty information, without which the reliability of model outputs cannot be ensured. Several uncertainty quantification (UQ) methods exist to capture model uncertainty. Yet, it is not clear which method is optimal for a given task. The purpose of this work was to investigate several commonly used UQ methods for the critical yet understudied task of metastatic lesion segmentation on whole body PET/CT.Approach.59 whole body68Ga-DOTATATE PET/CT images of patients undergoing theranostic treatment of metastatic neuroendocrine tumors were used in this work. A 3D U-Net was trained for lesion segmentation following five-fold cross validation. Uncertainty measures derived from four UQ methods-probability entropy, Monte Carlo dropout, deep ensembles, and test time augmentation-were investigated. Each uncertainty measure was assessed across four quantitative evaluations: (1) its ability to detect artificially degraded image data at low, medium, and high degradation magnitudes; (2) to detect false-positive (FP) predicted regions; (3) to recover false-negative (FN) predicted regions; and (4) to establish correlations with model biomarker extraction and segmentation performance metrics.Mainresults.Test time augmentation and probability entropy respectively achieved the highest and lowest degraded image detection at low (AUC = 0.54 vs. 0.68), medium (AUC = 0.70 vs. 0.82), and high (AUC = 0.83 vs. 0.90) degradation magnitudes. For detecting FPs, all UQ methods achieve strong performance, with AUC values ranging narrowly between 0.77 and 0.81. FN region recovery performance was strongest for test time augmentation and weakest for probability entropy. Performance for the correlation analysis was mixed, where the strongest performance was achieved by test time augmentation for SUVtotalcapture (ρ= 0.57) and segmentation Dice coefficient (ρ= 0.72), by Monte Carlo dropout for SUVmeancapture (ρ= 0.35), and by probability entropy for segmentation cross entropy (ρ= 0.96).Significance.Overall, test time augmentation demonstrated superior UQ performance and is recommended for use in metastatic lesion segmentation task. It also offers the advantage of being post hoc and computationally efficient. In contrast, probability entropy performed the worst, highlighting the need for advanced UQ approaches for this task.",
    "abstract_zh": "**翻译：**<br><br>**目的。** 深度学习模型越来越多地被应用于自动化医学图像分析，以辅助患者的治疗。然而，大多数模型缺乏不确定性信息，这导致模型输出的可靠性无法得到保证。现已存在多种不确定性量化 (UQ) 方法来捕获模型的不确定性。但尚不清楚哪种方法最适合给定的任务。本研究旨在针对全身 PET/CT 上转移性病灶分割这一关键但研究不足的任务，调查几种常用的 UQ 方法。<br><br>**方法。** 本研究使用了 59 例接受转移性神经内分泌肿瘤放射性核素治疗的患者的全身<sup>68</sup>Ga-DOTATATE PET/CT 图像。训练了一个 3D U-Net 用于病灶分割，并进行了五折交叉验证。研究了从四种 UQ 方法（概率熵、蒙特卡洛 dropout、深度集成和测试时增强）导出的不确定性度量。每个不确定性度量都通过四个定量评估进行评估：（1）其在低、中、高降级幅度下检测人工降级图像数据的能力；（2）检测假阳性 (FP) 预测区域的能力；（3）恢复假阴性 (FN) 预测区域的能力；以及（4）建立与模型生物标志物提取和分割性能指标的相关性。<br><br>**主要结果。** 测试时增强和概率熵分别在低 (AUC = 0.54 vs. 0.68)、中 (AUC = 0.70 vs. 0.82) 和高 (AUC = 0.83 vs. 0.90) 降级幅度下实现了最高和最低的降级图像检测。在检测 FP 方面，所有 UQ 方法都取得了良好的性能，AUC 值窄幅分布在 0.77 和 0.81 之间。测试时增强的 FN 区域恢复性能最强，而概率熵最弱。相关性分析的性能各不相同，其中测试时增强在 SUV<sub>total</sub>捕获 (ρ= 0.57) 和分割 Dice 系数 (ρ= 0.72) 方面表现最佳，蒙特卡洛 dropout 在 SUV<sub>mean</sub>捕获 (ρ= 0.35) 方面表现最佳，而概率熵在分割交叉熵 (ρ= 0.96) 方面表现最佳。<br><br>**重要性。** 总体而言，测试时增强表现出卓越的 UQ 性能，建议用于转移性病灶分割任务。它还具有事后和计算效率高的优势。相比之下，概率熵表现最差，突出了该任务需要更高级的 UQ 方法。",
    "summary_zh": "本研究评估了四种不确定性量化 (UQ) 方法在全身PET/CT转移性病灶分割任务中的性能。结果表明，测试时增强方法在图像降级检测、假阴性区域恢复和与生物标志物提取/分割性能的相关性方面表现最佳，并具有计算效率高的优势，因此推荐用于该任务。概率熵方法表现最差，表明需要更高级的UQ方法。该研究强调了在深度学习医学图像分析中量化不确定性的重要性，并为选择合适的UQ方法提供了依据。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/add9df",
    "link": "https://doi.org/10.1088/1361-6560/add9df"
  },
  {
    "title": "Predicting and monitoring response to head and neck cancer radiotherapy using multimodality imaging and radiobiological digital twin simulations.",
    "authors": [
      "Eric Aliotta",
      "Jeho Jeong",
      "Ramesh Paudyal",
      "Milan Grkovski",
      "Bill Diplas",
      "James Han",
      "Vaios Hatzoglou",
      "Michalis Aristophanous",
      "Nadeem Riaz",
      "Heiko Schöder",
      "Nancy Y Lee",
      "Amita Shukla-Dave",
      "Joseph O Deasy"
    ],
    "abstract": "Objective.To predict radiotherapy treatment response for head and neck cancer (HNC) using multimodality imaging and personalized radiobiological modeling.Approach.A mechanistic radiobiological model was combined with multi-modality imaging data from diffusion weighted-magnetic resonance imaging and positron emission tomography scans with [18F]Fluorodeoxyglucose (FDG) and [18F]Fluoromisonidazole (FMISO) tracers to develop personalized treatment response models for human papilloma virus associated HNC patients undergoing chemo-radiotherapy. Models were initialized to incorporate patient-specific imaging and updated to reflect longitudinal measurements of nodal gross tumor volume throughout treatment. Prediction accuracy was assessed based on mean absolute error (MAE) of weekly volume predictions and in predicting locoregional recurrence (LRR) following treatment.Main results.Personalized modeling based on pretreatment imaging significantly improved longitudinal volume prediction accuracy and correlation with measurement compared with a generic population model (MAE = 23.4 ± 10.0% vs 24.9 ± 9.0%,p= 0.002 on pairedt-test,R= 0.82 vs 0.72). Adding volume measurements from weeks 1 and 2 further improved prediction accuracy for subsequent weeks (MAE = 12.5 ± 8.1%, 10.7 ± 9.9%). When incorporating feedback with longitudinal measurements, penalizing large deviations from pretreatment model parameters using a variational regularization method was necessary to maintain model stability. Model-predicted volumes based on baseline + week-1 information significantly improved LRR prediction compared with week-1 volume data alone (area under the curve, AUC = 0.83 vs 0.77,p= 0.03) and was similar to prediction using week-3 volume data (AUC = 0.83 vs 0.85,p= non-significant).Significance.The proposed approach, which integrates clinical imaging and radiobiological principles, could be a basis to guide pretreatment prescription personalization as well as on-treatment adaptations.",
    "abstract_zh": "**翻译：**<br><br>**目的：** 利用多模态影像和个体化放射生物学建模预测头颈癌（HNC）的放射治疗反应。<br><br>**方法：** 将一种机械性放射生物学模型与来自扩散加权磁共振成像和正电子发射断层扫描（PET）的多模态影像数据相结合，其中PET扫描使用了[18F]氟代脱氧葡萄糖（FDG）和[18F]氟米索硝唑（FMISO）示踪剂，从而为接受化疗放疗的人乳头瘤病毒相关HNC患者开发个体化治疗反应模型。模型初始化时纳入患者特定的影像数据，并根据治疗过程中淋巴结大体肿瘤体积的纵向测量进行更新。预测准确性基于每周体积预测的平均绝对误差（MAE）以及对治疗后局部区域复发（LRR）的预测进行评估。<br><br>**主要结果：** 与通用人群模型相比，基于治疗前影像的个体化建模显著提高了纵向体积预测的准确性和与测量的相关性（配对t检验：MAE = 23.4 ± 10.0% vs 24.9 ± 9.0%，p= 0.002，R= 0.82 vs 0.72）。添加第1周和第2周的体积测量进一步提高了后续几周的预测准确性（MAE = 12.5 ± 8.1%, 10.7 ± 9.9%）。当结合纵向测量数据进行反馈时，为了保持模型稳定性，必须使用变分正则化方法来惩罚与治疗前模型参数的较大偏差。基于基线+第1周信息的模型预测体积，与单独使用第1周体积数据相比，显著提高了LRR预测（曲线下面积，AUC = 0.83 vs 0.77，p= 0.03），并且与使用第3周体积数据的预测结果相似（AUC = 0.83 vs 0.85，p= 无统计学意义）。<br><br>**意义：** 该方法整合了临床影像和放射生物学原理，可以为指导治疗前处方个体化以及治疗中适应性调整提供基础。",
    "summary_zh": "本研究旨在利用多模态影像（MRI和PET）结合放射生物学模型，为头颈癌患者提供个体化的放疗反应预测。研究结果表明，基于治疗前影像的个体化建模能显著提高肿瘤体积的预测准确性，且结合治疗过程中的纵向测量数据（肿瘤体积变化）能进一步优化预测效果。该模型还显示出良好的局部区域复发预测能力，优于仅使用早期体积数据。该方法有望为头颈癌的个体化放疗方案制定和治疗过程中的方案调整提供依据。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/add9de",
    "link": "https://doi.org/10.1088/1361-6560/add9de"
  },
  {
    "title": "Whole-body CT-to-PET synthesis using a customized transformer-enhanced GAN.",
    "authors": [
      "Bangyan Xu",
      "Ziwei Nie",
      "Jian He",
      "Aimei Li",
      "Ting Wu"
    ],
    "abstract": "Background. Positron emission tomography with 2-deoxy-2-[fluorine-18]fluoro-D-glucose integrated with computed tomography (18F-FDG PET-CT) is a multi-modality medical imaging technique widely used for screening and diagnosis of lesions and tumors, in which, CT can provide detailed anatomical structures, while PET can show metabolic activities. Nevertheless, it has disadvantages such as long scanning time, high cost, and relatively high radiation doses.Purpose. We propose a deep learning model for the whole-body CT-to-PET synthesis task, generating high-quality synthetic PET images that are comparable to real ones in both clinical relevance and diagnostic value.Material. We collect 102 pairs of 3D CT and PET scans, which are sliced into 27 240 pairs of 2D CT and PET images (training: 21,855 pairs, validation: 2810 pairs, testing: 2575 pairs).Methods. We propose a transformer-enhanced generative adversarial network (GAN) for whole-body CT-to-PET synthesis task. The CPGAN model uses residual blocks and fully connected transformer residual blocks to capture both local features and global contextual information. A customized loss function incorporating structural consistency is designed to improve the quality of synthesized PET images.Results. Both quantitative and qualitative evaluation results demonstrate effectiveness of the CPGAN model. The mean and standard variance of NRMSE, PSNR and SSIM values on test set are(16.90±12.27)×10-4,28.71±2.67and0.926±0.033, respectively, outperforming other seven state-of-the-art models. Three radiologists independently and blindly evaluated and gave subjective scores to 100 randomly chosen PET images (50 real and 50 synthetic). By Wilcoxon signed rank test, there are no statistical differences between the synthetic PET images and the real ones.Conclusions. Despite the inherent limitations of CT images to directly reflect biological information of metabolic tissues, CPGAN model effectively synthesizes satisfying PET images from CT scans, which has potential in reducing the reliance on actual PET-CT scans.",
    "abstract_zh": "**翻译：**<br><br>背景：正电子发射断层扫描结合计算机断层扫描（18F-FDG PET-CT）是一种多模态医学影像技术，广泛应用于病灶和肿瘤的筛查和诊断。其中，CT能够提供详细的解剖结构，而PET则可以显示代谢活动。然而，它也存在一些缺点，例如扫描时间长、成本高以及相对较高的辐射剂量。<br><br>目的：我们提出了一种深度学习模型，用于全身CT到PET的合成任务，旨在生成高质量的合成PET图像，使其在临床相关性和诊断价值方面均与真实PET图像相媲美。<br><br>材料：我们收集了102对3D CT和PET扫描图像，将其切片成27240对2D CT和PET图像（训练集：21855对，验证集：2810对，测试集：2575对）。<br><br>方法：我们提出了一种基于Transformer增强的生成对抗网络（GAN），用于全身CT到PET的合成任务。CPGAN模型采用残差块和全连接Transformer残差块，以捕获局部特征和全局上下文信息。设计了一种结合结构一致性的自定义损失函数，以提高合成PET图像的质量。<br><br>结果：定量和定性评估结果均表明CPGAN模型的有效性。在测试集上，NRMSE（归一化均方根误差）、PSNR（峰值信噪比）和SSIM（结构相似性指数）值的均值和标准差分别为(16.90±12.27)×10-4、28.71±2.67和0.926±0.033，优于其他七种最先进的模型。三位放射科医生独立且盲法地评估了随机选择的100张PET图像（50张真实，50张合成），并给出了主观评分。通过Wilcoxon符号秩检验，合成PET图像和真实PET图像之间没有统计学差异。<br><br>结论：尽管CT图像在直接反映代谢组织的生物信息方面存在固有的局限性，但CPGAN模型能够有效地从CT扫描图像中合成令人满意的PET图像，这有潜力减少对实际PET-CT扫描的依赖。",
    "summary_zh": "本研究提出了一种基于Transformer增强的生成对抗网络(CPGAN)模型，用于从CT图像合成高质量的PET图像。该模型能够有效捕获局部特征和全局上下文信息，并通过结构一致性损失函数提升合成图像质量。实验结果表明，CPGAN模型生成的PET图像在定量指标和放射科医生的主观评估上均与真实PET图像相当，具有减少对实际PET-CT扫描依赖的潜力。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/add8dd",
    "link": "https://doi.org/10.1088/1361-6560/add8dd"
  },
  {
    "title": "Generation of synthetic CT from MRI for MRI-based attenuation correction of brain PET images using radiomics and machine learning.",
    "authors": [
      "Amin Hoseinipourasl",
      "Gholam-Ali Hossein-Zadeh",
      "Peyman Sheikhzadeh",
      "Hossein Arabalibeik",
      "Shaghayegh Karimi Alavijeh",
      "Habib Zaidi",
      "Mohammad Reza Ay"
    ],
    "abstract": "BACKGROUND: Accurate quantitative PET imaging in neurological studies requires proper attenuation correction. MRI-guided attenuation correction in PET/MRI remains challenging owing to the lack of direct relationship between MRI intensities and linear attenuation coefficients.\nPURPOSE: This study aims at generating accurate patient-specific synthetic CT volumes, attenuation maps, and attenuation correction factor (ACF) sinograms with continuous values utilizing a combination of machine learning algorithms, image processing techniques, and voxel-based radiomics feature extraction approaches.\nMETHODS: Brain MR images of ten healthy volunteers were acquired using IR-pointwise encoding time reduction with radial acquisition (IR-PETRA) and VIBE-Dixon techniques. synthetic CT (SCT) images, attenuation maps, and attenuation correction factors (ACFs) were generated using the LightGBM, a fast and accurate machine learning algorithm, from the radiomics-based and image processing-based feature maps of MR images. Additionally, ultra-low-dose CT images of the same volunteers were acquired and served as the standard of reference for evaluation. The SCT images, attenuation maps, and ACF sinograms were assessed using qualitative and quantitative evaluation metrics and compared against their corresponding reference images, attenuation maps, and ACF sinograms.\nRESULTS: The voxel-wise and volume-wise comparison between synthetic and reference CT images yielded an average mean absolute error of 60.75 ± 8.8 HUs, an average structural similarity index of 0.88 ± 0.02, and an average peak signal-to-noise ratio of 32.83 ± 2.74 dB. Additionally, we compared MRI-based attenuation maps and ACF sinograms with their CT-based counterparts, revealing average normalized mean absolute errors of 1.48% and 1.33%, respectively.\nCONCLUSION: Quantitative assessments indicated higher correlations and similarities between LightGBM-synthesized CT and Reference CT images. Moreover, the cross-validation results showed the possibility of producing accurate SCT images, MRI-based attenuation maps, and ACF sinograms. This might spur the implementation of MRI-based attenuation correction on PET/MRI and dedicated brain PET scanners with lower computational time using CPU-based processors.",
    "abstract_zh": "**翻译：**<br><br>背景：在神经系统研究中，准确的定量PET成像需要适当的衰减校正。PET/MRI中的MRI引导衰减校正仍然具有挑战性，原因在于MRI强度与线性衰减系数之间缺乏直接关系。<br><br>目的：本研究旨在通过结合机器学习算法、图像处理技术和基于体素的放射组学特征提取方法，生成具有连续值的精确的个体化合成CT图像、衰减图和衰减校正因子(ACF)正弦图。<br><br>方法：使用IR-pointwise编码时间缩短与径向采集(IR-PETRA)和VIBE-Dixon技术采集了十名健康志愿者的脑部MR图像。使用LightGBM（一种快速而准确的机器学习算法），基于MR图像的放射组学和图像处理特征图，生成了合成CT(SCT)图像、衰减图和衰减校正因子(ACF)。此外，还采集了相同志愿者的超低剂量CT图像，作为评估的参考标准。使用定性和定量评估指标评估了SCT图像、衰减图和ACF正弦图，并将其与相应的参考图像、衰减图和ACF正弦图进行了比较。<br><br>结果：合成CT图像和参考CT图像之间的体素和体积比较显示，平均绝对误差为60.75 ± 8.8 HUs，平均结构相似性指数为0.88 ± 0.02，平均峰值信噪比为32.83 ± 2.74 dB。此外，我们将基于MRI的衰减图和ACF正弦图与基于CT的相应结果进行了比较，显示平均归一化平均绝对误差分别为1.48%和1.33%。<br><br>结论：定量评估表明，LightGBM合成的CT图像与参考CT图像之间具有更高的相关性和相似性。此外，交叉验证结果表明了生成精确SCT图像、基于MRI的衰减图和ACF正弦图的可能性。这可能会推动在PET/MRI和专用脑部PET扫描仪上实施基于MRI的衰减校正，并在基于CPU的处理器上以更低的计算时间实现。",
    "summary_zh": "该研究利用LightGBM机器学习算法，结合放射组学和图像处理技术，从MRI图像生成了高质量的合成CT图像、衰减图和衰减校正因子(ACF)正弦图。结果表明，生成的图像与参考CT图像高度相似，误差很小，证明了该方法在PET/MRI中实现MRI引导衰减校正的潜力，并有望降低计算成本。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17867",
    "link": "https://doi.org/10.1002/mp.17867"
  },
  {
    "title": "Impact of tracer uptake rate on quantification accuracy of myocardial blood flow in PET: A simulation study.",
    "authors": [
      "Xiaotong Hong",
      "Amirhossein Sanaat",
      "Yazdan Salimi",
      "René Nkoulou",
      "Hossein Arabi",
      "Lijun Lu",
      "Habib Zaidi"
    ],
    "abstract": "BACKGROUND: Cardiac perfusion PET is commonly used to assess ischemia and cardiovascular risk, which enables quantitative measurements of myocardial blood flow (MBF) through kinetic modeling. However, the estimation of kinetic parameters is challenging due to the noisy nature of short dynamic frames and limited sample data points.\nPURPOSE: This work aimed to investigate the errors in MBF estimation in PET through a simulation study and to evaluate different parameter estimation approaches, including a deep learning (DL) method.\nMATERIALS AND METHODS: Simulated studies were generated using digital phantoms based on cardiac segmentations from 55 clinical CT images. We employed the irreversible 2-tissue compartmental model and simulated dynamic 13N-ammonia PET scans under both rest and stress conditions (220 cases each). The simulations covered a rest K1 range of 0.6 to 1.2 and a stress K1 range of 1.2 to 3.6 (unit: mL/min/g) in the myocardium. A transformer-based DL model was trained on the simulated dataset to predict parametric images (PIMs) from noisy PET image frames and was validated using 5-fold cross-validation. We compared the DL method with the voxel-wise nonlinear least squares (NLS) fitting applied to the dynamic images, using either Gaussian filter (GF) smoothing (GF-NLS) or a dynamic nonlocal means (DNLM) algorithm for denoising (DNLM-NLS). Two patients with coronary CT angiography (CTA) and fractional flow reserve (FFR) were enrolled to test the feasibility of applying DL models on clinical PET data.\nRESULTS: The DL method showed clearer image structures with reduced noise compared to the traditional NLS-based methods. In terms of mean absolute relative error (MARE), as the rest K1 values increased from 0.6 to 1.2 mL/min/g, the overall bias in myocardium K1 estimates decreased from approximately 58% to 45% for the NLS-based methods while the DL method showed a reduction in MARE from 42% to 18%. For stress data, as the stress K1 decreased from 3.6 to 1.2 mL/min/g, the MARE increased from 30% to 70% for the GF-NLS method. In contrast, both the DNLM-NLS (average: 42%) and the DL methods (average: 20%) demonstrated significantly smaller MARE changes as stress K1 varied. Regarding the regional mean bias (±standard deviation), the GF-NLS method had a bias of 6.30% (±8.35%) of rest K1, compared to 1.10% (±8.21%) for DNLM-NLS and 6.28% (±14.05%) for the DL method. For the stress K1, the GF-NLS showed a mean bias of 10.72% (±9.34%) compared to 1.69% (±8.82%) for DNLM-NLS and -10.55% (±9.81%) for the DL method.\nSIGNIFICANCE: This study showed that an increase in the tracer uptake rate (K1) corresponded to improved accuracy and precision in MBF quantification, whereas lower tracer uptake resulted in higher noise in dynamic PET and poorer parameter estimates. Utilizing denoising techniques or DL approaches can mitigate noise-induced bias in PET parametric imaging.",
    "abstract_zh": "背景：心脏灌注PET常用于评估缺血和心血管风险，它可以通过动力学建模对心肌血流量（MBF）进行定量测量。然而，由于短时动态帧的噪声特性以及有限的样本数据点，动力学参数的估计具有挑战性。<br><br>目的：本研究旨在通过模拟研究调查PET中MBF估计的误差，并评估不同的参数估计方法，包括一种深度学习（DL）方法。<br><br>材料与方法：基于55例临床CT图像的心脏分割，利用数字体模生成模拟研究数据。我们采用了不可逆的二室模型，并模拟了静息和负荷两种状态下的动态<sup>13</sup>N-氨PET扫描（每种状态各220例）。模拟覆盖了心肌中0.6至1.2的静息K1范围和1.2至3.6的负荷K1范围（单位：mL/min/g）。在模拟数据集上训练了一个基于Transformer的深度学习模型，以从嘈杂的PET图像帧中预测参数图像（PIM），并使用5折交叉验证进行验证。我们将深度学习方法与应用于动态图像的体素级非线性最小二乘（NLS）拟合进行比较，非线性最小二乘拟合使用高斯滤波（GF）平滑（GF-NLS）或动态非局部均值（DNLM）算法进行去噪（DNLM-NLS）。纳入了两名接受冠状动脉CT血管造影（CTA）和血流储备分数（FFR）检查的患者，以测试将深度学习模型应用于临床PET数据的可行性。<br><br>结果：与传统的基于NLS的方法相比，深度学习方法显示出更清晰的图像结构，并降低了噪声。在平均绝对相对误差（MARE）方面，随着静息K1值从0.6增加到1.2 mL/min/g，基于NLS的方法在心肌K1估计中的总体偏差从大约58%降至45%，而深度学习方法的MARE从42%降至18%。对于负荷数据，随着负荷K1从3.6降至1.2 mL/min/g，GF-NLS方法的MARE从30%增加到70%。相比之下，DNLM-NLS（平均值：42%）和深度学习方法（平均值：20%）都显示出较小的MARE变化，不受负荷K1变化的影响。关于区域平均偏差（±标准差），GF-NLS方法的静息K1偏差为6.30%（±8.35%），而DNLM-NLS为1.10%（±8.21%），深度学习方法为6.28%（±14.05%）。对于负荷K1，GF-NLS的平均偏差为10.72%（±9.34%），而DNLM-NLS为1.69%（±8.82%），深度学习方法为-10.55%（±9.81%）。<br><br>意义：本研究表明，示踪剂摄取率（K1）的增加对应于MBF量化的准确性和精度的提高，而较低的示踪剂摄取导致动态PET中的较高噪声和较差的参数估计。利用去噪技术或深度学习方法可以减轻PET参数成像中噪声引起的偏差。",
    "summary_zh": "本研究通过模拟和初步临床实验，比较了深度学习方法（DL）与传统非线性最小二乘法（NLS）在PET心肌血流量（MBF）定量分析中的性能。结果表明，DL方法在降低噪声、提高参数估计准确性和稳定性方面优于传统方法，尤其是在低示踪剂摄取率情况下。因此，DL方法有潜力改善PET心肌灌注成像的质量和诊断准确性。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17871",
    "link": "https://doi.org/10.1002/mp.17871"
  },
  {
    "title": "Exploiting network optimization stability for enhanced PET image denoising using deep image prior.",
    "authors": [
      "Fumio Hashimoto",
      "Kibo Ote",
      "Yuya Onishi",
      "Hideaki Tashima",
      "Go Akamatsu",
      "Yuma Iwao",
      "Miwako Takahashi",
      "Taiga Yamaya"
    ],
    "abstract": "Objective. Positron emission tomography (PET) is affected by statistical noise due to constraints on tracer dose and scan duration, impacting both diagnostic performance and quantitative accuracy. While deep learning-based PET denoising methods have been used to improve image quality, they may introduce over-smoothing, which can obscure critical structural details and compromise quantitative accuracy. We propose a method for making a deep learning solution more reliable and apply it to the conditional deep image prior (DIP).Approach. We introduce the idea ofstability informationin the optimization process of conditional DIP, enabling the identification of unstable regions within the network's optimization trajectory. Our method incorporates a stability map, which is derived from multiple intermediate outputs of a moderate neural network at different optimization steps. The final denoised PET image is then obtained by computing a linear combination of the DIP output and the original reconstructed PET image, weighted by the stability map.Main results. We employed eight high-resolution brain PET datasets for comparison. Our method effectively reduces background noise while preserving small structure details in brain [18F]FDG PET images. Comparative analysis demonstrated that our approach outperformed existing methods in terms of peak-to-valley ratio and background noise suppression across various low-dose levels. Additionally, region-of-interest analysis confirmed that the proposed method maintains quantitative accuracy without introducing under- or over-estimation. Furthermore, we applied our method to full-dose PET data to assess its impact on image quality. The results revealed that the proposed method significantly reduced background noise while preserving the peak-to-valley ratio at a level comparable to that of unfiltered full-dose PET images.Significance. The proposed method introduces a robust approach to deep learning-based PET denoising, enhancing its reliability and preserving quantitative accuracy. Furthermore, this strategy can potentially advance performance in high-sensitivity PET scanners and surpass the limit of image quality inherent to PET scanners.",
    "abstract_zh": "**翻译：**<br><br>**目的。** 正电子发射断层扫描（PET）受限于示踪剂剂量和扫描时长，因此会受到统计噪声的影响，进而影响诊断性能和定量准确性。虽然基于深度学习的PET去噪方法已被用于改善图像质量，但它们可能引入过度平滑，从而掩盖关键的结构细节并损害定量准确性。我们提出了一种使深度学习解决方案更加可靠的方法，并将其应用于条件深度图像先验（DIP）。<br><br>**方法。** 我们在条件DIP的优化过程中引入了**稳定性信息**的概念，从而能够识别网络优化轨迹中的不稳定区域。我们的方法包含一个稳定性图，该图是从一个中等规模神经网络在不同优化步骤中的多个中间输出中导出的。然后，通过计算DIP输出和原始重建PET图像的线性组合，并使用稳定性图进行加权，得到最终的去噪PET图像。<br><br>**主要结果。** 我们采用了八个高分辨率脑PET数据集进行比较。我们的方法有效地降低了背景噪声，同时保留了脑部[18F]FDG PET图像中的小结构细节。对比分析表明，在各种低剂量水平下，我们的方法在峰谷比和背景噪声抑制方面均优于现有方法。此外，感兴趣区分析证实，所提出的方法在保持定量准确性的同时，不会引入低估或高估。此外，我们将我们的方法应用于全剂量PET数据，以评估其对图像质量的影响。结果表明，所提出的方法显著降低了背景噪声，同时将峰谷比保持在与未滤波的全剂量PET图像相当的水平。<br><br>**意义。** 所提出的方法为基于深度学习的PET去噪引入了一种鲁棒的方法，提高了其可靠性并保持了定量准确性。此外，该策略有可能提高高灵敏度PET扫描仪的性能，并超越PET扫描仪固有的图像质量限制。",
    "summary_zh": "本研究针对PET图像去噪中深度学习方法可能导致的过度平滑问题，提出了一种基于稳定性信息的条件深度图像先验（DIP）改进方法。该方法通过在DIP优化过程中引入稳定性图，从而识别并处理优化过程中的不稳定区域，实现了在降低背景噪声的同时，保留关键结构细节和定量准确性的目标。实验结果表明，该方法在低剂量和全剂量PET图像中均表现出优于现有方法的去噪效果，并具有提升高灵敏度PET扫描仪性能的潜力。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/add63f",
    "link": "https://doi.org/10.1088/1361-6560/add63f"
  },
  {
    "title": "Patient CT-based simulation study of secondary-electron-bremsstrahlung imaging for range verification in proton therapy: comparison with prompt gamma and PET imaging for simplified proton pencil beam and SOBP irradiation scenarios.",
    "authors": [
      "Takuya Yabe",
      "Munetaka Nitta",
      "Mitsutaka Yamaguchi",
      "Marco Pinto",
      "Naoki Kawachi",
      "Katia Parodi"
    ],
    "abstract": "Objective.Secondary electron bremsstrahlung (SEB) imaging, along with prompt gamma (PG) and positron emission tomography (PET) imaging, has been proposed as anin vivorange verification tool for proton therapy. This study presents the first simulation based on patient computed tomography (CT) data to investigate the feasibility of SEB imaging for range verification in proton therapy, while comparing the characteristics of SEB imaging with those of PG and PET imaging.Approach.A Monte Carlo simulation was performed using patient CT data for the irradiation of monoenergetic pencil beams and spread-out Bragg peak proton beams. The physical characteristics of SEB imaging were analyzed at three different anatomical sites and compared with those of PG and PET imaging.Main results. In all the treatment cases, SEB imaging exhibited higher production rates than PG and PET imaging, particularly in the regions with high CT values along the beam path. Although the SEB signal was more affected by scattering and absorption than the PET or PG signals, sufficient statistical counts for range verification (∼3 × 10-3SEBs/proton) could potentially be detected outside the patient geometry. For pencil beam cases, the SEB and PET fall-offs were located 4-5 mm proximal to the dose fall-off, while the PG fall-off was located 0-1 mm distal to it.Significance.Results suggest that SEB imaging has the potential to offer a real-time range verification tool (by comparing measured and expected images), particularly for treating shallow-seated tumors using proton pencil-beam scanning delivery. Thus, this study represents a significant step towards the clinical application of range verification based on SEB imaging and promotes future efforts in this direction.",
    "abstract_zh": "**翻译：**<br><br>**目的：** 二次电子轫致辐射 (SEB) 成像与瞬发伽马 (PG) 成像和正电子发射断层扫描 (PET) 成像一起，已被提议作为质子治疗中体内射程验证的工具。本研究首次基于患者计算机断层扫描 (CT) 数据进行模拟，旨在研究 SEB 成像在质子治疗中进行射程验证的可行性，并比较 SEB 成像与 PG 和 PET 成像的特性。<br><br>**方法：** 使用患者 CT 数据，对单能笔形束和扩展 Bragg 峰质子束的照射进行了蒙特卡罗模拟。在三个不同的解剖部位分析了 SEB 成像的物理特性，并将其与 PG 和 PET 成像的物理特性进行了比较。<br><br>**主要结果：** 在所有治疗案例中，SEB 成像显示出比 PG 和 PET 成像更高的产生率，尤其是在沿光束路径具有高 CT 值的区域。虽然 SEB 信号比 PET 或 PG 信号更容易受到散射和吸收的影响，但仍有可能在患者几何体外部检测到用于射程验证的足够统计计数（~3 × 10-3 SEBs/质子）。对于笔形束案例，SEB 和 PET 的信号衰减位于剂量衰减近端 4-5 毫米处，而 PG 的信号衰减位于剂量衰减远端 0-1 毫米处。<br><br>**重要性：** 结果表明，SEB 成像有可能提供一种实时射程验证工具（通过比较测量图像和预期图像），特别适用于使用质子笔形束扫描进行浅表肿瘤的治疗。因此，本研究代表着朝着基于 SEB 成像的射程验证临床应用迈出的重要一步，并促进了未来在该方向上的努力。",
    "summary_zh": "本研究通过模拟分析了二次电子轫致辐射(SEB)成像在质子治疗射程验证中的可行性，并将其与瞬发伽马(PG)和正电子发射断层扫描(PET)成像进行了比较。研究发现SEB成像具有更高的产率，且能够提供足够统计计数用于射程验证。虽然易受散射和吸收影响，但SEB成像在笔形束案例中，信号衰减位置与剂量衰减位置接近，具有潜力作为实时射程验证工具，尤其适用于浅表肿瘤的质子笔形束扫描治疗。该研究为SEB成像的临床应用奠定了基础。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/add4b7",
    "link": "https://doi.org/10.1088/1361-6560/add4b7"
  },
  {
    "title": "Instantaneous in vivo distal edge verification in intensity-modulated proton therapy by means of PET imaging.",
    "authors": [
      "Brian Zapien-Campos",
      "Zahra Ahmadi Ganjeh",
      "Giuliano Perotti-Bernardini",
      "Jeffrey Free",
      "Stefan Both",
      "Peter Dendooven"
    ],
    "abstract": "BACKGROUND: Intensity-modulated proton therapy (IMPT) holds promise for improving outcomes in head-and-neck cancer (HNC) patients by enhancing organ-at-risk (OAR) sparing. A key challenge in IMPT is ensuring an accurate dose delivery at the distal edge of the tumor, where the steep dose gradients make treatment precision highly sensitive to uncertainties in both proton range and patient setup. Thus, IMPT conformality is increased by incorporating robust margins in the treatment optimization. However, an increment in the plan robustness could lead to an OAR overdosing. Therefore, an accurate distal edge verification during dose delivery is crucial to increase IMPT conformality by reducing optimization settings in treatment planning.\nPURPOSE: This work aims to evaluate, in a quasi-clinical setting, a novel approach for accurate instantaneous proton beam distal edge verification in IMPT by means of spot-by-spot positron emission tomography (PET) imaging.\nMETHODS: An anthropomorphic head and neck phantom CIRS-731 HN was irradiated at the head and neck region. The targets were defined as 4 cm diameter spheres. A 60-ms delay was introduced between the proton beam spots in order to enable the spot-by-spot coincidence detection of the 511-keV photons resulting from positron annihilation following the positron emission from very short-lived positron-emitting, mainly 12N (T1/2  = 11.0 ms). Additionally, modified irradiations were carried out using solid water slabs of 2 and 5 mm thickness in the beam path to assess the precision of the approach for detecting range deviations. The positron activity range (PAR) was determined from the 50% distal fall-off position of the 1D longitudinal positron activity profile derived from the 2D image reconstructions. Furthermore, Monte Carlo (MC) simulations were performed using an in-house RayStation/GATE MC framework to predict the positron activity images and verify the PAR measurements.\nRESULTS: PAR measurements achieved a precision between 1.5 and 3.6 mm (at 1.5σ clinical level) at the beam spot level within sub-second time scales. Measured PAR shifts of 1.6-2.1  and 4.2--.7 mm were observed with the 2- and 5-mm thickness range shifters, respectively, aligning with the corresponding proton dose range (PDR) shifts of 1.3-1.8 and 3.9-4.3 mm. The simulated PAR agrees with the measured PARs, showing an average range difference of ∼0.4 mm.\nCONCLUSION: This study demonstrated the feasibility of instantaneous distal edge verification using PET imaging by introducing beam spot delays during dose delivery. The findings represent a first step toward the clinical implementation of instantaneous in vivo distal edge verification. The approach contributes to the development of real-time range verification aimed at improving IMPT treatments by mitigating range and setup uncertainties, thereby reducing dose to organs-at-risk and ultimately enhancing patient outcomes.",
    "abstract_zh": "**翻译：**<br><br>**背景：** 调强质子治疗 (IMPT) 有望通过增强危及器官 (OAR) 的保护来改善头颈部癌症 (HNC) 患者的治疗效果。IMPT 的一个关键挑战是确保在肿瘤远端边缘实现精确的剂量递送，因为在肿瘤远端边缘，陡峭的剂量梯度使治疗精度对质子射程和患者摆位的不确定性高度敏感。因此，IMPT 的适形性通过在治疗优化中纳入稳健性边界来提高。然而，计划稳健性的增加可能导致 OAR 过量照射。因此，在剂量递送过程中进行精确的远端边缘验证对于通过减少治疗计划中的优化设置来提高 IMPT 的适形性至关重要。<br><br>**目的：** 本研究旨在在准临床环境中评估一种新型方法，该方法通过逐点正电子发射断层扫描 (PET) 成像，实现对 IMPT 中质子束远端边缘的精确瞬时验证。<br><br>**方法：** 在头颈部区域照射了一个人体头部和颈部模型 CIRS-731 HN。目标被定义为直径为 4 厘米的球体。在质子束点之间引入 60 毫秒的延迟，以便能够对来自极短寿命正电子发射核（主要是 12N (T1/2 = 11.0 毫秒)）的正电子湮灭产生的 511 keV 光子进行逐点符合检测。此外，使用 2 毫米和 5 毫米厚的固体水板对光束路径进行修改后的照射，以评估该方法检测射程偏差的精度。正电子活度范围 (PAR) 是根据从二维图像重建获得的纵向正电子活度分布图的 50% 远端衰减位置确定的。此外，使用内部 RayStation/GATE MC 框架进行蒙特卡罗 (MC) 模拟，以预测正电子活度图像并验证 PAR 测量结果。<br><br>**结果：** PAR 测量在亚秒级时间尺度内，在光束点水平上实现了 1.5 至 3.6 毫米（在 1.5σ 临床水平上）的精度。在使用 2 毫米和 5 毫米厚度的射程改变器时，分别观察到 1.6-2.1 毫米和 4.2-4.7 毫米的测量 PAR 偏移，与相应的 1.3-1.8 毫米和 3.9-4.3 毫米的质子剂量范围 (PDR) 偏移一致。模拟的 PAR 与测量的 PAR 一致，显示出约 0.4 毫米的平均范围差异。<br><br>**结论：** 本研究证明了通过在剂量递送过程中引入光束点延迟，使用 PET 成像进行瞬时远端边缘验证的可行性。这些发现代表了朝着瞬时体内远端边缘验证临床实施的第一步。该方法有助于开发实时射程验证，旨在通过减轻射程和摆位不确定性来改善 IMPT 治疗，从而减少危及器官的剂量，并最终改善患者的治疗效果。",
    "summary_zh": "该研究提出了一种利用逐点PET成像技术进行调强质子治疗(IMPT)中质子束远端边缘瞬时验证的新方法。通过准临床实验和蒙特卡罗模拟，验证了该方法在亚秒级时间尺度内具有毫米级的精度，能够有效检测射程偏差。该技术有望用于IMPT的实时射程验证，降低危及器官的剂量，改善患者的治疗效果。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17850",
    "link": "https://doi.org/10.1002/mp.17850"
  },
  {
    "title": "Modeling inter-reader variability in clinical target volume delineation for soft tissue sarcomas using diffusion model.",
    "authors": [
      "Yafei Dong",
      "Thibault Marin",
      "Yue Zhuo",
      "Elie Najem",
      "Arnaud Beddok",
      "Laura Rozenblum",
      "Maryam Moteabbed",
      "Kira Grogg",
      "Fangxu Xing",
      "Jonghye Woo",
      "Yen-Lin E Chen",
      "Ruth Lim",
      "Xiaofeng Liu",
      "Chao Ma",
      "Georges El Fakhri"
    ],
    "abstract": "BACKGROUND: Accurate delineation of the clinical target volume (CTV) is essential in the radiotherapy treatment of soft tissue sarcomas. However, this process is subject to inter-reader variability due to the need for clinical assessment of risk and extent of potential microscopic spread. This can lead to inconsistencies in treatment planning, potentially impacting treatment outcomes. Most existing automatic CTV delineation methods do not account for this variability and can only generate a single CTV for each case.\nPURPOSE: This study aims to develop a deep learning-based technique to generate multiple CTV contours for each case, simulating the inter-reader variability in the clinical practice.\nMETHODS: We employed a publicly available dataset consisting of fluorodeoxyglucose positron emission tomography (FDG-PET), x-ray computed tomography (CT), and pre-contrast T1-weighted magnetic resonance imaging (MRI) scans from 51 patients with soft tissue sarcoma, along with an independent validation set containing five additional patients. An experienced reader drew a contour of the gross tumor volume (GTV) for each patient based on multi-modality images. Subsequently, two additional readers, together with the first one, were responsible for contouring three CTVs in total based on the GTV. We developed a diffusion model-based deep learning method that is capable of generating arbitrary number of different and plausible CTVs to mimic the inter-reader variability in CTV delineation. The proposed model incorporates a separate encoder to extract features from the GTV masks, leveraging the critical role of GTV information in accurate CTV delineation.\nRESULTS: The proposed diffusion model demonstrated superior performance with the highest Dice Index (0.902 compared to values below 0.881 for state-of-the-art models) and the best generalized energy distance (GED) (0.209 compared to values exceeding 0.221 for state-of-the-art models). It also achieved the second-highest recall and precision metrics among the compared ambiguous image segmentation models. Results from both datasets exhibited consistent trends, reinforcing the reliability of our findings. Additionally, ablation studies exploring different model structures and input configurations highlighted the significance of incorporating prior GTV information for accurate CTV delineation.\nCONCLUSIONS: The proposed diffusion model successfully generates multiple plausible CTV contours for soft tissue sarcomas, effectively capturing inter-reader variability in CTV delineation.",
    "abstract_zh": "**翻译：**<br><br>背景：在软组织肉瘤的放射治疗中，准确勾画临床靶区（CTV）至关重要。然而，由于需要对潜在的微观扩散的风险和程度进行临床评估，这一过程容易受到阅片者间差异的影响。这可能导致治疗计划的不一致，从而潜在地影响治疗效果。大多数现有的自动CTV勾画方法没有考虑到这种差异性，只能为每个病例生成单个CTV。<br><br>目的：本研究旨在开发一种基于深度学习的技术，为每个病例生成多个CTV轮廓，从而模拟临床实践中阅片者间的差异。<br><br>方法：我们采用了公开数据集，该数据集包含来自51名软组织肉瘤患者的氟代脱氧葡萄糖正电子发射断层扫描（FDG-PET）、X射线计算机断层扫描（CT）和预对比T1加权磁共振成像（MRI）扫描，以及包含另外5名患者的独立验证集。一位经验丰富的阅片者基于多模态图像为每位患者勾画了肿瘤大体体积（GTV）的轮廓。随后，另外两位阅片者与第一位阅片者一起负责基于GTV勾画总共三个CTV。我们开发了一种基于扩散模型的深度学习方法，该方法能够生成任意数量的不同且合理的CTV，以模拟CTV勾画中阅片者间的差异。该模型包含一个单独的编码器，用于从GTV掩模中提取特征，从而利用GTV信息在准确的CTV勾画中的关键作用。<br><br>结果：所提出的扩散模型表现出卓越的性能，具有最高的Dice系数（0.902，而最先进模型的该值低于0.881）和最佳的广义能量距离（GED）（0.209，而最先进模型的该值超过0.221）。在所比较的模糊图像分割模型中，它还获得了第二高的召回率和精确率指标。来自两个数据集的结果均表现出一致的趋势，从而加强了我们发现的可靠性。此外，探索不同模型结构和输入配置的消融研究突出了纳入先验GTV信息对于准确CTV勾画的重要性。<br><br>结论：所提出的扩散模型成功地为软组织肉瘤生成了多个合理的CTV轮廓，有效地捕捉了CTV勾画中的阅片者间差异。",
    "summary_zh": "该研究开发了一种基于扩散模型的深度学习方法，用于生成多个临床靶区(CTV)轮廓，以模拟软组织肉瘤放射治疗中阅片者间CTV勾画的差异性。实验结果表明，该模型在Dice系数和广义能量距离等指标上优于现有模型，能够有效捕捉阅片者间的差异，且纳入肿瘤大体体积(GTV)信息对于准确的CTV勾画至关重要。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17865",
    "link": "https://doi.org/10.1002/mp.17865"
  },
  {
    "title": "Thorax-encompassing multi-modality PET/CT deep learning model for resected lung cancer prognostication: A retrospective, multicenter study.",
    "authors": [
      "Jaryd R Christie",
      "Perrin Romine",
      "Karen Eddy",
      "Delphine L Chen",
      "Omar Daher",
      "Mohamed Abdelrazek",
      "Richard A Malthaner",
      "Mehdi Qiabi",
      "Rahul Nayak",
      "Paul Kinahan",
      "Viswam S Nair",
      "Sarah A Mattonen"
    ],
    "abstract": "BACKGROUND: Patients with early-stage non-small cell lung cancer (NSCLC) typically receive surgery as their primary form of treatment. However, studies have shown that a high proportion of these patients will experience a recurrence after their resection, leading to an increased risk of death. Cancer staging is currently the gold standard for establishing a patient's prognosis and can help clinicians determine patients who may benefit from additional therapy. However, medical images which are used to help determine the cancer stage, have been shown to hold unutilized prognostic information that can augment clinical data and better identify high-risk NSCLC patients. There remains an unmet need for models to incorporate clinical, pathological, surgical, and imaging information, and extend beyond the current staging system to assist clinicians in identifying patients who could benefit from additional therapy immediately after surgery.\nPURPOSE: We aimed to determine whether a deep learning model (DLM) integrating FDG PET and CT imaging from the thoracic cavity along with clinical, surgical, and pathological information can predict NSCLC recurrence-free survival (RFS) and stratify patients into risk groups better than conventional staging.\nMATERIALS AND METHODS: Surgically resected NSCLC patients enrolled between 2009 and 2018 were retrospectively analyzed from two academic institutions (local institution: 305 patients; external validation: 195 patients). The thoracic cavity (including the lungs, mediastinum, pleural interfaces, and thoracic vertebrae) was delineated on the preoperative FDG PET and CT images and combined with each patient's clinical, surgical, and pathological information. Using the local cohort of patients, a multi-modal DLM using these features was built in a training cohort (n = 225), tuned on a validation cohort (n = 45), and evaluated on testing (n = 35) and external validation (n = 195) cohorts to predict RFS and stratify patients into risk groups. The area under the curve (AUC), Kaplan-Meier curves, and log-rank test were used to assess the prognostic value of the model. The DLM's stratification performance was compared to the conventional staging stratification.\nRESULTS: The multi-modal DLM incorporating imaging, pathological, surgical, and clinical data predicted RFS in the testing cohort (AUC = 0.78 [95% CI:0.63-0.94]) and external validation cohort (AUC = 0.66 [95% CI:0.58-0.73]). The DLM significantly stratified patients into high, medium, and low-risk groups of RFS in both the testing and external validation cohorts (multivariable log-rank p < 0.001) and outperformed conventional staging. Conventional staging was unable to stratify patients into three distinct risk groups of RFS (testing: p = 0.94; external validation: p = 0.38). Lastly, the DLM displayed the ability to further stratify patients significantly into sub-risk groups within each stage in the testing (stage I: p = 0.02, stage II: p = 0.03) and external validation (stage I: p = 0.05, stage II: p = 0.03) cohorts.\nCONCLUSION: This is the first study to use multi-modality imaging along with clinical, surgical, and pathological data to predict RFS of NSCLC patients after surgery. The multi-modal DLM better stratified patients into risk groups of poor outcomes when compared to conventional staging and further stratified patients within each staging classification. This model has the potential to assist clinicians in better identifying patients that may benefit from additional therapy.",
    "abstract_zh": "**翻译：**<br><br>背景：早期非小细胞肺癌（NSCLC）患者通常接受手术作为主要治疗手段。然而，研究表明，这些患者中很大一部分在切除术后会发生复发，从而增加死亡风险。癌症分期是目前确定患者预后的金标准，可以帮助临床医生确定可能从额外治疗中获益的患者。然而，用于帮助确定癌症分期的医学影像已显示出未被充分利用的预后信息，这些信息可以增强临床数据，从而更好地识别高危NSCLC患者。目前仍然迫切需要一种模型，该模型能够整合临床、病理、手术和影像信息，并超越现有分期系统，以协助临床医生识别术后立即可能从额外治疗中获益的患者。<br><br>目的：我们的目的是确定一个深度学习模型（DLM），该模型整合了胸腔的FDG PET和CT影像，以及临床、手术和病理信息，是否能够比传统分期更好地预测NSCLC的无复发生存期（RFS）并将患者划分为不同的风险组。<br><br>材料与方法：对2009年至2018年间在两家学术机构（本地机构：305名患者；外部验证：195名患者）入组的接受手术切除的NSCLC患者进行了回顾性分析。在术前FDG PET和CT影像上勾勒出胸腔（包括肺、纵隔、胸膜界面和胸椎），并结合每位患者的临床、手术和病理信息。利用本地患者队列，在训练队列（n=225）中构建了一个使用这些特征的多模态DLM，在验证队列（n=45）中进行了调整，并在测试（n=35）和外部验证（n=195）队列中进行了评估，以预测RFS并将患者划分为风险组。使用曲线下面积（AUC）、Kaplan-Meier曲线和Log-rank检验评估了该模型的预后价值。将DLM的分层性能与传统分期的分层性能进行了比较。<br><br>结果：多模态DLM整合了影像、病理、手术和临床数据，预测了测试队列（AUC=0.78 [95% CI:0.63-0.94]）和外部验证队列（AUC=0.66 [95% CI:0.58-0.73]）中的RFS。DLM显著地将测试和外部验证队列中的患者划分为RFS的高、中、低风险组（多变量Log-rank p<0.001），并且优于传统分期。传统分期无法将患者划分为RFS的三个不同的风险组（测试：p=0.94；外部验证：p=0.38）。最后，DLM显示出在测试（I期：p=0.02，II期：p=0.03）和外部验证（I期：p=0.05，II期：p=0.03）队列中，能够进一步显著地将每个分期中的患者划分为亚风险组。<br><br>结论：这是第一项使用多模态影像以及临床、手术和病理数据来预测NSCLC患者术后RFS的研究。与传统分期相比，多模态DLM更好地将患者划分为不良预后风险组，并进一步对每个分期分类中的患者进行分层。该模型有潜力帮助临床医生更好地识别可能从额外治疗中获益的患者。",
    "summary_zh": "该研究旨在开发并验证一个基于深度学习的多模态模型，用于预测早期NSCLC患者术后的无复发生存期(RFS)。该模型整合了FDG PET/CT影像、临床、手术和病理信息，结果表明，该模型在RFS预测和风险分层方面优于传统分期方法，能够将患者划分为更精细的风险亚组，并有望辅助临床医生识别术后需要额外治疗的患者。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17862",
    "link": "https://doi.org/10.1002/mp.17862"
  },
  {
    "title": "Evaluation of a motion correction algorithm in lung cancer PET/CT: Phantom validation and patient studies.",
    "authors": [
      "Ziyang Wang",
      "Jianjing Liu",
      "Di Lu",
      "Guoqing Sui",
      "Yaya Wang",
      "Lina Tong",
      "Xueyao Liu",
      "Yan Zhang",
      "Jie Fu",
      "Wengui Xu",
      "Dong Dai"
    ],
    "abstract": "BACKGROUND: Data-driven gating (DDG) is an emerging technology that can reduce the respiratory motion artifacts in positron emission tomography (PET) images.\nPURPOSE: The aim of this study is to use phantom and patient data to validate the performance of DDG with a motion correction algorithm based on the reconstruct, register, and average (RRA) method.\nMETHODS: A customized motion platform drove the phantom (five spheres with diameters of 10-28 mm) using a periodic motion that had a duration of 3-5 s and amplitudes of 2-4 cm. Normalized ratio of ungated and RRA PET relative to the ground-truth static PET was calculated for RSUVmax, RSUVmean, RSUVpeak, RVolume, and relative contrast-to-noise ratio (RCNR). Additionally, 30 lung cancer patients with 76 lung lesions less than 3 cm in diameter were prospectively studied. The overall image quality of patient examination was scored using a 5-point scale by two radiologists. SUVmax, SUVmean, SUVpeak, volume, and CNR of lesions measured in ungated and RRA PET were compared, and subgroup analysis was conducted.\nRESULTS: In RRA PET images, motion artifacts of the spheres in the phantom were effectively mitigated, regardless of changes in movement amplitudes or duration. For all spheres with different ranges of motion and cycles, RSUVmax, RSUVmean, RSUVpeak, and RCNR increased significantly (p ≤ 0.001) and RVolume decreased significantly (p < 0.001) in RRA PET images. The average radiologist scores of image quality were 3.90 ± 0.86 with RRA PET, and 3.03 ± 1.19 with ungated PET. In RRA PET images, the SUVmax (p < 0.001), SUVmean (p < 0.001), SUVpeak (p < 0.001), and CNR (p < 0.001) of the lesions increased, while the volume (p < 0.001) of the lesions decreased. Δ%SUVmax, Δ%SUVmean, Δ%SUVpeak, and Δ%CNR of the lesions increased by 3.9%, 6.5%, 5.6%, and 4.3%, respectively, while Δ%Volume of the lesions decreased by 18.4%. Subgroup analysis showed that in lesions in the upper and middle lobes, only SUVpeak (p < 0.001) significantly increased by 5.6% in RRA PET, while their volume (p < 0.001) notably decreased by 12.4% (p < 0.001).\nCONCLUSION: DDG integrated with RRA motion correction algorithm can effectively mitigate motion artifacts, thus enhancing the quantification accuracy and visual quality of images in lung cancer PET/CT.",
    "abstract_zh": "**翻译：**<br><br>**背景：** 数据驱动门控(DDG)是一项新兴技术，可以减少正电子发射断层扫描(PET)图像中的呼吸运动伪影。<br><br>**目的：** 本研究旨在利用体模和患者数据，验证DDG与基于重建、配准和平均(RRA)方法的运动校正算法的性能。<br><br>**方法：** 定制的运动平台驱动体模（五个直径为10-28毫米的球体），采用周期性运动，运动持续时间为3-5秒，幅度为2-4厘米。计算未门控和RRA PET相对于真实静态PET的归一化比率，用于RSUVmax、RSUVmean、RSUVpeak、RVolume和相对对比噪声比(RCNR)。此外，前瞻性地研究了30名患有76个直径小于3厘米肺部病灶的肺癌患者。两位放射科医生使用5分制量表对患者检查的总体图像质量进行评分。比较了未门控和RRA PET中病灶的SUVmax、SUVmean、SUVpeak、体积和CNR，并进行了亚组分析。<br><br>**结果：** 在RRA PET图像中，体模中球体的运动伪影得到了有效缓解，不受运动幅度或持续时间变化的影响。对于所有具有不同运动范围和周期的球体，RRA PET图像中RSUVmax、RSUVmean、RSUVpeak和RCNR显著增加（p ≤ 0.001），RVolume显著减少（p < 0.001）。使用RRA PET时，放射科医生对图像质量的平均评分是3.90 ± 0.86，而使用未门控PET时是3.03 ± 1.19。在RRA PET图像中，病灶的SUVmax（p < 0.001）、SUVmean（p < 0.001）、SUVpeak（p < 0.001）和CNR（p < 0.001）增加，而病灶的体积（p < 0.001）减小。病灶的Δ%SUVmax、Δ%SUVmean、Δ%SUVpeak和Δ%CNR分别增加了3.9%、6.5%、5.6%和4.3%，而病灶的Δ%体积减少了18.4%。亚组分析显示，在上叶和中叶的病灶中，只有SUVpeak（p < 0.001）在RRA PET中显著增加了5.6%，而它们的体积（p < 0.001）显著减少了12.4%（p < 0.001）。<br><br>**结论：** DDG与RRA运动校正算法相结合，可以有效减轻运动伪影，从而提高肺癌PET/CT图像的量化准确性和视觉质量。",
    "summary_zh": "本研究评估了数据驱动门控（DDG）结合重建、配准和平均（RRA）运动校正算法在肺癌PET/CT成像中的性能。结果表明，该方法能够有效减少运动伪影，显著提高SUVmax、SUVmean、SUVpeak和CNR等量化指标，减小病灶体积，并提升图像视觉质量。研究结果支持了DDG与RRA联合使用能够改善肺癌PET/CT图像质量和诊断准确性。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17846",
    "link": "https://doi.org/10.1002/mp.17846"
  },
  {
    "title": "Hepatocellular carcinoma 18F-FDG PET/CT kinetic parameter estimation based on the advantage actor-critic algorithm.",
    "authors": [
      "Jianfeng He",
      "Siming Li",
      "Yiwei Xiong",
      "Yu Yao",
      "Siyu Wang",
      "Sidan Wang",
      "Shaobo Wang"
    ],
    "abstract": "BACKGROUND: Kinetic parameters estimated with dynamic 18F-fluorodeoxyglucose (18F-FDG) positron emission tomography (PET)/computed tomography (CT) help characterize hepatocellular carcinoma (HCC), and deep reinforcement learning (DRL) can improve kinetic parameter estimation.\nPURPOSE: The advantage actor-critic (A2C) algorithm is a DRL algorithm with neural networks that seek the optimal parameters. The aim of this study was to preliminarily assess the role of the A2C algorithm in estimating the kinetic parameters of 18F-FDG PET/CT in patients with HCC.\nMATERIALS AND METHODS: 18F-FDG PET data from 14 liver tissues and 17 HCC tumors obtained via a previously developed, abbreviated acquisition protocol (5-min dynamic PET/CT imaging supplemented with 1-min static imaging at 60 min) were prospectively collected. The A2C algorithm was used to estimate kinetic parameters with a reversible double-input, three-compartment model, and the results were compared with those of the conventional nonlinear least squares (NLLS) algorithm. Fitting errors were compared via the root-mean-square errors (RMSEs) of the time activity curves (TACs).\nRESULTS: Significant differences in K1, k2, k3, k4, fa, and vb according to the A2C algorithm and k3, fa, and vb according to the NLLS algorithm were detected between HCC and normal liver tissues (all p < 0.05). Furthermore, A2C demonstrated superior diagnostic performance over NLLS in terms of k3 and vb (both p < 0.05 in the Delong test). Notably, A2C yielded a smaller fitting error for normal liver tissue (0.62 ± 0.24 vs. 1.04 ± 1.00) and HCC tissue (1.40 ± 0.42 vs. 1.51 ± 0.97) than did NLLS.\nCONCLUSIONS: Compared with the conventional postreconstruction NLLS method, the A2C algorithm can more precisely estimate 18F-FDG kinetic parameters with a reversible double-input, three-compartment model for HCC tumors, attaining better TAC fitting with a lower RMSE.",
    "abstract_zh": "**翻译：**<br><br>背景：利用动态18F-氟代脱氧葡萄糖（18F-FDG）正电子发射断层扫描（PET）/计算机断层扫描（CT）估计的动力学参数有助于表征肝细胞癌（HCC），而深度强化学习（DRL）可以改善动力学参数的估计。<br><br>目的：优势演员-评论家（A2C）算法是一种利用神经网络寻求最优参数的DRL算法。本研究旨在初步评估A2C算法在估计HCC患者18F-FDG PET/CT动力学参数中的作用。<br><br>材料与方法：前瞻性地收集了通过先前开发的简短采集方案（5分钟动态PET/CT成像，补充以60分钟时1分钟静态成像）获得的14例肝脏组织和17例HCC肿瘤的18F-FDG PET数据。使用A2C算法，采用可逆双输入三室模型来估计动力学参数，并将结果与传统的非线性最小二乘（NLLS）算法的结果进行比较。通过时间-活度曲线（TAC）的均方根误差（RMSE）比较拟合误差。<br><br>结果：根据A2C算法，HCC和正常肝脏组织在K1、k2、k3、k4、fa和vb方面存在显著差异；根据NLLS算法，在k3、fa和vb方面存在显著差异（所有p < 0.05）。此外，在k3和vb方面，A2C在诊断性能方面优于NLLS（Delong检验中均为p < 0.05）。值得注意的是，A2C在正常肝脏组织（0.62 ± 0.24 vs. 1.04 ± 1.00）和HCC组织（1.40 ± 0.42 vs. 1.51 ± 0.97）的拟合误差均低于NLLS。<br><br>结论：与传统的后重建NLLS方法相比，A2C算法可以更精确地估计HCC肿瘤的可逆双输入三室模型下的18F-FDG动力学参数，从而获得更好的TAC拟合效果和更低的RMSE。",
    "summary_zh": "本研究评估了深度强化学习算法A2C在18F-FDG PET/CT中估计肝细胞癌动力学参数的应用。研究结果表明，A2C算法在区分肝细胞癌和正常肝组织方面，特别是在动力学参数k3和vb的诊断性能上，优于传统的非线性最小二乘算法，并能更精确地拟合时间-活度曲线，降低拟合误差。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17851",
    "link": "https://doi.org/10.1002/mp.17851"
  },
  {
    "title": "Predicting [177Lu]Lu-DOTA-TATE dosimetry by using pre-therapy [68Ga]Ga-DOTA-TATE PET/CT and biomarkers in patient with neuroendocrine tumors.",
    "authors": [
      "Hongxing Yang",
      "Ming Qi",
      "Zhihao Chen",
      "Fei Liu",
      "Junyan Xu",
      "Xiaoping Xu",
      "Qing Kong",
      "Jianping Zhang",
      "Shaoli Song"
    ],
    "abstract": "BACKGROUND: Lutetium-177 DOTA-TATE peptide receptor radionuclide therapy (PRRT) is an established and effective treatment modality for patients with metastatic neuroendocrine tumors (NETs).\nPURPOSE: This study aims to predict patient-absorbed doses from [177Lu]Lu-DOTA-TATE PRRT in the liver, kidney and lesion by utilizing patient-specific absorbed doses from pre-therapeutic [68Ga]Ga-DOTA-TATE PET/CT.\nMETHODS: Before the treatment of cycle 1, 11 patients with NETs underwent PET/CT scans at 0.5, 1.0, 2.0 and 4.0 h after the injection of [68Ga]Ga-DOTA-TATE. Patients then received [177Lu]Lu-DOTA-TATE PRRT and underwent SPECT/CT scans at 4, 24, 96, and 168 h post-administration. The segmentations and dosimetry were performed by using a professional software. The linear regression model used the absorbed doses from [68Ga]Ga-DOTA-TATE alone as the predictor variable. The multiple linear regression model used the absorbed doses from [68Ga]Ga-DOTA-TATE and the relevant clinical biomarkers as the predictor variables.\nRESULTS: The mean absorbed doses from [177Lu]Lu-DOTA-TATE PRRT in kidney and liver were 4.1 and 2.1 Gy, respectively. In comparison, the mean absorbed doses from [68Ga]Ga-DOTA-TATE were significantly lower: 18.0 mGy and 11.0 mGy, respectively. For lesions, the maximum absorbed dose from [68Ga]Ga-DOTA-TATE ranged from 24.1 to 170.4 mGy, while the maximum absorbed dose from [177Lu]Lu-DOTA-TATE PRRT was significantly higher, ranging from 9.6 to 77.9 Gy. The linear regression model yielded moderate R-squared values of 0.50, 0.59, and 0.36 for kidney, liver and lesion, respectively. The performance of multiple linear regression model was better, with R-squared values increasing to 0.81, 0.77, and 0.84.\nCONCLUSION: Absorbed doses from [177Lu]Lu-DOTA-TATE PRRT can be accurately predicted. Moreover, our models are formalized into simple equations.",
    "abstract_zh": "**翻译：**<br><br>背景：镥-177 DOTA-TATE 肽受体放射性核素疗法（PRRT）是一种公认且有效的转移性神经内分泌肿瘤（NETs）患者的治疗方式。<br><br>目的：本研究旨在利用患者特异性的预治疗性 [68Ga]Ga-DOTA-TATE PET/CT 获得的吸收剂量，预测[177Lu]Lu-DOTA-TATE PRRT 在肝脏、肾脏和病灶中的患者吸收剂量。<br><br>方法：在首个治疗周期开始前，11 名 NETs 患者在注射 [68Ga]Ga-DOTA-TATE 后 0.5、1.0、2.0 和 4.0 小时进行了 PET/CT 扫描。随后，患者接受了 [177Lu]Lu-DOTA-TATE PRRT 治疗，并在给药后 4、24、96 和 168 小时进行了 SPECT/CT 扫描。分割和剂量学分析使用专业软件进行。线性回归模型仅使用 [68Ga]Ga-DOTA-TATE 的吸收剂量作为预测变量。多元线性回归模型使用 [68Ga]Ga-DOTA-TATE 的吸收剂量和相关的临床生物标志物作为预测变量。<br><br>结果：[177Lu]Lu-DOTA-TATE PRRT 在肾脏和肝脏中的平均吸收剂量分别为 4.1 Gy 和 2.1 Gy。相比之下，[68Ga]Ga-DOTA-TATE 的平均吸收剂量明显较低：分别为 18.0 mGy 和 11.0 mGy。对于病灶，[68Ga]Ga-DOTA-TATE 的最大吸收剂量范围为 24.1 至 170.4 mGy，而 [177Lu]Lu-DOTA-TATE PRRT 的最大吸收剂量明显更高，范围为 9.6 至 77.9 Gy。线性回归模型对肾脏、肝脏和病灶的 R 平方值分别为 0.50、0.59 和 0.36，结果中等。多元线性回归模型的性能更好，R 平方值分别提高到 0.81、0.77 和 0.84。<br><br>结论：[177Lu]Lu-DOTA-TATE PRRT 的吸收剂量可以被准确预测。此外，我们的模型被形式化为简单的方程。",
    "summary_zh": "本研究旨在通过预治疗的 [68Ga]Ga-DOTA-TATE PET/CT 数据预测 [177Lu]Lu-DOTA-TATE PRRT 在神经内分泌肿瘤患者肝脏、肾脏和病灶中的吸收剂量。研究结果表明，利用 [68Ga]Ga-DOTA-TATE 的吸收剂量和临床生物标志物建立的多元线性回归模型可以更准确地预测 [177Lu]Lu-DOTA-TATE PRRT 的吸收剂量，并且模型已被简化为简单的方程。这些模型有助于个体化PRRT治疗方案的制定。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17852",
    "link": "https://doi.org/10.1002/mp.17852"
  },
  {
    "title": "Depth-of-interaction encoding techniques for pixelated PET detectors enabled by machine learning methods and fast waveform digitization.",
    "authors": [
      "Bing Dai",
      "Srilalan Krishnamoorthy",
      "Emmanuel Morales",
      "Suleman Surti",
      "Joel S Karp"
    ],
    "abstract": "Objective. Pixelated detectors with single-ended readout are routinely used by commercial positron emission tomography scanners owing to their good energy and timing resolution and optimized manufacturing, but they typically do not provide depth-of-interaction (DOI) information, which can help improve the performance of systems with higher resolution and smaller ring diameter. This work aims to develop a technique for multi-level DOI classification that does not require modifications to the detector designs.Approach. We leveraged high-speed (5 Gs s-1) waveform sampling electronics with the Domino Ring Sampler (DRS4) and machine learning (ML) methods to extract DOI information from the entire scintillation waveforms of pixelated crystals. We evaluated different grouping schemes for multi-level DOI classification by analyzing the DOI positioning profile and DOI positioning error. We examined trade-offs among crystal configurations, detector timing performance, and DOI classification accuracy. We also investigated the impact of different ML algorithms and input features-extracted from scintillation waveforms-on model accuracy.Main results. The DOI positioning profile and positioning error suggest that 2- or 3-level binning was effective for 20 mm long crystals. 2-level discrete DOI models achieved 95% class-wise accuracy and 83% overall accuracy in positioning events into the correct DOI level and 3-level up to 90% class-wise accuracy for long and narrow crystals (2 × 2 × 20 mm3). Long short-term memory networks trained with time-frequency moments were twice as efficient in training time while maintaining equal or better accuracy compared to those trained with waveforms. Classical ML algorithms exhibit comparable accuracy while consuming one order less training time than deep learning models.Significance. This work demonstrates a proof-of-concept approach for obtaining DOI information from commercially available pixelated detectors without altering the detector design thereby avoiding potential degradation in detector timing performance. It provides an alternative solution for multi-level DOI classification, potentially inspiring future scanner designs.",
    "abstract_zh": "目标：由于其良好的能量和时间分辨率以及优化的制造工艺，具有单端读出的像素化探测器被商业正电子发射断层扫描仪（PET）广泛使用，但它们通常不提供深度交互（DOI）信息，而DOI信息有助于提高具有更高分辨率和更小环直径的系统的性能。本研究旨在开发一种多层DOI分类技术，该技术无需修改探测器设计。<br><br>方法：我们利用高速（5 Gs/s）波形采样电子设备，结合多米诺环形采样器（DRS4）和机器学习（ML）方法，从像素化晶体的整个闪烁波形中提取DOI信息。我们通过分析DOI定位剖面和DOI定位误差，评估了多层DOI分类的不同分组方案。我们研究了晶体配置、探测器时间性能和DOI分类精度之间的权衡。我们还研究了不同的ML算法和从闪烁波形中提取的输入特征对模型精度的影响。<br><br>主要结果：DOI定位剖面和定位误差表明，20毫米长的晶体采用2级或3级分箱是有效的。对于将事件定位到正确的DOI层级，2级离散DOI模型实现了95%的类间精度和83%的总体精度，而对于长而窄的晶体（2 × 2 × 20 mm3），3级模型实现了高达90%的类间精度。与使用波形训练的网络相比，使用时频矩训练的长短期记忆网络在训练时间上效率提高了一倍，同时保持了相同或更好的精度。经典的ML算法表现出相当的精度，但训练时间比深度学习模型少一个数量级。<br><br>意义：这项工作展示了一种概念验证方法，用于从商用像素化探测器中获取DOI信息，而无需改变探测器设计，从而避免了探测器时间性能的潜在降低。它为多层DOI分类提供了一种替代解决方案，可能为未来的扫描仪设计带来灵感。",
    "summary_zh": "该研究提出了一种利用高速波形采样和机器学习技术，从现有商用PET像素化探测器的闪烁波形中提取DOI信息的方法，而无需改变探测器物理设计。研究结果表明，通过分析DOI定位剖面和误差，2-3级DOI分类对于20mm晶体有效，且长短期记忆网络和经典机器学习算法在训练效率和精度方面表现出不同的优势。这项工作为未来PET扫描仪设计提供了一种无需修改现有探测器硬件即可实现DOI信息获取的替代方案。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/adc96d",
    "link": "https://doi.org/10.1088/1361-6560/adc96d"
  }
]