[
  {
    "title": "DGS-LRM: Real-Time Deformable 3D Gaussian Reconstruction From Monocular\n  Videos",
    "authors": [
      "Chieh Hubert Lin",
      "Zhaoyang Lv",
      "Songyin Wu",
      "Zhen Xu",
      "Thu Nguyen-Phuoc",
      "Hung-Yu Tseng",
      "Julian Straub",
      "Numair Khan",
      "Lei Xiao",
      "Ming-Hsuan Yang",
      "Yuheng Ren",
      "Richard Newcombe",
      "Zhao Dong",
      "Zhengqin Li"
    ],
    "abstract": "  We introduce the Deformable Gaussian Splats Large Reconstruction Model\n(DGS-LRM), the first feed-forward method predicting deformable 3D Gaussian\nsplats from a monocular posed video of any dynamic scene. Feed-forward scene\nreconstruction has gained significant attention for its ability to rapidly\ncreate digital replicas of real-world environments. However, most existing\nmodels are limited to static scenes and fail to reconstruct the motion of\nmoving objects. Developing a feed-forward model for dynamic scene\nreconstruction poses significant challenges, including the scarcity of training\ndata and the need for appropriate 3D representations and training paradigms. To\naddress these challenges, we introduce several key technical contributions: an\nenhanced large-scale synthetic dataset with ground-truth multi-view videos and\ndense 3D scene flow supervision; a per-pixel deformable 3D Gaussian\nrepresentation that is easy to learn, supports high-quality dynamic view\nsynthesis, and enables long-range 3D tracking; and a large transformer network\nthat achieves real-time, generalizable dynamic scene reconstruction. Extensive\nqualitative and quantitative experiments demonstrate that DGS-LRM achieves\ndynamic scene reconstruction quality comparable to optimization-based methods,\nwhile significantly outperforming the state-of-the-art predictive dynamic\nreconstruction method on real-world examples. Its predicted physically grounded\n3D deformation is accurate and can readily adapt for long-range 3D tracking\ntasks, achieving performance on par with state-of-the-art monocular video 3D\ntracking methods.\n",
    "published": "2025-06-11T17:59:58Z",
    "link": "http://arxiv.org/abs/2506.09997v1",
    "pdf_link": "http://arxiv.org/pdf/2506.09997v1"
  },
  {
    "title": "eFlesh: Highly customizable Magnetic Touch Sensing using Cut-Cell\n  Microstructures",
    "authors": [
      "Venkatesh Pattabiraman",
      "Zizhou Huang",
      "Daniele Panozzo",
      "Denis Zorin",
      "Lerrel Pinto",
      "Raunaq Bhirangi"
    ],
    "abstract": "  If human experience is any guide, operating effectively in unstructured\nenvironments -- like homes and offices -- requires robots to sense the forces\nduring physical interaction. Yet, the lack of a versatile, accessible, and\neasily customizable tactile sensor has led to fragmented, sensor-specific\nsolutions in robotic manipulation -- and in many cases, to force-unaware,\nsensorless approaches. With eFlesh, we bridge this gap by introducing a\nmagnetic tactile sensor that is low-cost, easy to fabricate, and highly\ncustomizable. Building an eFlesh sensor requires only four components: a\nhobbyist 3D printer, off-the-shelf magnets (<$5), a CAD model of the desired\nshape, and a magnetometer circuit board. The sensor is constructed from tiled,\nparameterized microstructures, which allow for tuning the sensor's geometry and\nits mechanical response. We provide an open-source design tool that converts\nconvex OBJ/STL files into 3D-printable STLs for fabrication. This modular\ndesign framework enables users to create application-specific sensors, and to\nadjust sensitivity depending on the task. Our sensor characterization\nexperiments demonstrate the capabilities of eFlesh: contact localization RMSE\nof 0.5 mm, and force prediction RMSE of 0.27 N for normal force and 0.12 N for\nshear force. We also present a learned slip detection model that generalizes to\nunseen objects with 95% accuracy, and visuotactile control policies that\nimprove manipulation performance by 40% over vision-only baselines -- achieving\n91% average success rate for four precise tasks that require sub-mm accuracy\nfor successful completion. All design files, code and the CAD-to-eFlesh STL\nconversion tool are open-sourced and available on https://e-flesh.com.\n",
    "published": "2025-06-11T17:59:46Z",
    "link": "http://arxiv.org/abs/2506.09994v1",
    "pdf_link": "http://arxiv.org/pdf/2506.09994v1"
  },
  {
    "title": "Hearing Hands: Generating Sounds from Physical Interactions in 3D Scenes",
    "authors": [
      "Yiming Dou",
      "Wonseok Oh",
      "Yuqing Luo",
      "Antonio Loquercio",
      "Andrew Owens"
    ],
    "abstract": "  We study the problem of making 3D scene reconstructions interactive by asking\nthe following question: can we predict the sounds of human hands physically\ninteracting with a scene? First, we record a video of a human manipulating\nobjects within a 3D scene using their hands. We then use these action-sound\npairs to train a rectified flow model to map 3D hand trajectories to their\ncorresponding audio. At test time, a user can query the model for other\nactions, parameterized as sequences of hand poses, to estimate their\ncorresponding sounds. In our experiments, we find that our generated sounds\naccurately convey material properties and actions, and that they are often\nindistinguishable to human observers from real sounds. Project page:\nhttps://www.yimingdou.com/hearing_hands/\n",
    "published": "2025-06-11T17:58:34Z",
    "link": "http://arxiv.org/abs/2506.09989v1",
    "pdf_link": "http://arxiv.org/pdf/2506.09989v1"
  },
  {
    "title": "A Shortcut-aware Video-QA Benchmark for Physical Understanding via\n  Minimal Video Pairs",
    "authors": [
      "Benno Krojer",
      "Mojtaba Komeili",
      "Candace Ross",
      "Quentin Garrido",
      "Koustuv Sinha",
      "Nicolas Ballas",
      "Mahmoud Assran"
    ],
    "abstract": "  Existing benchmarks for assessing the spatio-temporal understanding and\nreasoning abilities of video language models are susceptible to score inflation\ndue to the presence of shortcut solutions based on superficial visual or\ntextual cues. This paper mitigates the challenges in accurately assessing model\nperformance by introducing the Minimal Video Pairs (MVP) benchmark, a simple\nshortcut-aware video QA benchmark for assessing the physical understanding of\nvideo language models. The benchmark is comprised of 55K high-quality\nmultiple-choice video QA examples focusing on physical world understanding.\nExamples are curated from nine video data sources, spanning first-person\negocentric and exocentric videos, robotic interaction data, and cognitive\nscience intuitive physics benchmarks. To mitigate shortcut solutions that rely\non superficial visual or textual cues and biases, each sample in MVP has a\nminimal-change pair -- a visually similar video accompanied by an identical\nquestion but an opposing answer. To answer a question correctly, a model must\nprovide correct answers for both examples in the minimal-change pair; as such,\nmodels that solely rely on visual or textual biases would achieve below random\nperformance. Human performance on MVP is 92.9\\%, while the best open-source\nstate-of-the-art video-language model achieves 40.2\\% compared to random\nperformance at 25\\%.\n",
    "published": "2025-06-11T17:57:32Z",
    "link": "http://arxiv.org/abs/2506.09987v1",
    "pdf_link": "http://arxiv.org/pdf/2506.09987v1"
  },
  {
    "title": "V-JEPA 2: Self-Supervised Video Models Enable Understanding, Prediction\n  and Planning",
    "authors": [
      "Mido Assran",
      "Adrien Bardes",
      "David Fan",
      "Quentin Garrido",
      "Russell Howes",
      " Mojtaba",
      " Komeili",
      "Matthew Muckley",
      "Ammar Rizvi",
      "Claire Roberts",
      "Koustuv Sinha",
      "Artem Zholus",
      "Sergio Arnaud",
      "Abha Gejji",
      "Ada Martin",
      "Francois Robert Hogan",
      "Daniel Dugas",
      "Piotr Bojanowski",
      "Vasil Khalidov",
      "Patrick Labatut",
      "Francisco Massa",
      "Marc Szafraniec",
      "Kapil Krishnakumar",
      "Yong Li",
      "Xiaodong Ma",
      "Sarath Chandar",
      "Franziska Meier",
      "Yann LeCun",
      "Michael Rabbat",
      "Nicolas Ballas"
    ],
    "abstract": "  A major challenge for modern AI is to learn to understand the world and learn\nto act largely by observation. This paper explores a self-supervised approach\nthat combines internet-scale video data with a small amount of interaction data\n(robot trajectories), to develop models capable of understanding, predicting,\nand planning in the physical world. We first pre-train an action-free\njoint-embedding-predictive architecture, V-JEPA 2, on a video and image dataset\ncomprising over 1 million hours of internet video. V-JEPA 2 achieves strong\nperformance on motion understanding (77.3 top-1 accuracy on Something-Something\nv2) and state-of-the-art performance on human action anticipation (39.7\nrecall-at-5 on Epic-Kitchens-100) surpassing previous task-specific models.\nAdditionally, after aligning V-JEPA 2 with a large language model, we\ndemonstrate state-of-the-art performance on multiple video question-answering\ntasks at the 8 billion parameter scale (e.g., 84.0 on PerceptionTest, 76.9 on\nTempCompass). Finally, we show how self-supervised learning can be applied to\nrobotic planning tasks by post-training a latent action-conditioned world\nmodel, V-JEPA 2-AC, using less than 62 hours of unlabeled robot videos from the\nDroid dataset. We deploy V-JEPA 2-AC zero-shot on Franka arms in two different\nlabs and enable picking and placing of objects using planning with image goals.\nNotably, this is achieved without collecting any data from the robots in these\nenvironments, and without any task-specific training or reward. This work\ndemonstrates how self-supervised learning from web-scale data and a small\namount of robot interaction data can yield a world model capable of planning in\nthe physical world.\n",
    "published": "2025-06-11T17:57:09Z",
    "link": "http://arxiv.org/abs/2506.09985v1",
    "pdf_link": "http://arxiv.org/pdf/2506.09985v1"
  },
  {
    "title": "Evidence for Bose liquid from anomalous shot noise in nanojunctions of\n  bad metal beta-Ta",
    "authors": [
      "Yiou Zhang",
      "Chendi Xie",
      "John Bacsa",
      "Yao Wang",
      "Sergei Urazhdin"
    ],
    "abstract": "  We report anomalous shot noise in nanojunctions of beta-tantalum, a ``bad\"\nmetal whose electronic properties are inconsistent with the Fermi liquid\ntheory. Fano factors cluster around even multiples of the values expected for\nFermi liquids, suggesting that beta-Ta may host a correlated charge liquid of\nCooper pair-like electron groups. Further evidence for correlations is provided\nby the effects of magnetic impurities, as well as reduced density of states\nnear the Fermi level indicated by point contact spectroscopy and first\nprinciples calculations. Our results open new avenues for studies and\napplications of electron correlations.\n",
    "published": "2025-06-11T17:48:12Z",
    "link": "http://arxiv.org/abs/2506.09973v1",
    "pdf_link": "http://arxiv.org/pdf/2506.09973v1"
  },
  {
    "title": "Wild wall-crossing and symmetric quivers in 4d and 3d $\\mathcal{N}=2$\n  field theories",
    "authors": [
      "Daniel Bryan",
      "Piotr Sułkowski"
    ],
    "abstract": "  We reformulate Kontsevich-Soibelman wall-crossing formulae for 4d\n$\\mathcal{N}=2$ class $\\mathcal{S}$ theories and corresponding BPS quivers,\nincluding those of wild type, as identities for generating series of symmetric\nquivers that represent dualities of 3d $\\mathcal{N}=2$ boundary theories. We\nidentify such symmetric quivers for both sides of the wall-crossing formulae.\nIn the finite chamber such a quiver is captured by the symmetrized BPS quiver,\nwhereas on the other side of the wall we find an infinite quiver with an\nintricate pattern of arrows and loops. Invoking diagonalization, for\n$m$-Kronecker quivers we find a wall-crossing type formula involving trees of\nunlinkings that expresses closed Donaldson-Thomas invariants of the\ncorresponding 4d theories in terms of open Donaldson-Thomas invariants of the\n3d theories and invariants of $m$-loop quivers. Using this formula, we\ndetermine a number of closed Donaldson-Thomas invariants of wild type.\n",
    "published": "2025-06-11T17:47:30Z",
    "link": "http://arxiv.org/abs/2506.09972v1",
    "pdf_link": "http://arxiv.org/pdf/2506.09972v1"
  },
  {
    "title": "Quantum block Krylov subspace projector algorithm for computing\n  low-lying eigenenergies",
    "authors": [
      "Maria Gabriela Jordão Oliveira",
      "Nina Glaser"
    ],
    "abstract": "  Determining eigenvalues is a computationally expensive task that is crucial\nfor countless applications in natural sciences. Toward this end, we introduce\nthe quantum block Krylov subspace projector (QBKSP) algorithm, a multireference\nquantum variant of the Lanczos algorithm designed to accurately compute\nlow-lying eigenvalues, including degenerate states. We present three different\ncompact quantum circuits to evaluate the required expectation values, each\nsuited to different problem settings. To investigate the impact of the number\nand fidelity of the initial reference states, as well as time evolution\nduration, we perform error-free and limited-precision numerical simulations and\nquantum circuit simulations. The results demonstrate that using multiple\ninitial reference states improves the convergence of the algorithm, especially\nin realistic precision-limited simulations and in cases where a single\nreference fails to simultaneously retrieve all desired eigenvalues.\nFurthermore, the QBKSP algorithm enables the computation of degenerate\neigenstates and respective multiplicity by imposing appropriate convergence\ncriteria.\n",
    "published": "2025-06-11T17:47:22Z",
    "link": "http://arxiv.org/abs/2506.09971v1",
    "pdf_link": "http://arxiv.org/pdf/2506.09971v1"
  },
  {
    "title": "Dynamic Hypergraph Partitioning of Quantum Circuits with Hybrid\n  Execution",
    "authors": [
      "Shane Sweeney",
      "Krishnendu Guha"
    ],
    "abstract": "  Quantum algorithms offer an exponential speedup over classical algorithms for\na range of computational problems. The fundamental mechanisms underlying\nquantum computation required the development and construction of quantum\ncomputers. These devices are referred to as NISQ (Noisy Intermediate-Scale\nQuantum) devices. Not only are NISQ devices extremely limited in their qubit\ncount but they also suffer from noise during computation and this problem only\ngets worse as the size of the circuit increases which limits the practical use\nof quantum computers for modern day applications. This paper will focus on\nutilizing quantum circuit partitioning to overcome the inherent issues of NISQ\ndevices. Partitioning a quantum circuit into smaller subcircuits has allowed\nfor the execution of quantum circuits that are too large to fit on one quantum\ndevice. There have been many previous approaches to quantum circuit\npartitioning and each of these approaches differ in how they work with some\nfocusing on hardware-aware partitioning, optimal graph-based partitioning,\nmulti-processor architectures and many more. These approaches achieve success\nin their objective but they often fail to scale well which impacts cost and\nnoise. The ultimate goal of this paper is to mitigate these issues by\nminimizing 3 important metrics; noise, time and cost. To achieve this we use\ndynamic partitioning for practical circuit cutting and we take advantage of the\nbenefits of hybrid execution where classical computation will be used alongside\nquantum hardware. This approach has proved to be beneficial with respect to\nnoise with classical execution enabling a 42.30% reduction in noise and a 40%\nreduction in the number of qubits required in cases where a mixture of\nclassical and quantum computation were required.\n",
    "published": "2025-06-11T17:41:05Z",
    "link": "http://arxiv.org/abs/2506.09963v1",
    "pdf_link": "http://arxiv.org/pdf/2506.09963v1"
  },
  {
    "title": "Refining ensemble $N$-representability of one-body density matrices from\n  partial information",
    "authors": [
      "Julia Liebert",
      "Anna O. Schouten",
      "Irma Avdic",
      "Christian Schilling",
      "David A. Mazziotti"
    ],
    "abstract": "  The $N$-representability problem places fundamental constraints on reduced\ndensity matrices (RDMs) that originate from physical many-fermion quantum\nstates. Motivated by recent developments in functional theories, we introduce a\nhierarchy of ensemble one-body $N$-representability problems that incorporate\npartial knowledge of the one-body reduced density matrices (1RDMs) within an\nensemble of $N$-fermion states with fixed weights $w_i$. Specifically, we\npropose a systematic relaxation that reduces the refined problem -- where full\n1RDMs are fixed for certain ensemble elements -- to a more tractable form\ninvolving only natural occupation number vectors. Remarkably, we show that this\nrelaxed problem is related to a generalization of Horn's problem, enabling an\nexplicit solution by combining its constraints with those of the weighted\nensemble $N$-representability conditions. An additional convex relaxation\nyields a convex polytope that provides physically meaningful restrictions on\nlattice site occupations in ensemble density functional theory for excited\nstates.\n",
    "published": "2025-06-11T17:36:32Z",
    "link": "http://arxiv.org/abs/2506.09960v1",
    "pdf_link": "http://arxiv.org/pdf/2506.09960v1"
  }
]