[
  {
    "title": "Simulation and one-ring prototyping of 1-mm-rod-resolution hemispherical brain PET with TOF-DOI detectors.",
    "authors": [
      "Kurumi Narita",
      "Go Akamatsu",
      "Eiji Yoshida",
      "Hideaki Tashima",
      "Yuma Iwao",
      "Miwako Takahashi",
      "Taiga Yamaya"
    ],
    "abstract": "Brain PET imaging plays crucial roles in research and diagnosis of various brain diseases. To achieve high spatial resolution and high sensitivity, we proposed a hemispherical geometry which offers higher sensitivity with fewer detectors than a conventional cylindrical geometry. Our developed hemispherical brain PET system, Vrain, has indeed achieved a rod resolution of 2.2 mm with a 229 ps time-of-flight (TOF) resolution. To further improve the spatial resolution, we will use TOF and depth-of-interaction (DOI) detectors with our original crosshair light-sharing (CLS) configuration. This study aimed at estimating the performance of the hemispherical brain PET with TOF-DOI detectors and at developing a one-ring PET prototype with 1.6 mm scintillator pitch CLS-based TOF-DOI detectors. &#xD;Approach. The sensitivity, rod resolution, and image quality of the TOF-DOI hemispherical brain PET (TDHBP-sim) and Vrain (Vrain-sim) were estimated using Geant4 simulation. A one-ring prototype with a 30-cm diameter was developed using the CLS-based TOF-DOI detectors. The energy resolution, TOF timing resolution, rod resolution, and the Hoffman brain phantom image quality of the prototype were evaluated.&#xD;Main results. In the simulation study, TDHBP-sim achieved 1.4 times better sensitivity than Vrain-sim. TDHBP-sim visualized 1.0 mm rods and gyri and sulci structures in the brain phantom. In the one-ring experiment, the energy resolution was 11.6% at 511 keV, the TOF timing resolution was 294.6 ps, and 1.0 mm rods were resolved at the central 10-cm-diameter field-of-view. The 0.8-mm-thick radioactivity distribution could be identified in the Hoffman phantom. &#xD;Significance. The study findings suggested that a hemispherical brain PET with 1.6 mm scintillator pitch TOF-DOI detectors should offer excellent performance including 1 mm rod resolution.&#xD.",
    "abstract_zh": "**翻译:**<br><br>脑部PET成像在各种脑部疾病的研究和诊断中发挥着关键作用。为了实现高空间分辨率和高灵敏度，我们提出了一种半球形几何结构，与传统的圆柱形几何结构相比，它可以用更少的探测器提供更高的灵敏度。我们开发的半球形脑部PET系统Vrain已经实现了2.2毫米的棒分辨率和229皮秒的时间飞行（TOF）分辨率。为了进一步提高空间分辨率，我们将结合TOF和深度交互（DOI）探测器，采用我们独创的十字线光共享（CLS）配置。本研究旨在评估具有TOF-DOI探测器的半球形脑部PET的性能，并开发一个单环PET原型，该原型采用基于CLS的1.6毫米闪烁体间距的TOF-DOI探测器。<br><br>方法：使用Geant4模拟评估了TOF-DOI半球形脑部PET（TDHBP-sim）和Vrain（Vrain-sim）的灵敏度、棒分辨率和图像质量。使用基于CLS的TOF-DOI探测器开发了一个直径为30厘米的单环原型。评估了原型的能量分辨率、TOF时间分辨率、棒分辨率和霍夫曼脑部模型图像质量。<br><br>主要结果：在模拟研究中，TDHBP-sim的灵敏度比Vrain-sim提高了1.4倍。TDHBP-sim可视化了脑部模型中的1.0毫米棒以及脑回和脑沟结构。在单环实验中，511 keV时的能量分辨率为11.6%，TOF时间分辨率为294.6皮秒，并且在中心10厘米直径的视场中可以分辨出1.0毫米的棒。可以在霍夫曼模型中识别出0.8毫米厚的放射性分布。<br><br>意义：研究结果表明，具有1.6毫米闪烁体间距TOF-DOI探测器的半球形脑部PET应能提供优异的性能，包括1毫米的棒分辨率。<br><br>**",
    "summary_zh": "**\n\n该研究旨在提高脑部PET成像的空间分辨率和灵敏度。研究者提出并评估了一种基于半球形几何结构和TOF-DOI探测器，结合十字线光共享（CLS）配置的PET系统。通过模拟和单环原型实验，结果表明该系统具有更高的灵敏度、更好的空间分辨率，能有效识别脑部结构，有望实现1毫米的棒分辨率，为脑部疾病的研究和诊断提供更清晰的图像。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/ade2b4",
    "link": "https://doi.org/10.1088/1361-6560/ade2b4"
  },
  {
    "title": "Development of an ultrasensitive small animal PET with 4-layer DOI detectors for sub-second dynamic rodent imaging.",
    "authors": [
      "Han Gyu Kang",
      "Hideaki Tashima",
      "Hidekatsu Wakizaka",
      "Go Akamatsu",
      "Yuma Iwao",
      "Chie Toramatsu",
      "Taiga Yamaya"
    ],
    "abstract": "Dynamic PET imaging is important for preclinical research since it can visualize the functional information of rodent models as a function of time. However, the temporal resolution of small animal PET imaging has been limited to a scale of seconds due to low sensitivity, and it is not sufficient to capture cardiac or brain function accurately. Here, we present an ultrasensitive small-animal PET scanner with total-body coverage for sub-second dynamic imaging of a rat.&#xD;Methods: The ultrasensitive small animal PET scanner has a 155 mm inner diameter and 325.6 mm axial coverage. The PET scanner has 6 rings, each of which has 10 depth-of-interaction detectors. Each depth-of-interaction detector consists of a 4-layer Zr-doped gadolinium oxyorthosilicate crystal array (2.85 mm pitch, 30 mm total thickness) and 8×8 multi-anode photomultiplier tubes. The physical PET performance was evaluated based on the National Electrical Manufacturers Association NU4 protocol. Sub-second dynamic rat imaging was performed with 18F-FDG tracer. &#xD;Main Results: The peak absolute sensitivity was 20.2% and spatial resolution was 2.6 mm at the center of the field of view with an energy window of 400-600 keV. Total-body images of a rat were obtained with a single bed position. The cardiac function of a rat was visualized with 0.25 s temporal resolution, which was hardly possible with conventional small animal PET scanners. &#xD;Significance: The developed ultrasensitive animal PET enabled sub-second dynamic PET imaging in rodent models with total-body coverage. In conclusion, the ultrasensitive small animal PET scanner can serve as a useful molecular imaging tool for preclinical research with its long axial coverage sub-second temporal resolution.",
    "abstract_zh": "**翻译：**<br><br>动态PET成像对于临床前研究至关重要，因为它能够随时间推移可视化啮齿动物模型的功能信息。然而，由于灵敏度较低，小动物PET成像的时间分辨率一直受限于秒级，这不足以准确捕捉心脏或大脑功能。在此，我们展示了一种超灵敏的小动物PET扫描仪，具有全身覆盖范围，可对大鼠进行亚秒级动态成像。<br><br>**方法：** 该超灵敏小动物PET扫描仪内径为155毫米，轴向覆盖范围为325.6毫米。PET扫描仪具有6个环，每个环都有10个深度方向定位探测器。每个深度方向定位探测器由一个四层掺锆硅酸钆晶体阵列（2.85毫米间距，总厚度30毫米）和8×8多阳极光电倍增管组成。基于美国国家电子制造商协会NU4协议评估了PET的物理性能。使用18F-FDG示踪剂进行了亚秒级动态大鼠成像。<br><br>**主要结果：** 在400-600 keV的能量窗下，峰值绝对灵敏度为20.2%，视野中心的空间分辨率为2.6毫米。通过单床位获得了大鼠的全身图像。利用0.25秒的时间分辨率可视化了大鼠的心脏功能，这在传统的的小动物PET扫描仪上几乎是不可能的。<br><br>**意义：** 开发的超灵敏动物PET使啮齿动物模型能够进行全身覆盖的亚秒级动态PET成像。总而言之，凭借其较长的轴向覆盖范围和亚秒级时间分辨率，该超灵敏小动物PET扫描仪可以作为临床前研究中一种有用的分子成像工具。",
    "summary_zh": "该研究开发了一种新型超灵敏小动物PET扫描仪，具有全身覆盖和亚秒级时间分辨率。该扫描仪在灵敏度和空间分辨率方面表现出色，并通过18F-FDG示踪剂实现了大鼠心脏功能的亚秒级动态成像，突破了传统小动物PET扫描仪的限制。该设备有望成为临床前研究中强大的分子成像工具。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/ade112",
    "link": "https://doi.org/10.1088/1361-6560/ade112"
  },
  {
    "title": "Physical phantom validation of clustering-initiated factorization in dynamic PET.",
    "authors": [
      "Valerie Kobzarenko",
      "Suzanne L Baker",
      "Mustafa Janabi",
      "Woon-Seng Choong",
      "Grant T Gullberg",
      "Youngho Seo",
      "Rostyslav Boutchko",
      "Debasis Mitra"
    ],
    "abstract": "BACKGROUND: Dynamic positron emission tomography (PET) enables the quantification of physiological parameters of radiotracers employed in the investigation of neuropsychiatric disorders. We previously introduced a factor analysis-based algorithm, Cluster-Initialized Factor Analysis (CIFA), designed to overcome the problem of specifying reference regions. CIFA is capable of automatically extracting distinct radiotracer binding distributions across many modalities based on the differences in tracer dynamics, and thus can distinguish regions of specific- and non-specific binding without requiring prior segmentation.\nPURPOSE: Our goal is to quantitatively validate the ability of CIFA to resolve different dynamic biological processes by comparing the output of the algorithm to an independent benchmark. As an intermediate goal, we aim to create a physical phantom capable of modeling unique aspects of dynamic imaging and to use this phantom as the benchmark in evaluating CIFA.\nMETHODS: CIFA was used to reconstruct 18F-flortaucipir dynamic brain PET datasets acquired at Lawrence Berkeley National Lab. The resulting factor curves served as the foundation for creating dynamic input time-activity curve (TAC) combinations in a physical brain phantom specifically constructed for this purpose. The phantom represented three components: two overlapping tissue types and free radiotracer, constructed with a combination of small hydraulic elements. The physical components were scanned separately to generate a library of images, allowing us to reproduce scans of any duration with prescribed dynamics and realistic partial volume effects. The phantom was designed to produce noisy instances with compartment mixing of dynamic scans with desired activity TACs for free, non-specifically bound, and specifically bound radiotracers. Ten distinct dynamic simulations with varying levels of TAC similarity were estimated with CIFA.\nRESULTS: We directly evaluated CIFA's performance in analyzing each of the 10 dynamic datasets by computing the Pearson correlation coefficient between the estimated outputs and the ground truth tissue TACs and corresponding tissue distributions. For seven out of 10 modeled dynamics, which captured the full spectrum of realistically expected tissue TAC shapes, the curve correlation of the specific binding tissue was above 95%.\nCONCLUSIONS: This work formulated an innovative process by combining a physical phantom design with PET images for evaluating the application of CIFA in the extraction of dynamic TACs from dynamic PET image data. In most cases the CIFA algorithm accurately reproduced the dynamics of the phantom simulated data.",
    "abstract_zh": "**翻译：**<br><br>背景：动态正电子发射断层扫描（PET）能够量化放射性示踪剂的生理参数，这些示踪剂被用于神经精神疾病的研究。我们先前引入了一种基于因子分析的算法，即聚类初始化因子分析（CIFA），旨在克服指定参考区域的问题。CIFA能够基于示踪剂动力学的差异，自动提取跨多种模态的不同放射性示踪剂结合分布，因此可以在不需要预先分割的情况下区分特异性结合区域和非特异性结合区域。<br><br>目的：我们的目标是通过将算法的输出与独立的基准进行比较，来定量验证CIFA解析不同动态生物过程的能力。作为一个中间目标，我们旨在创建一个能够模拟动态成像独特方面的物理模型，并使用该模型作为评估CIFA的基准。<br><br>方法：我们使用CIFA重建了在劳伦斯伯克利国家实验室获得的18F-flortaucipir动态脑部PET数据集。生成的因子曲线构成了在专门为此目的构建的物理脑部模型中创建动态输入时间-活动曲线（TAC）组合的基础。该模型代表了三个组成部分：两种重叠的组织类型和游离放射性示踪剂，它们由小型液压元件组合构成。物理组件被单独扫描以生成图像库，从而使我们能够重现具有规定动力学和真实部分容积效应的任何持续时间的扫描。该模型被设计用于产生具有所需活动TAC的游离、非特异性结合和特异性结合放射性示踪剂的动态扫描的噪声实例，并具有区室混合。我们使用CIFA估算了十个具有不同TAC相似度水平的独特动态模拟。<br><br>结果：我们通过计算估计输出与真实组织TAC和相应组织分布之间的Pearson相关系数，直接评估了CIFA在分析每个10个动态数据集中的性能。对于10个建模动力学中的7个，这些动力学捕获了现实预期的组织TAC形状的完整谱，特异性结合组织的曲线相关性高于95％。<br><br>结论：这项工作通过将物理模型设计与PET图像相结合，形成了一种创新的过程，用于评估CIFA在从动态PET图像数据中提取动态TAC中的应用。在大多数情况下，CIFA算法准确地重现了模型模拟数据的动力学。",
    "summary_zh": "该研究旨在验证名为CIFA的动态PET数据分析算法在解析不同生物过程中的能力。研究人员创建了一个物理脑模型，模拟了两种组织类型和游离放射性示踪剂，并用它来生成具有不同动态特征的数据集。通过比较CIFA算法的分析结果与模型中的真实数据，结果表明CIFA在大多数情况下能够准确地提取出动态PET图像中的时间-活动曲线。该研究为评估和验证CIFA算法在动态PET数据分析中的应用提供了一种创新方法。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17902",
    "link": "https://doi.org/10.1002/mp.17902"
  },
  {
    "title": "Machine learning positioning algorithms for long semi-monolithic scintillator PET detectors.",
    "authors": [
      "Samuel Mungai Kinyanjui",
      "Zhonghua Kuang",
      "Zheng Liu",
      "Ning Ren",
      "Yongfeng Yang"
    ],
    "abstract": "Objective.In this work, machine learning positioning algorithms are developed to improve the spatial resolutions of the semi-monolithic scintillator detectors in both monolithic (y) and depth of interaction (z) directions.Approach.Two long semi-monolithic scintillator detectors consisting of 12 lutetium yttrium oxyorthosilicate (LYSO) slabs of 0.96 × 56 × 10 mm3and 14 LYSO slabs of 0.81 × 56 × 10 mm3were manufactured. The scintillator arrays were read out by a 4 × 16 silicon photomultiplier array. 27 × 5 (y, z) positions of each detector were irradiated via a collimated22Na pencil beam. Extreme gradient boosting (XGBoost) machine learning model was used to predict the interaction positions foryandz. The genetic algorithm (GA) or particle swarm optimization (PSO) algorithm was used to optimize hyperparameters for the XGBoost model. The results of the machine learning positioning algorithms were compared to analytical positioning methods.Main results.The GA and PSO algorithms provided similar results. Compared to the analytical methods, the machine learning positioning methods improved bothyandzspatial resolutions especially at both ends of the detectors. The averageyspatial resolutions using the machine learning positioning methods were 0.92 ± 0.41 mm and 0.94 ± 0.44 mm as compared to those obtained with the squared center of gravity method of 1.38 ± 0.23 mm and 1.39 ± 0.25 mm for the two detectors, respectively. The averagezspatial resolutions obtained with the machine learning positioning methods were 1.67 ± 0.41 mm and 1.68 ± 0.45 mm as compared to those obtained with inverse standard deviation method of 2.09 ± 0.82 mm and 2.14 ± 0.81 mm for the two detectors, respectively.Significance.With the machine learning positioning algorithms, the semi-monolithic scintillator detectors with submillimeter slab thickness evaluated in this work provide less than 1 mmyspatial resolution and less than 2 mmzspatial resolution.",
    "abstract_zh": "**翻译：**<br><br>**目的。** 本研究旨在开发机器学习定位算法，以提高半单片闪烁体探测器在单片（y）方向和深度方向（z）的空间分辨率。<br><br>**方法。** 制造了两个长的半单片闪烁体探测器，分别由12个0.96 × 56 × 10 mm³ 的镥钇正硅酸盐（LYSO）板和14个0.81 × 56 × 10 mm³ 的LYSO板组成。 闪烁体阵列由 4 × 16 硅光电倍增管阵列读出。 通过准直的²²Na 铅笔束照射每个探测器的 27 × 5 (y, z) 个位置。 使用极端梯度提升（XGBoost）机器学习模型来预测 y 和 z 方向的相互作用位置。 采用遗传算法（GA）或粒子群优化（PSO）算法来优化 XGBoost 模型的超参数。 将机器学习定位算法的结果与解析定位方法进行了比较。<br><br>**主要结果。** GA 和 PSO 算法提供了相似的结果。 与解析方法相比，机器学习定位方法提高了 y 和 z 方向的空间分辨率，尤其是在探测器的两端。 使用机器学习定位方法获得的平均 y 方向空间分辨率分别为 0.92 ± 0.41 mm 和 0.94 ± 0.44 mm，而使用平方重心法获得的平均 y 方向空间分辨率对于两个探测器分别为 1.38 ± 0.23 mm 和 1.39 ± 0.25 mm。 使用机器学习定位方法获得的平均 z 方向空间分辨率分别为 1.67 ± 0.41 mm 和 1.68 ± 0.45 mm，而使用反标准差方法获得的平均 z 方向空间分辨率对于两个探测器分别为 2.09 ± 0.82 mm 和 2.14 ± 0.81 mm。<br><br>**意义。** 使用机器学习定位算法，本研究评估的具有亚毫米级板厚度的半单片闪烁体探测器可提供小于 1 mm 的 y 方向空间分辨率和小于 2 mm 的 z 方向空间分辨率。",
    "summary_zh": "本研究利用机器学习算法（XGBoost，并使用GA或PSO优化超参数）改进了半单片LYSO闪烁体探测器的空间分辨率。结果表明，相比于传统的解析定位方法，机器学习方法显著提高了y方向和z方向的空间分辨率，尤其是在探测器的两端。最终，该研究实现了亚毫米级的y方向分辨率和小于2mm的z方向分辨率。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/addbbe",
    "link": "https://doi.org/10.1088/1361-6560/addbbe"
  },
  {
    "title": "Uncertainty quantification for deep learning-based metastatic lesion segmentation on whole body PET/CT.",
    "authors": [
      "Brayden Schott",
      "Victor Santoro-Fernandes",
      "Žan Klaneček",
      "Scott Perlman",
      "Robert Jeraj"
    ],
    "abstract": "Objective.Deep learning models are increasingly being implemented for automated medical image analysis to inform patient care. Most models, however, lack uncertainty information, without which the reliability of model outputs cannot be ensured. Several uncertainty quantification (UQ) methods exist to capture model uncertainty. Yet, it is not clear which method is optimal for a given task. The purpose of this work was to investigate several commonly used UQ methods for the critical yet understudied task of metastatic lesion segmentation on whole body PET/CT.Approach.59 whole body68Ga-DOTATATE PET/CT images of patients undergoing theranostic treatment of metastatic neuroendocrine tumors were used in this work. A 3D U-Net was trained for lesion segmentation following five-fold cross validation. Uncertainty measures derived from four UQ methods-probability entropy, Monte Carlo dropout, deep ensembles, and test time augmentation-were investigated. Each uncertainty measure was assessed across four quantitative evaluations: (1) its ability to detect artificially degraded image data at low, medium, and high degradation magnitudes; (2) to detect false-positive (FP) predicted regions; (3) to recover false-negative (FN) predicted regions; and (4) to establish correlations with model biomarker extraction and segmentation performance metrics.Mainresults.Test time augmentation and probability entropy respectively achieved the highest and lowest degraded image detection at low (AUC = 0.54 vs. 0.68), medium (AUC = 0.70 vs. 0.82), and high (AUC = 0.83 vs. 0.90) degradation magnitudes. For detecting FPs, all UQ methods achieve strong performance, with AUC values ranging narrowly between 0.77 and 0.81. FN region recovery performance was strongest for test time augmentation and weakest for probability entropy. Performance for the correlation analysis was mixed, where the strongest performance was achieved by test time augmentation for SUVtotalcapture (ρ= 0.57) and segmentation Dice coefficient (ρ= 0.72), by Monte Carlo dropout for SUVmeancapture (ρ= 0.35), and by probability entropy for segmentation cross entropy (ρ= 0.96).Significance.Overall, test time augmentation demonstrated superior UQ performance and is recommended for use in metastatic lesion segmentation task. It also offers the advantage of being post hoc and computationally efficient. In contrast, probability entropy performed the worst, highlighting the need for advanced UQ approaches for this task.",
    "abstract_zh": "**翻译：**<br><br>**目标。** 深度学习模型正越来越多地应用于自动化医学图像分析，以辅助患者诊疗。然而，大多数模型缺乏不确定性信息，这使得模型输出的可靠性无法得到保证。目前存在多种不确定性量化（UQ）方法来捕捉模型的不确定性。但是，对于给定的任务，哪种方法是最优的尚不清楚。本研究的目的是针对全身PET/CT上的转移性病灶分割这一关键但研究不足的任务，调查几种常用的UQ方法。<br><br>**方法。** 本研究使用了59例接受转移性神经内分泌肿瘤放射性核素治疗的患者的全身68Ga-DOTATATE PET/CT图像。采用3D U-Net进行病灶分割，并进行五折交叉验证。研究了四种UQ方法（概率熵、蒙特卡洛dropout、深度集成和测试时增强）所导出的不确定性度量。对每种不确定性度量进行了四项定量评估：（1）其检测人工降质图像数据的能力，分为低、中、高三个降质程度；（2）检测假阳性（FP）预测区域的能力；（3）恢复假阴性（FN）预测区域的能力；（4）建立与模型生物标志物提取和分割性能指标的相关性。<br><br>**主要结果。** 在低（AUC = 0.54 vs. 0.68）、中（AUC = 0.70 vs. 0.82）和高（AUC = 0.83 vs. 0.90）降质程度下，测试时增强和概率熵分别实现了最高和最低的降质图像检测性能。在检测FP方面，所有UQ方法都表现出良好的性能，AUC值窄幅分布在0.77到0.81之间。测试时增强的FN区域恢复性能最强，而概率熵最弱。相关性分析的结果喜忧参半，其中测试时增强在SUVtotalcapture（ρ= 0.57）和分割Dice系数（ρ= 0.72）方面表现最佳，蒙特卡洛dropout在SUVmeancapture（ρ= 0.35）方面表现最佳，而概率熵在分割交叉熵（ρ= 0.96）方面表现最佳。<br><br>**意义。** 总体而言，测试时增强表现出优异的UQ性能，推荐用于转移性病灶分割任务。它还具有后验性和计算效率高的优势。相比之下，概率熵表现最差，凸显了该任务对高级UQ方法的需求。",
    "summary_zh": "该研究评估了四种不确定性量化(UQ)方法在全身PET/CT图像转移性病灶分割任务中的表现，包括概率熵、蒙特卡洛dropout、深度集成和测试时增强。通过检测降质图像、假阳性和假阴性区域以及与生物标志物和分割性能的相关性，发现测试时增强总体表现最佳，概率熵表现最差。研究推荐使用测试时增强进行转移性病灶分割，并强调了该任务对高级UQ方法的需求。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/add9df",
    "link": "https://doi.org/10.1088/1361-6560/add9df"
  },
  {
    "title": "Predicting and monitoring response to head and neck cancer radiotherapy using multimodality imaging and radiobiological digital twin simulations.",
    "authors": [
      "Eric Aliotta",
      "Jeho Jeong",
      "Ramesh Paudyal",
      "Milan Grkovski",
      "Bill Diplas",
      "James Han",
      "Vaios Hatzoglou",
      "Michalis Aristophanous",
      "Nadeem Riaz",
      "Heiko Schöder",
      "Nancy Y Lee",
      "Amita Shukla-Dave",
      "Joseph O Deasy"
    ],
    "abstract": "Objective.To predict radiotherapy treatment response for head and neck cancer (HNC) using multimodality imaging and personalized radiobiological modeling.Approach.A mechanistic radiobiological model was combined with multi-modality imaging data from diffusion weighted-magnetic resonance imaging and positron emission tomography scans with [18F]Fluorodeoxyglucose (FDG) and [18F]Fluoromisonidazole (FMISO) tracers to develop personalized treatment response models for human papilloma virus associated HNC patients undergoing chemo-radiotherapy. Models were initialized to incorporate patient-specific imaging and updated to reflect longitudinal measurements of nodal gross tumor volume throughout treatment. Prediction accuracy was assessed based on mean absolute error (MAE) of weekly volume predictions and in predicting locoregional recurrence (LRR) following treatment.Main results.Personalized modeling based on pretreatment imaging significantly improved longitudinal volume prediction accuracy and correlation with measurement compared with a generic population model (MAE = 23.4 ± 10.0% vs 24.9 ± 9.0%,p= 0.002 on pairedt-test,R= 0.82 vs 0.72). Adding volume measurements from weeks 1 and 2 further improved prediction accuracy for subsequent weeks (MAE = 12.5 ± 8.1%, 10.7 ± 9.9%). When incorporating feedback with longitudinal measurements, penalizing large deviations from pretreatment model parameters using a variational regularization method was necessary to maintain model stability. Model-predicted volumes based on baseline + week-1 information significantly improved LRR prediction compared with week-1 volume data alone (area under the curve, AUC = 0.83 vs 0.77,p= 0.03) and was similar to prediction using week-3 volume data (AUC = 0.83 vs 0.85,p= non-significant).Significance.The proposed approach, which integrates clinical imaging and radiobiological principles, could be a basis to guide pretreatment prescription personalization as well as on-treatment adaptations.",
    "abstract_zh": "以下是翻译和总结：<br><br>**翻译：**<br><br>**目的：** 旨在利用多模态影像和个性化放射生物学建模预测头颈癌（HNC）的放射治疗反应。<br><br>**方法：** 将机械性的放射生物学模型与来自弥散加权磁共振成像和正电子发射断层扫描（PET）的多模态影像数据相结合，PET扫描使用[<sup>18</sup>F]氟代脱氧葡萄糖（FDG）和[<sup>18</sup>F]氟米索硝唑（FMISO）示踪剂，从而为接受同步放化疗的人乳头瘤病毒相关HNC患者开发个性化的治疗反应模型。模型初始化时纳入患者特异性的影像数据，并在整个治疗过程中更新，以反映淋巴结肉眼肿瘤体积的纵向测量结果。预测准确性基于每周体积预测的平均绝对误差（MAE）以及治疗后局部区域复发（LRR）的预测进行评估。<br><br>**主要结果：** 基于治疗前影像的个性化建模显著提高了纵向体积预测的准确性和与测量的相关性，优于通用人群模型（MAE = 23.4 ± 10.0% vs 24.9 ± 9.0%，配对t检验，p= 0.002，R= 0.82 vs 0.72）。 添加第1周和第2周的体积测量数据进一步提高了后续几周的预测准确性（MAE = 12.5 ± 8.1%，10.7 ± 9.9%）。 在整合包含纵向测量数据的反馈时，为了保持模型稳定性，必须使用变分正则化方法来惩罚与治疗前模型参数的较大偏差。 基于基线 + 第1周信息的模型预测体积显著提高了LRR预测的准确性，优于单独使用第1周体积数据进行预测（曲线下面积，AUC = 0.83 vs 0.77，p= 0.03），并且与使用第3周体积数据进行预测的结果相似（AUC = 0.83 vs 0.85，p= 无显著性）。<br><br>**意义：** 所提出的方法整合了临床影像和放射生物学原理，可以为指导治疗前的处方个性化以及治疗期间的方案调整提供基础。",
    "summary_zh": "本研究通过整合多模态影像数据和放射生物学模型，开发了一种个性化的HNC放疗反应预测模型。该模型利用患者特异性影像数据初始化，并根据治疗期间的肿瘤体积变化进行更新。结果表明，相比于通用模型，个性化模型能更准确地预测肿瘤体积变化和局部区域复发，且早期治疗反馈的加入能进一步提升预测精度。该方法有望用于指导HNC患者的个体化放疗方案制定和治疗过程中的方案调整。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/add9de",
    "link": "https://doi.org/10.1088/1361-6560/add9de"
  },
  {
    "title": "Whole-body CT-to-PET synthesis using a customized transformer-enhanced GAN.",
    "authors": [
      "Bangyan Xu",
      "Ziwei Nie",
      "Jian He",
      "Aimei Li",
      "Ting Wu"
    ],
    "abstract": "Background. Positron emission tomography with 2-deoxy-2-[fluorine-18]fluoro-D-glucose integrated with computed tomography (18F-FDG PET-CT) is a multi-modality medical imaging technique widely used for screening and diagnosis of lesions and tumors, in which, CT can provide detailed anatomical structures, while PET can show metabolic activities. Nevertheless, it has disadvantages such as long scanning time, high cost, and relatively high radiation doses.Purpose. We propose a deep learning model for the whole-body CT-to-PET synthesis task, generating high-quality synthetic PET images that are comparable to real ones in both clinical relevance and diagnostic value.Material. We collect 102 pairs of 3D CT and PET scans, which are sliced into 27 240 pairs of 2D CT and PET images (training: 21,855 pairs, validation: 2810 pairs, testing: 2575 pairs).Methods. We propose a transformer-enhanced generative adversarial network (GAN) for whole-body CT-to-PET synthesis task. The CPGAN model uses residual blocks and fully connected transformer residual blocks to capture both local features and global contextual information. A customized loss function incorporating structural consistency is designed to improve the quality of synthesized PET images.Results. Both quantitative and qualitative evaluation results demonstrate effectiveness of the CPGAN model. The mean and standard variance of NRMSE, PSNR and SSIM values on test set are(16.90±12.27)×10-4,28.71±2.67and0.926±0.033, respectively, outperforming other seven state-of-the-art models. Three radiologists independently and blindly evaluated and gave subjective scores to 100 randomly chosen PET images (50 real and 50 synthetic). By Wilcoxon signed rank test, there are no statistical differences between the synthetic PET images and the real ones.Conclusions. Despite the inherent limitations of CT images to directly reflect biological information of metabolic tissues, CPGAN model effectively synthesizes satisfying PET images from CT scans, which has potential in reducing the reliance on actual PET-CT scans.",
    "abstract_zh": "**翻译：**<br><br>**背景：** 氟代脱氧葡萄糖正电子发射断层扫描/计算机断层扫描（<sup>18</sup>F-FDG PET-CT）是一种多模态医学成像技术，广泛应用于病灶和肿瘤的筛查和诊断。其中，CT可以提供详细的解剖结构，而PET可以显示代谢活动。然而，该技术存在扫描时间长、成本高、辐射剂量相对较高等缺点。<br><br>**目的：** 我们提出了一种基于深度学习的全身体CT到PET合成模型，旨在生成高质量的合成PET图像，使其在临床相关性和诊断价值方面与真实图像相媲美。<br><br>**材料：** 我们收集了102对3D CT和PET扫描图像，将其切片为27240对2D CT和PET图像（训练集：21855对，验证集：2810对，测试集：2575对）。<br><br>**方法：** 我们提出了一种用于全身体CT到PET合成任务的Transformer增强生成对抗网络（GAN），即CPGAN模型。该模型利用残差块和全连接Transformer残差块来捕获局部特征和全局上下文信息。设计了一种结合结构一致性的定制损失函数，以提高合成PET图像的质量。<br><br>**结果：** 定量和定性评估结果均表明CPGAN模型的有效性。在测试集上，NRMSE、PSNR和SSIM值的均值和标准差分别为(16.90±12.27)×10<sup>-4</sup>、28.71±2.67和0.926±0.033，优于其他七种最先进的模型。三位放射科医生独立且盲法地评估了100张随机选择的PET图像（50张真实图像和50张合成图像），并给出了主观评分。通过Wilcoxon符号秩检验，合成PET图像和真实图像之间没有统计学差异。<br><br>**结论：** 尽管CT图像在直接反映代谢组织的生物学信息方面存在固有的局限性，但CPGAN模型能够有效地从CT扫描合成令人满意的PET图像，这有可能减少对实际PET-CT扫描的依赖。",
    "summary_zh": "该研究提出了一种基于深度学习的Transformer增强生成对抗网络（CPGAN）模型，用于从CT图像合成高质量的PET图像。实验结果表明，该模型生成的合成PET图像在质量上可与真实PET图像相媲美，具有潜在的临床应用价值，可以减少对实际PET-CT扫描的依赖。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/add8dd",
    "link": "https://doi.org/10.1088/1361-6560/add8dd"
  },
  {
    "title": "Generation of synthetic CT from MRI for MRI-based attenuation correction of brain PET images using radiomics and machine learning.",
    "authors": [
      "Amin Hoseinipourasl",
      "Gholam-Ali Hossein-Zadeh",
      "Peyman Sheikhzadeh",
      "Hossein Arabalibeik",
      "Shaghayegh Karimi Alavijeh",
      "Habib Zaidi",
      "Mohammad Reza Ay"
    ],
    "abstract": "BACKGROUND: Accurate quantitative PET imaging in neurological studies requires proper attenuation correction. MRI-guided attenuation correction in PET/MRI remains challenging owing to the lack of direct relationship between MRI intensities and linear attenuation coefficients.\nPURPOSE: This study aims at generating accurate patient-specific synthetic CT volumes, attenuation maps, and attenuation correction factor (ACF) sinograms with continuous values utilizing a combination of machine learning algorithms, image processing techniques, and voxel-based radiomics feature extraction approaches.\nMETHODS: Brain MR images of ten healthy volunteers were acquired using IR-pointwise encoding time reduction with radial acquisition (IR-PETRA) and VIBE-Dixon techniques. synthetic CT (SCT) images, attenuation maps, and attenuation correction factors (ACFs) were generated using the LightGBM, a fast and accurate machine learning algorithm, from the radiomics-based and image processing-based feature maps of MR images. Additionally, ultra-low-dose CT images of the same volunteers were acquired and served as the standard of reference for evaluation. The SCT images, attenuation maps, and ACF sinograms were assessed using qualitative and quantitative evaluation metrics and compared against their corresponding reference images, attenuation maps, and ACF sinograms.\nRESULTS: The voxel-wise and volume-wise comparison between synthetic and reference CT images yielded an average mean absolute error of 60.75 ± 8.8 HUs, an average structural similarity index of 0.88 ± 0.02, and an average peak signal-to-noise ratio of 32.83 ± 2.74 dB. Additionally, we compared MRI-based attenuation maps and ACF sinograms with their CT-based counterparts, revealing average normalized mean absolute errors of 1.48% and 1.33%, respectively.\nCONCLUSION: Quantitative assessments indicated higher correlations and similarities between LightGBM-synthesized CT and Reference CT images. Moreover, the cross-validation results showed the possibility of producing accurate SCT images, MRI-based attenuation maps, and ACF sinograms. This might spur the implementation of MRI-based attenuation correction on PET/MRI and dedicated brain PET scanners with lower computational time using CPU-based processors.",
    "abstract_zh": "**翻译：**<br><br>背景：在神经系统研究中，准确的定量PET成像需要适当的衰减校正。由于MRI信号强度与线性衰减系数之间缺乏直接关系，PET/MRI中的MRI引导衰减校正仍然具有挑战性。<br><br>目的：本研究旨在利用机器学习算法、图像处理技术和基于体素的放射组学特征提取方法的组合，生成准确的、患者特异性的连续值合成CT（SCT）图像、衰减图和衰减校正因子（ACF）正弦图。<br><br>方法：使用IR-点编码时间缩减与径向采集（IR-PETRA）和VIBE-Dixon技术，采集了十名健康志愿者的脑部MR图像。利用快速且准确的机器学习算法LightGBM，从MR图像的基于放射组学和基于图像处理的特征图中，生成合成CT图像、衰减图和衰减校正因子（ACFs）。此外，还采集了相同志愿者的超低剂量CT图像，作为评估的参考标准。使用定性和定量评估指标对SCT图像、衰减图和ACF正弦图进行评估，并将其与相应的参考图像、衰减图和ACF正弦图进行比较。<br><br>结果：合成CT图像和参考CT图像之间的体素级别和体积级别的比较显示，平均绝对误差为60.75 ± 8.8 HU，平均结构相似性指数为0.88 ± 0.02，平均峰值信噪比为32.83 ± 2.74 dB。此外，我们将基于MRI的衰减图和ACF正弦图与基于CT的对应物进行了比较，显示平均归一化平均绝对误差分别为1.48%和1.33%。<br><br>结论：定量评估表明，LightGBM合成的CT图像与参考CT图像之间具有更高的相关性和相似性。此外，交叉验证结果表明可以生成准确的SCT图像、基于MRI的衰减图和ACF正弦图。这可能会推动在PET/MRI和专用脑PET扫描仪上实施基于MRI的衰减校正，并使用基于CPU的处理器缩短计算时间。",
    "summary_zh": "本研究利用LightGBM机器学习算法，结合放射组学和图像处理技术，从MRI图像中生成合成CT（SCT）图像、衰减图和衰减校正因子（ACF）正弦图，用于PET/MRI的衰减校正。结果表明，该方法生成的SCT图像与参考CT图像具有较高的相似性和相关性，可以有效提高PET/MRI成像的准确性，并有望降低计算成本。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17867",
    "link": "https://doi.org/10.1002/mp.17867"
  },
  {
    "title": "Impact of tracer uptake rate on quantification accuracy of myocardial blood flow in PET: A simulation study.",
    "authors": [
      "Xiaotong Hong",
      "Amirhossein Sanaat",
      "Yazdan Salimi",
      "René Nkoulou",
      "Hossein Arabi",
      "Lijun Lu",
      "Habib Zaidi"
    ],
    "abstract": "BACKGROUND: Cardiac perfusion PET is commonly used to assess ischemia and cardiovascular risk, which enables quantitative measurements of myocardial blood flow (MBF) through kinetic modeling. However, the estimation of kinetic parameters is challenging due to the noisy nature of short dynamic frames and limited sample data points.\nPURPOSE: This work aimed to investigate the errors in MBF estimation in PET through a simulation study and to evaluate different parameter estimation approaches, including a deep learning (DL) method.\nMATERIALS AND METHODS: Simulated studies were generated using digital phantoms based on cardiac segmentations from 55 clinical CT images. We employed the irreversible 2-tissue compartmental model and simulated dynamic 13N-ammonia PET scans under both rest and stress conditions (220 cases each). The simulations covered a rest K1 range of 0.6 to 1.2 and a stress K1 range of 1.2 to 3.6 (unit: mL/min/g) in the myocardium. A transformer-based DL model was trained on the simulated dataset to predict parametric images (PIMs) from noisy PET image frames and was validated using 5-fold cross-validation. We compared the DL method with the voxel-wise nonlinear least squares (NLS) fitting applied to the dynamic images, using either Gaussian filter (GF) smoothing (GF-NLS) or a dynamic nonlocal means (DNLM) algorithm for denoising (DNLM-NLS). Two patients with coronary CT angiography (CTA) and fractional flow reserve (FFR) were enrolled to test the feasibility of applying DL models on clinical PET data.\nRESULTS: The DL method showed clearer image structures with reduced noise compared to the traditional NLS-based methods. In terms of mean absolute relative error (MARE), as the rest K1 values increased from 0.6 to 1.2 mL/min/g, the overall bias in myocardium K1 estimates decreased from approximately 58% to 45% for the NLS-based methods while the DL method showed a reduction in MARE from 42% to 18%. For stress data, as the stress K1 decreased from 3.6 to 1.2 mL/min/g, the MARE increased from 30% to 70% for the GF-NLS method. In contrast, both the DNLM-NLS (average: 42%) and the DL methods (average: 20%) demonstrated significantly smaller MARE changes as stress K1 varied. Regarding the regional mean bias (±standard deviation), the GF-NLS method had a bias of 6.30% (±8.35%) of rest K1, compared to 1.10% (±8.21%) for DNLM-NLS and 6.28% (±14.05%) for the DL method. For the stress K1, the GF-NLS showed a mean bias of 10.72% (±9.34%) compared to 1.69% (±8.82%) for DNLM-NLS and -10.55% (±9.81%) for the DL method.\nSIGNIFICANCE: This study showed that an increase in the tracer uptake rate (K1) corresponded to improved accuracy and precision in MBF quantification, whereas lower tracer uptake resulted in higher noise in dynamic PET and poorer parameter estimates. Utilizing denoising techniques or DL approaches can mitigate noise-induced bias in PET parametric imaging.",
    "abstract_zh": "背景：心脏灌注PET常用于评估缺血和心血管风险，它可以通过动力学建模对心肌血流量（MBF）进行定量测量。然而，由于短动态帧的噪声特性以及有限的样本数据点，动力学参数的估计具有挑战性。<br><br>目的：本研究旨在通过模拟研究调查PET中MBF估计的误差，并评估不同的参数估计方法，包括深度学习（DL）方法。<br><br>材料与方法：基于55例临床CT图像的心脏分割结果，使用数字体模生成模拟研究数据。我们采用了不可逆的二室模型，并在静息和负荷条件下（每种条件220例）模拟了动态13N-氨PET扫描。模拟涵盖了静息状态下0.6至1.2，负荷状态下1.2至3.6的心肌K1范围（单位：mL/min/g）。使用基于Transformer的深度学习模型在模拟数据集上进行训练，以从含噪声的PET图像帧中预测参数图像（PIM），并使用5倍交叉验证进行验证。我们将深度学习方法与应用于动态图像的逐体素非线性最小二乘法（NLS）拟合进行比较，NLS拟合分别使用高斯滤波器（GF）平滑（GF-NLS）或动态非局部均值（DNLM）算法进行去噪（DNLM-NLS）。招募了两名接受冠状动脉CT血管造影（CTA）和血流储备分数（FFR）检查的患者，以测试将深度学习模型应用于临床PET数据的可行性。<br><br>结果：与传统的基于NLS的方法相比，深度学习方法显示出更清晰的图像结构和更低的噪声。在平均绝对相对误差（MARE）方面，随着静息K1值从0.6增加到1.2 mL/min/g，基于NLS的方法的心肌K1估计的总体偏差从大约58%降低到45%，而深度学习方法显示MARE从42%降低到18%。对于负荷数据，随着负荷K1从3.6降低到1.2 mL/min/g，GF-NLS方法的MARE从30%增加到70%。相比之下，DNLM-NLS（平均：42%）和深度学习方法（平均：20%）均显示出MARE随负荷K1变化而产生的变化显著更小。关于区域平均偏差（±标准差），GF-NLS方法的静息K1偏差为6.30% (±8.35%)，DNLM-NLS方法为1.10% (±8.21%)，深度学习方法为6.28% (±14.05%)。对于负荷K1，GF-NLS方法的平均偏差为10.72% (±9.34%)，DNLM-NLS方法为1.69% (±8.82%)，深度学习方法为-10.55% (±9.81%)。<br><br>意义：本研究表明，示踪剂摄取率（K1）的增加对应于MBF量化中准确性和精度的提高，而较低的示踪剂摄取导致动态PET中更高的噪声和较差的参数估计。利用去噪技术或深度学习方法可以减轻PET参数成像中噪声引起的偏差。",
    "summary_zh": "本研究通过模拟数据和临床数据评估了深度学习方法在PET心肌血流量（MBF）估计中的性能。结果表明，深度学习方法在噪声环境下表现出比传统NLS方法更好的精度和图像质量，尤其是在示踪剂摄取率较低的情况下。研究强调了去噪技术和深度学习方法在提高PET参数成像准确性的重要性。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17871",
    "link": "https://doi.org/10.1002/mp.17871"
  },
  {
    "title": "Exploiting network optimization stability for enhanced PET image denoising using deep image prior.",
    "authors": [
      "Fumio Hashimoto",
      "Kibo Ote",
      "Yuya Onishi",
      "Hideaki Tashima",
      "Go Akamatsu",
      "Yuma Iwao",
      "Miwako Takahashi",
      "Taiga Yamaya"
    ],
    "abstract": "Objective. Positron emission tomography (PET) is affected by statistical noise due to constraints on tracer dose and scan duration, impacting both diagnostic performance and quantitative accuracy. While deep learning-based PET denoising methods have been used to improve image quality, they may introduce over-smoothing, which can obscure critical structural details and compromise quantitative accuracy. We propose a method for making a deep learning solution more reliable and apply it to the conditional deep image prior (DIP).Approach. We introduce the idea ofstability informationin the optimization process of conditional DIP, enabling the identification of unstable regions within the network's optimization trajectory. Our method incorporates a stability map, which is derived from multiple intermediate outputs of a moderate neural network at different optimization steps. The final denoised PET image is then obtained by computing a linear combination of the DIP output and the original reconstructed PET image, weighted by the stability map.Main results. We employed eight high-resolution brain PET datasets for comparison. Our method effectively reduces background noise while preserving small structure details in brain [18F]FDG PET images. Comparative analysis demonstrated that our approach outperformed existing methods in terms of peak-to-valley ratio and background noise suppression across various low-dose levels. Additionally, region-of-interest analysis confirmed that the proposed method maintains quantitative accuracy without introducing under- or over-estimation. Furthermore, we applied our method to full-dose PET data to assess its impact on image quality. The results revealed that the proposed method significantly reduced background noise while preserving the peak-to-valley ratio at a level comparable to that of unfiltered full-dose PET images.Significance. The proposed method introduces a robust approach to deep learning-based PET denoising, enhancing its reliability and preserving quantitative accuracy. Furthermore, this strategy can potentially advance performance in high-sensitivity PET scanners and surpass the limit of image quality inherent to PET scanners.",
    "abstract_zh": "**翻译：**<br><br>**目的。** 正电子发射断层扫描（PET）受到统计噪声的影响，这是由于示踪剂剂量和扫描时长的限制所致，从而影响诊断性能和定量准确性。虽然基于深度学习的PET去噪方法已被用于提高图像质量，但它们可能引入过度平滑，这可能会掩盖关键的结构细节并损害定量准确性。我们提出一种使深度学习解决方案更可靠的方法，并将其应用于条件深度图像先验（DIP）。<br><br>**方法。** 我们在条件DIP的优化过程中引入了*稳定性信息*的概念，从而能够识别网络优化轨迹中的不稳定区域。我们的方法整合了一个稳定性图，该图是从中等神经网络在不同优化步骤中的多个中间输出导出的。然后，通过计算DIP输出和原始重建PET图像的线性组合，并以稳定性图作为权重，获得最终的去噪PET图像。<br><br>**主要结果。** 我们使用了八个高分辨率脑部PET数据集进行比较。我们的方法有效地降低了背景噪声，同时保留了脑部[18F]FDG PET图像中的小结构细节。比较分析表明，在各种低剂量水平下，我们的方法在峰谷比和背景噪声抑制方面优于现有方法。此外，感兴趣区域分析证实，所提出的方法在保持定量准确性的同时，不会引入低估或高估。此外，我们将我们的方法应用于全剂量PET数据，以评估其对图像质量的影响。结果表明，所提出的方法显著降低了背景噪声，同时保持峰谷比在与未过滤的全剂量PET图像相当的水平。<br><br>**意义。** 所提出的方法为基于深度学习的PET去噪引入了一种鲁棒的方法，增强了其可靠性并保持了定量准确性。此外，这种策略有可能提高高灵敏度PET扫描仪的性能，并超越PET扫描仪固有的图像质量限制。",
    "summary_zh": "本研究提出了一种基于深度学习的PET图像去噪方法，旨在解决传统深度学习方法可能引入的过度平滑问题，从而提高PET图像的诊断性能和定量准确性。该方法的核心是引入了“稳定性信息”，用于识别网络优化过程中的不稳定区域，并利用稳定性图对深度学习模型的输出和原始图像进行加权融合。实验结果表明，该方法在降低背景噪声、保留结构细节、保持定量准确性等方面均优于现有方法，且在高灵敏度PET扫描仪应用中具有潜力。该方法有望超越PET扫描仪固有的图像质量限制。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/add63f",
    "link": "https://doi.org/10.1088/1361-6560/add63f"
  },
  {
    "title": "Patient CT-based simulation study of secondary-electron-bremsstrahlung imaging for range verification in proton therapy: comparison with prompt gamma and PET imaging for simplified proton pencil beam and SOBP irradiation scenarios.",
    "authors": [
      "Takuya Yabe",
      "Munetaka Nitta",
      "Mitsutaka Yamaguchi",
      "Marco Pinto",
      "Naoki Kawachi",
      "Katia Parodi"
    ],
    "abstract": "Objective.Secondary electron bremsstrahlung (SEB) imaging, along with prompt gamma (PG) and positron emission tomography (PET) imaging, has been proposed as anin vivorange verification tool for proton therapy. This study presents the first simulation based on patient computed tomography (CT) data to investigate the feasibility of SEB imaging for range verification in proton therapy, while comparing the characteristics of SEB imaging with those of PG and PET imaging.Approach.A Monte Carlo simulation was performed using patient CT data for the irradiation of monoenergetic pencil beams and spread-out Bragg peak proton beams. The physical characteristics of SEB imaging were analyzed at three different anatomical sites and compared with those of PG and PET imaging.Main results. In all the treatment cases, SEB imaging exhibited higher production rates than PG and PET imaging, particularly in the regions with high CT values along the beam path. Although the SEB signal was more affected by scattering and absorption than the PET or PG signals, sufficient statistical counts for range verification (∼3 × 10-3SEBs/proton) could potentially be detected outside the patient geometry. For pencil beam cases, the SEB and PET fall-offs were located 4-5 mm proximal to the dose fall-off, while the PG fall-off was located 0-1 mm distal to it.Significance.Results suggest that SEB imaging has the potential to offer a real-time range verification tool (by comparing measured and expected images), particularly for treating shallow-seated tumors using proton pencil-beam scanning delivery. Thus, this study represents a significant step towards the clinical application of range verification based on SEB imaging and promotes future efforts in this direction.",
    "abstract_zh": "**翻译：**<br><br>**目的。** 二次电子轫致辐射（SEB）成像，与瞬发伽马射线（PG）和正电子发射断层扫描（PET）成像一样，已被提议作为质子治疗中体内射程验证工具。本研究基于患者计算机断层扫描（CT）数据进行了首次模拟，以研究SEB成像在质子治疗中进行射程验证的可行性，同时比较了SEB成像与PG和PET成像的特性。<br><br>**方法。** 使用患者CT数据，对单能笔形束和扩展布拉格峰质子束的照射进行了蒙特卡罗模拟。在三个不同的解剖部位分析了SEB成像的物理特性，并将其与PG和PET成像的物理特性进行了比较。<br><br>**主要结果。** 在所有治疗病例中，SEB成像都表现出比PG和PET成像更高的产生率，特别是在沿束径CT值较高的区域。尽管SEB信号比PET或PG信号更容易受到散射和吸收的影响，但仍有可能在患者几何结构外部检测到足够的统计计数来进行射程验证（∼3 × 10-3 SEBs/质子）。对于笔形束病例，SEB和PET衰减位于剂量衰减近端4-5毫米处，而PG衰减位于剂量衰减远端0-1毫米处。<br><br>**意义。** 结果表明，SEB成像具有提供实时射程验证工具的潜力（通过比较测量图像和预期图像），特别是对于使用质子笔形束扫描进行浅表肿瘤治疗。因此，本研究代表了基于SEB成像的射程验证临床应用的重要一步，并促进了未来在该方向上的努力。",
    "summary_zh": "本研究通过蒙特卡罗模拟评估了二次电子轫致辐射(SEB)成像作为质子治疗中射程验证工具的可行性，并将其与瞬发伽马射线(PG)和正电子发射断层扫描(PET)成像进行了比较。结果表明，SEB成像具有更高的信号产生率，尤其是在高CT值区域，尽管其信号易受散射和吸收影响。SEB成像在笔形束照射下，其信号衰减位置接近剂量衰减，具有实时射程验证的潜力，尤其适用于浅表肿瘤的治疗。该研究为SEB成像的临床应用提供了重要依据。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/add4b7",
    "link": "https://doi.org/10.1088/1361-6560/add4b7"
  },
  {
    "title": "Instantaneous in vivo distal edge verification in intensity-modulated proton therapy by means of PET imaging.",
    "authors": [
      "Brian Zapien-Campos",
      "Zahra Ahmadi Ganjeh",
      "Giuliano Perotti-Bernardini",
      "Jeffrey Free",
      "Stefan Both",
      "Peter Dendooven"
    ],
    "abstract": "BACKGROUND: Intensity-modulated proton therapy (IMPT) holds promise for improving outcomes in head-and-neck cancer (HNC) patients by enhancing organ-at-risk (OAR) sparing. A key challenge in IMPT is ensuring an accurate dose delivery at the distal edge of the tumor, where the steep dose gradients make treatment precision highly sensitive to uncertainties in both proton range and patient setup. Thus, IMPT conformality is increased by incorporating robust margins in the treatment optimization. However, an increment in the plan robustness could lead to an OAR overdosing. Therefore, an accurate distal edge verification during dose delivery is crucial to increase IMPT conformality by reducing optimization settings in treatment planning.\nPURPOSE: This work aims to evaluate, in a quasi-clinical setting, a novel approach for accurate instantaneous proton beam distal edge verification in IMPT by means of spot-by-spot positron emission tomography (PET) imaging.\nMETHODS: An anthropomorphic head and neck phantom CIRS-731 HN was irradiated at the head and neck region. The targets were defined as 4 cm diameter spheres. A 60-ms delay was introduced between the proton beam spots in order to enable the spot-by-spot coincidence detection of the 511-keV photons resulting from positron annihilation following the positron emission from very short-lived positron-emitting, mainly 12N (T1/2  = 11.0 ms). Additionally, modified irradiations were carried out using solid water slabs of 2 and 5 mm thickness in the beam path to assess the precision of the approach for detecting range deviations. The positron activity range (PAR) was determined from the 50% distal fall-off position of the 1D longitudinal positron activity profile derived from the 2D image reconstructions. Furthermore, Monte Carlo (MC) simulations were performed using an in-house RayStation/GATE MC framework to predict the positron activity images and verify the PAR measurements.\nRESULTS: PAR measurements achieved a precision between 1.5 and 3.6 mm (at 1.5σ clinical level) at the beam spot level within sub-second time scales. Measured PAR shifts of 1.6-2.1  and 4.2--.7 mm were observed with the 2- and 5-mm thickness range shifters, respectively, aligning with the corresponding proton dose range (PDR) shifts of 1.3-1.8 and 3.9-4.3 mm. The simulated PAR agrees with the measured PARs, showing an average range difference of ∼0.4 mm.\nCONCLUSION: This study demonstrated the feasibility of instantaneous distal edge verification using PET imaging by introducing beam spot delays during dose delivery. The findings represent a first step toward the clinical implementation of instantaneous in vivo distal edge verification. The approach contributes to the development of real-time range verification aimed at improving IMPT treatments by mitigating range and setup uncertainties, thereby reducing dose to organs-at-risk and ultimately enhancing patient outcomes.",
    "abstract_zh": "**翻译：**<br><br>背景：调强质子治疗（IMPT）有望通过增强危及器官（OAR）的保护来改善头颈癌（HNC）患者的治疗效果。IMPT 的一个关键挑战是确保肿瘤远端边缘的剂量精确递送，因为陡峭的剂量梯度使得治疗精度对质子射程和患者摆位的不确定性高度敏感。因此，IMPT 的适形性通过在治疗优化中纳入稳健的边缘来提高。然而，计划稳健性的增加可能导致 OAR 过剂量。因此，在剂量递送期间进行准确的远端边缘验证对于通过减少治疗计划中的优化设置来提高 IMPT 的适形性至关重要。<br><br>目的：本研究旨在在准临床环境中评估一种新型方法，该方法通过逐点正电子发射断层扫描（PET）成像，实现 IMPT 中精确的瞬时质子束远端边缘验证。<br><br>方法：在头颈部区域照射了一个人头颈部模型 CIRS-731 HN。靶区定义为直径 4 厘米的球体。质子束点之间引入 60 毫秒的延迟，以实现对正电子湮灭产生的 511-keV 光子的逐点符合检测，这些光子是由于极短寿命的正电子发射体（主要是 12N (T1/2 = 11.0 毫秒)）发射正电子后产生的。此外，使用 2 毫米和 5 毫米厚的固体水板在光束路径中进行修改后的照射，以评估该方法检测射程偏差的精度。正电子活度射程（PAR）由二维图像重建得到的 1D 纵向正电子活度分布的 50% 远端下降位置确定。此外，使用内部 RayStation/GATE MC 框架进行蒙特卡罗（MC）模拟，以预测正电子活度图像并验证 PAR 测量结果。<br><br>结果：PAR 测量在亚秒级时间尺度内，在光束点水平上实现了 1.5 到 3.6 毫米的精度（在 1.5σ 临床水平）。使用 2 毫米和 5 毫米厚的射程移位器观察到 1.6-2.1 和 4.2-4.7 毫米的 PAR 偏移，与相应的 1.3-1.8 和 3.9-4.3 毫米的质子剂量射程（PDR）偏移一致。模拟的 PAR 与测量的 PAR 一致，显示平均射程差异约为 0.4 毫米。<br><br>结论：本研究证明了通过在剂量递送期间引入光束点延迟，使用 PET 成像进行瞬时远端边缘验证的可行性。这些发现代表了瞬时体内远端边缘验证临床实施的第一步。该方法有助于开发实时射程验证，旨在通过减轻射程和摆位不确定性来改善 IMPT 治疗，从而减少危及器官的剂量并最终改善患者的治疗效果。",
    "summary_zh": "该研究旨在验证利用PET成像技术进行调强质子治疗(IMPT)中质子束远端边缘的瞬时验证方法。通过在头颈部模型中进行实验，并辅以蒙特卡罗模拟，结果表明该方法能够以亚秒级的时间尺度，以较高的精度检测质子射程的变化。该研究为IMPT治疗中实时射程验证的临床应用奠定了基础，有望降低危及器官的剂量，提高治疗效果。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17850",
    "link": "https://doi.org/10.1002/mp.17850"
  },
  {
    "title": "Modeling inter-reader variability in clinical target volume delineation for soft tissue sarcomas using diffusion model.",
    "authors": [
      "Yafei Dong",
      "Thibault Marin",
      "Yue Zhuo",
      "Elie Najem",
      "Arnaud Beddok",
      "Laura Rozenblum",
      "Maryam Moteabbed",
      "Kira Grogg",
      "Fangxu Xing",
      "Jonghye Woo",
      "Yen-Lin E Chen",
      "Ruth Lim",
      "Xiaofeng Liu",
      "Chao Ma",
      "Georges El Fakhri"
    ],
    "abstract": "BACKGROUND: Accurate delineation of the clinical target volume (CTV) is essential in the radiotherapy treatment of soft tissue sarcomas. However, this process is subject to inter-reader variability due to the need for clinical assessment of risk and extent of potential microscopic spread. This can lead to inconsistencies in treatment planning, potentially impacting treatment outcomes. Most existing automatic CTV delineation methods do not account for this variability and can only generate a single CTV for each case.\nPURPOSE: This study aims to develop a deep learning-based technique to generate multiple CTV contours for each case, simulating the inter-reader variability in the clinical practice.\nMETHODS: We employed a publicly available dataset consisting of fluorodeoxyglucose positron emission tomography (FDG-PET), x-ray computed tomography (CT), and pre-contrast T1-weighted magnetic resonance imaging (MRI) scans from 51 patients with soft tissue sarcoma, along with an independent validation set containing five additional patients. An experienced reader drew a contour of the gross tumor volume (GTV) for each patient based on multi-modality images. Subsequently, two additional readers, together with the first one, were responsible for contouring three CTVs in total based on the GTV. We developed a diffusion model-based deep learning method that is capable of generating arbitrary number of different and plausible CTVs to mimic the inter-reader variability in CTV delineation. The proposed model incorporates a separate encoder to extract features from the GTV masks, leveraging the critical role of GTV information in accurate CTV delineation.\nRESULTS: The proposed diffusion model demonstrated superior performance with the highest Dice Index (0.902 compared to values below 0.881 for state-of-the-art models) and the best generalized energy distance (GED) (0.209 compared to values exceeding 0.221 for state-of-the-art models). It also achieved the second-highest recall and precision metrics among the compared ambiguous image segmentation models. Results from both datasets exhibited consistent trends, reinforcing the reliability of our findings. Additionally, ablation studies exploring different model structures and input configurations highlighted the significance of incorporating prior GTV information for accurate CTV delineation.\nCONCLUSIONS: The proposed diffusion model successfully generates multiple plausible CTV contours for soft tissue sarcomas, effectively capturing inter-reader variability in CTV delineation.",
    "abstract_zh": "**翻译：**<br><br>背景：在软组织肉瘤的放射治疗中，准确勾画临床靶区（CTV）至关重要。然而，由于需要对潜在微观扩散的风险和范围进行临床评估，这一过程容易受到读者间变异性的影响。这可能导致治疗计划的不一致，从而潜在地影响治疗效果。大多数现有的自动CTV勾画方法没有考虑到这种变异性，并且只能为每个病例生成单个CTV。<br><br>目的：本研究旨在开发一种基于深度学习的技术，为每个病例生成多个CTV轮廓，模拟临床实践中读者间的变异性。<br><br>方法：我们采用了包含51例软组织肉瘤患者的氟代脱氧葡萄糖正电子发射断层扫描（FDG-PET）、X射线计算机断层扫描（CT）和预对比T1加权磁共振成像（MRI）扫描的公开数据集，以及包含5例额外患者的独立验证集。一位经验丰富的医生基于多模态图像为每位患者绘制了肉眼肿瘤体积（GTV）的轮廓。随后，另外两位医生与第一位医生一起负责基于GTV勾画总共三个CTV。我们开发了一种基于扩散模型的深度学习方法，该方法能够生成任意数量的不同且合理的CTV，以模拟CTV勾画中读者间的变异性。所提出的模型包含一个单独的编码器来提取GTV掩模的特征，从而利用GTV信息在准确CTV勾画中的关键作用。<br><br>结果：所提出的扩散模型表现出优越的性能，具有最高的Dice指数（0.902，而最先进模型的Dice指数低于0.881）和最佳的广义能量距离（GED）（0.209，而最先进模型的GED超过0.221）。在所比较的模糊图像分割模型中，它还实现了第二高的召回率和精确率指标。来自两个数据集的结果均表现出一致的趋势，增强了我们研究结果的可靠性。此外，探索不同模型结构和输入配置的消融研究突出了结合先验GTV信息对于准确CTV勾画的重要性。<br><br>结论：所提出的扩散模型成功地为软组织肉瘤生成了多个合理的CTV轮廓，有效地捕捉了CTV勾画中读者间的变异性。",
    "summary_zh": "该研究开发了一种基于扩散模型的深度学习方法，用于自动生成多个临床靶区（CTV）轮廓，以模拟软组织肉瘤放射治疗计划中医生之间的勾画差异。该模型利用PET、CT和MRI等多模态影像信息，并特别强调了肉眼肿瘤体积（GTV）信息的重要性。实验结果表明，该方法在Dice指数和广义能量距离等指标上优于现有方法，能够更准确地捕捉医生间的变异性，具有重要的临床应用潜力。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17865",
    "link": "https://doi.org/10.1002/mp.17865"
  },
  {
    "title": "Thorax-encompassing multi-modality PET/CT deep learning model for resected lung cancer prognostication: A retrospective, multicenter study.",
    "authors": [
      "Jaryd R Christie",
      "Perrin Romine",
      "Karen Eddy",
      "Delphine L Chen",
      "Omar Daher",
      "Mohamed Abdelrazek",
      "Richard A Malthaner",
      "Mehdi Qiabi",
      "Rahul Nayak",
      "Paul Kinahan",
      "Viswam S Nair",
      "Sarah A Mattonen"
    ],
    "abstract": "BACKGROUND: Patients with early-stage non-small cell lung cancer (NSCLC) typically receive surgery as their primary form of treatment. However, studies have shown that a high proportion of these patients will experience a recurrence after their resection, leading to an increased risk of death. Cancer staging is currently the gold standard for establishing a patient's prognosis and can help clinicians determine patients who may benefit from additional therapy. However, medical images which are used to help determine the cancer stage, have been shown to hold unutilized prognostic information that can augment clinical data and better identify high-risk NSCLC patients. There remains an unmet need for models to incorporate clinical, pathological, surgical, and imaging information, and extend beyond the current staging system to assist clinicians in identifying patients who could benefit from additional therapy immediately after surgery.\nPURPOSE: We aimed to determine whether a deep learning model (DLM) integrating FDG PET and CT imaging from the thoracic cavity along with clinical, surgical, and pathological information can predict NSCLC recurrence-free survival (RFS) and stratify patients into risk groups better than conventional staging.\nMATERIALS AND METHODS: Surgically resected NSCLC patients enrolled between 2009 and 2018 were retrospectively analyzed from two academic institutions (local institution: 305 patients; external validation: 195 patients). The thoracic cavity (including the lungs, mediastinum, pleural interfaces, and thoracic vertebrae) was delineated on the preoperative FDG PET and CT images and combined with each patient's clinical, surgical, and pathological information. Using the local cohort of patients, a multi-modal DLM using these features was built in a training cohort (n = 225), tuned on a validation cohort (n = 45), and evaluated on testing (n = 35) and external validation (n = 195) cohorts to predict RFS and stratify patients into risk groups. The area under the curve (AUC), Kaplan-Meier curves, and log-rank test were used to assess the prognostic value of the model. The DLM's stratification performance was compared to the conventional staging stratification.\nRESULTS: The multi-modal DLM incorporating imaging, pathological, surgical, and clinical data predicted RFS in the testing cohort (AUC = 0.78 [95% CI:0.63-0.94]) and external validation cohort (AUC = 0.66 [95% CI:0.58-0.73]). The DLM significantly stratified patients into high, medium, and low-risk groups of RFS in both the testing and external validation cohorts (multivariable log-rank p < 0.001) and outperformed conventional staging. Conventional staging was unable to stratify patients into three distinct risk groups of RFS (testing: p = 0.94; external validation: p = 0.38). Lastly, the DLM displayed the ability to further stratify patients significantly into sub-risk groups within each stage in the testing (stage I: p = 0.02, stage II: p = 0.03) and external validation (stage I: p = 0.05, stage II: p = 0.03) cohorts.\nCONCLUSION: This is the first study to use multi-modality imaging along with clinical, surgical, and pathological data to predict RFS of NSCLC patients after surgery. The multi-modal DLM better stratified patients into risk groups of poor outcomes when compared to conventional staging and further stratified patients within each staging classification. This model has the potential to assist clinicians in better identifying patients that may benefit from additional therapy.",
    "abstract_zh": "**翻译：**<br><br>**背景：** 早期非小细胞肺癌（NSCLC）患者通常接受手术作为主要治疗方式。然而，研究表明，相当比例的患者在手术切除后会出现复发，导致死亡风险增加。肿瘤分期是目前评估患者预后的金标准，可以帮助临床医生确定可能从额外治疗中获益的患者。然而，用于辅助确定肿瘤分期的医学影像已被证明蕴含着未被充分利用的预后信息，这些信息可以增强临床数据，从而更好地识别高风险NSCLC患者。目前仍然迫切需要一种模型，能够整合临床、病理、手术和影像信息，并超越现有的分期系统，以协助临床医生识别术后立即可能从额外治疗中获益的患者。<br><br>**目的：** 我们的目的是确定深度学习模型（DLM）整合胸腔的FDG PET和CT影像，以及临床、手术和病理信息，是否能够比传统分期更好地预测NSCLC无复发生存期（RFS）并将患者分为风险组。<br><br>**材料与方法：** 我们回顾性分析了2009年至2018年期间从两所学术机构招募的接受手术切除的NSCLC患者（本地机构：305例患者；外部验证：195例患者）。在术前FDG PET和CT影像上勾画出胸腔（包括肺、纵隔、胸膜界面和胸椎），并结合每位患者的临床、手术和病理信息。使用本地队列的患者，在一个训练队列（n = 225）中构建了一个使用这些特征的多模态DLM，在验证队列（n = 45）中进行调整，并在测试（n = 35）和外部验证（n = 195）队列中进行评估，以预测RFS并将患者分为风险组。使用曲线下面积（AUC）、Kaplan-Meier曲线和log-rank检验来评估该模型的预后价值。将DLM的分层表现与传统分期分层进行比较。<br><br>**结果：** 整合了影像、病理、手术和临床数据的多模态DLM在测试队列（AUC = 0.78 [95% CI: 0.63-0.94]）和外部验证队列（AUC = 0.66 [95% CI: 0.58-0.73]）中预测了RFS。DLM在测试和外部验证队列中均显著地将患者分为RFS的高、中、低风险组（多变量log-rank p < 0.001），并且优于传统分期。传统分期未能将患者分为三个不同的RFS风险组（测试：p = 0.94；外部验证：p = 0.38）。最后，DLM显示出在测试（I期：p = 0.02，II期：p = 0.03）和外部验证（I期：p = 0.05，II期：p = 0.03）队列中进一步将每个分期中的患者显著分层为亚风险组的能力。<br><br>**结论：** 这是首个使用多模态影像以及临床、手术和病理数据来预测NSCLC患者术后RFS的研究。与传统分期相比，该多模态DLM更好地将患者分层为不良预后的风险组，并进一步对每个分期分类中的患者进行分层。该模型有潜力帮助临床医生更好地识别可能从额外治疗中获益的患者。",
    "summary_zh": "该研究旨在开发并验证一个深度学习模型（DLM），该模型整合了FDG PET/CT影像、临床、手术和病理信息，用于预测早期NSCLC患者术后的无复发生存期（RFS）。研究结果表明，与传统的肿瘤分期方法相比，该DLM能够更准确地预测RFS，并将患者更有效地分层到不同的风险组中。该模型具有进一步细化现有分期的潜力，有助于临床医生识别术后可能需要额外治疗的高风险患者。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17862",
    "link": "https://doi.org/10.1002/mp.17862"
  },
  {
    "title": "Evaluation of a motion correction algorithm in lung cancer PET/CT: Phantom validation and patient studies.",
    "authors": [
      "Ziyang Wang",
      "Jianjing Liu",
      "Di Lu",
      "Guoqing Sui",
      "Yaya Wang",
      "Lina Tong",
      "Xueyao Liu",
      "Yan Zhang",
      "Jie Fu",
      "Wengui Xu",
      "Dong Dai"
    ],
    "abstract": "BACKGROUND: Data-driven gating (DDG) is an emerging technology that can reduce the respiratory motion artifacts in positron emission tomography (PET) images.\nPURPOSE: The aim of this study is to use phantom and patient data to validate the performance of DDG with a motion correction algorithm based on the reconstruct, register, and average (RRA) method.\nMETHODS: A customized motion platform drove the phantom (five spheres with diameters of 10-28 mm) using a periodic motion that had a duration of 3-5 s and amplitudes of 2-4 cm. Normalized ratio of ungated and RRA PET relative to the ground-truth static PET was calculated for RSUVmax, RSUVmean, RSUVpeak, RVolume, and relative contrast-to-noise ratio (RCNR). Additionally, 30 lung cancer patients with 76 lung lesions less than 3 cm in diameter were prospectively studied. The overall image quality of patient examination was scored using a 5-point scale by two radiologists. SUVmax, SUVmean, SUVpeak, volume, and CNR of lesions measured in ungated and RRA PET were compared, and subgroup analysis was conducted.\nRESULTS: In RRA PET images, motion artifacts of the spheres in the phantom were effectively mitigated, regardless of changes in movement amplitudes or duration. For all spheres with different ranges of motion and cycles, RSUVmax, RSUVmean, RSUVpeak, and RCNR increased significantly (p ≤ 0.001) and RVolume decreased significantly (p < 0.001) in RRA PET images. The average radiologist scores of image quality were 3.90 ± 0.86 with RRA PET, and 3.03 ± 1.19 with ungated PET. In RRA PET images, the SUVmax (p < 0.001), SUVmean (p < 0.001), SUVpeak (p < 0.001), and CNR (p < 0.001) of the lesions increased, while the volume (p < 0.001) of the lesions decreased. Δ%SUVmax, Δ%SUVmean, Δ%SUVpeak, and Δ%CNR of the lesions increased by 3.9%, 6.5%, 5.6%, and 4.3%, respectively, while Δ%Volume of the lesions decreased by 18.4%. Subgroup analysis showed that in lesions in the upper and middle lobes, only SUVpeak (p < 0.001) significantly increased by 5.6% in RRA PET, while their volume (p < 0.001) notably decreased by 12.4% (p < 0.001).\nCONCLUSION: DDG integrated with RRA motion correction algorithm can effectively mitigate motion artifacts, thus enhancing the quantification accuracy and visual quality of images in lung cancer PET/CT.",
    "abstract_zh": "**翻译：**<br><br>背景：数据驱动门控(DDG)是一种新兴技术，可以减少正电子发射断层扫描(PET)图像中的呼吸运动伪影。<br><br>目的：本研究旨在利用体模和患者数据，验证数据驱动门控与基于重建、配准和平均(RRA)方法的运动校正算法的性能。<br><br>方法：一个定制的运动平台驱动体模（五个直径为10-28毫米的球体），进行周期性运动，运动时长为3-5秒，幅度为2-4厘米。计算了未门控和RRA PET相对于真实静态PET的标准化比率，指标包括RSUVmax、RSUVmean、RSUVpeak、RVolume和相对对比噪声比(RCNR)。此外，前瞻性研究了30例患有76个直径小于3厘米的肺部病灶的肺癌患者。两位放射科医生使用5分制量表对患者检查的整体图像质量进行评分。比较了未门控和RRA PET中病灶测量的SUVmax、SUVmean、SUVpeak、体积和CNR，并进行了亚组分析。<br><br>结果：在RRA PET图像中，体模中球体的运动伪影得到了有效缓解，而与运动幅度或时长无关。对于所有具有不同运动范围和周期的球体，RRA PET图像中的RSUVmax、RSUVmean、RSUVpeak和RCNR显著增加 (p ≤ 0.001)，RVolume显著减少 (p < 0.001)。放射科医生对RRA PET图像质量的平均评分为3.90 ± 0.86，对未门控PET图像质量的平均评分为3.03 ± 1.19。在RRA PET图像中，病灶的SUVmax (p < 0.001)、SUVmean (p < 0.001)、SUVpeak (p < 0.001)和CNR (p < 0.001) 均增加，而病灶的体积 (p < 0.001) 减少。病灶的Δ%SUVmax、Δ%SUVmean、Δ%SUVpeak和Δ%CNR分别增加了3.9%、6.5%、5.6%和4.3%，而病灶的Δ%Volume 减少了18.4%。亚组分析显示，在上叶和中叶的病灶中，RRA PET仅使SUVpeak显著增加5.6% (p < 0.001)，而体积显著减少12.4% (p < 0.001)。<br><br>结论：数据驱动门控与RRA运动校正算法相结合，可以有效减轻运动伪影，从而提高肺癌PET/CT图像的定量准确性和视觉质量。",
    "summary_zh": "本研究验证了数据驱动门控(DDG)结合重建、配准和平均(RRA)运动校正算法在肺癌PET/CT成像中的性能。结果表明，该方法能有效减少运动伪影，显著提高图像质量、SUV值和对比噪声比，并降低病灶体积的测量误差。体模和患者实验均证实了其有效性，尤其是在肺上叶和中叶的病灶中，对于提升定量准确性和图像视觉效果具有重要意义。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17846",
    "link": "https://doi.org/10.1002/mp.17846"
  },
  {
    "title": "Hepatocellular carcinoma 18F-FDG PET/CT kinetic parameter estimation based on the advantage actor-critic algorithm.",
    "authors": [
      "Jianfeng He",
      "Siming Li",
      "Yiwei Xiong",
      "Yu Yao",
      "Siyu Wang",
      "Sidan Wang",
      "Shaobo Wang"
    ],
    "abstract": "BACKGROUND: Kinetic parameters estimated with dynamic 18F-fluorodeoxyglucose (18F-FDG) positron emission tomography (PET)/computed tomography (CT) help characterize hepatocellular carcinoma (HCC), and deep reinforcement learning (DRL) can improve kinetic parameter estimation.\nPURPOSE: The advantage actor-critic (A2C) algorithm is a DRL algorithm with neural networks that seek the optimal parameters. The aim of this study was to preliminarily assess the role of the A2C algorithm in estimating the kinetic parameters of 18F-FDG PET/CT in patients with HCC.\nMATERIALS AND METHODS: 18F-FDG PET data from 14 liver tissues and 17 HCC tumors obtained via a previously developed, abbreviated acquisition protocol (5-min dynamic PET/CT imaging supplemented with 1-min static imaging at 60 min) were prospectively collected. The A2C algorithm was used to estimate kinetic parameters with a reversible double-input, three-compartment model, and the results were compared with those of the conventional nonlinear least squares (NLLS) algorithm. Fitting errors were compared via the root-mean-square errors (RMSEs) of the time activity curves (TACs).\nRESULTS: Significant differences in K1, k2, k3, k4, fa, and vb according to the A2C algorithm and k3, fa, and vb according to the NLLS algorithm were detected between HCC and normal liver tissues (all p < 0.05). Furthermore, A2C demonstrated superior diagnostic performance over NLLS in terms of k3 and vb (both p < 0.05 in the Delong test). Notably, A2C yielded a smaller fitting error for normal liver tissue (0.62 ± 0.24 vs. 1.04 ± 1.00) and HCC tissue (1.40 ± 0.42 vs. 1.51 ± 0.97) than did NLLS.\nCONCLUSIONS: Compared with the conventional postreconstruction NLLS method, the A2C algorithm can more precisely estimate 18F-FDG kinetic parameters with a reversible double-input, three-compartment model for HCC tumors, attaining better TAC fitting with a lower RMSE.",
    "abstract_zh": "",
    "summary_zh": "",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17851",
    "link": "https://doi.org/10.1002/mp.17851"
  },
  {
    "title": "Predicting [177Lu]Lu-DOTA-TATE dosimetry by using pre-therapy [68Ga]Ga-DOTA-TATE PET/CT and biomarkers in patient with neuroendocrine tumors.",
    "authors": [
      "Hongxing Yang",
      "Ming Qi",
      "Zhihao Chen",
      "Fei Liu",
      "Junyan Xu",
      "Xiaoping Xu",
      "Qing Kong",
      "Jianping Zhang",
      "Shaoli Song"
    ],
    "abstract": "BACKGROUND: Lutetium-177 DOTA-TATE peptide receptor radionuclide therapy (PRRT) is an established and effective treatment modality for patients with metastatic neuroendocrine tumors (NETs).\nPURPOSE: This study aims to predict patient-absorbed doses from [177Lu]Lu-DOTA-TATE PRRT in the liver, kidney and lesion by utilizing patient-specific absorbed doses from pre-therapeutic [68Ga]Ga-DOTA-TATE PET/CT.\nMETHODS: Before the treatment of cycle 1, 11 patients with NETs underwent PET/CT scans at 0.5, 1.0, 2.0 and 4.0 h after the injection of [68Ga]Ga-DOTA-TATE. Patients then received [177Lu]Lu-DOTA-TATE PRRT and underwent SPECT/CT scans at 4, 24, 96, and 168 h post-administration. The segmentations and dosimetry were performed by using a professional software. The linear regression model used the absorbed doses from [68Ga]Ga-DOTA-TATE alone as the predictor variable. The multiple linear regression model used the absorbed doses from [68Ga]Ga-DOTA-TATE and the relevant clinical biomarkers as the predictor variables.\nRESULTS: The mean absorbed doses from [177Lu]Lu-DOTA-TATE PRRT in kidney and liver were 4.1 and 2.1 Gy, respectively. In comparison, the mean absorbed doses from [68Ga]Ga-DOTA-TATE were significantly lower: 18.0 mGy and 11.0 mGy, respectively. For lesions, the maximum absorbed dose from [68Ga]Ga-DOTA-TATE ranged from 24.1 to 170.4 mGy, while the maximum absorbed dose from [177Lu]Lu-DOTA-TATE PRRT was significantly higher, ranging from 9.6 to 77.9 Gy. The linear regression model yielded moderate R-squared values of 0.50, 0.59, and 0.36 for kidney, liver and lesion, respectively. The performance of multiple linear regression model was better, with R-squared values increasing to 0.81, 0.77, and 0.84.\nCONCLUSION: Absorbed doses from [177Lu]Lu-DOTA-TATE PRRT can be accurately predicted. Moreover, our models are formalized into simple equations.",
    "abstract_zh": "**翻译:**<br><br>背景：镥-177 DOTA-TATE 肽受体放射性核素疗法 (PRRT) 是一种针对转移性神经内分泌肿瘤 (NETs) 患者已确立且有效的治疗方式。<br><br>目的：本研究旨在通过利用患者接受治疗前[68Ga]Ga-DOTA-TATE PET/CT获得的患者特异性吸收剂量，预测[177Lu]Lu-DOTA-TATE PRRT在肝脏、肾脏和病灶中的吸收剂量。<br><br>方法：在首个治疗周期前，11例NETs患者在注射[68Ga]Ga-DOTA-TATE后0.5、1.0、2.0和4.0小时进行PET/CT扫描。然后患者接受[177Lu]Lu-DOTA-TATE PRRT，并在给药后4、24、96和168小时进行SPECT/CT扫描。使用专业的软件进行分割和剂量测定。线性回归模型仅使用[68Ga]Ga-DOTA-TATE的吸收剂量作为预测变量。多元线性回归模型使用[68Ga]Ga-DOTA-TATE的吸收剂量和相关的临床生物标志物作为预测变量。<br><br>结果：[177Lu]Lu-DOTA-TATE PRRT在肾脏和肝脏中的平均吸收剂量分别为4.1 Gy和2.1 Gy。相比之下，[68Ga]Ga-DOTA-TATE的平均吸收剂量显著较低，分别为18.0 mGy和11.0 mGy。对于病灶，[68Ga]Ga-DOTA-TATE的最大吸收剂量范围为24.1至170.4 mGy，而[177Lu]Lu-DOTA-TATE PRRT的最大吸收剂量显著较高，范围为9.6至77.9 Gy。线性回归模型对肾脏、肝脏和病灶的R平方值分别为0.50、0.59和0.36，表现中等。多元线性回归模型的性能更好，R平方值提高到0.81、0.77和0.84。<br><br>结论：可以准确预测[177Lu]Lu-DOTA-TATE PRRT的吸收剂量。此外，我们的模型被形式化为简单的方程。",
    "summary_zh": "本研究旨在利用PET/CT扫描数据预测神经内分泌肿瘤患者接受[177Lu]Lu-DOTA-TATE PRRT治疗时肝脏、肾脏和病灶的吸收剂量。研究结果表明，基于[68Ga]Ga-DOTA-TATE PET/CT数据和临床生物标志物的多元线性回归模型能有效预测[177Lu]Lu-DOTA-TATE PRRT的吸收剂量，且该模型已简化为简单方程，便于临床应用。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17852",
    "link": "https://doi.org/10.1002/mp.17852"
  },
  {
    "title": "Depth-of-interaction encoding techniques for pixelated PET detectors enabled by machine learning methods and fast waveform digitization.",
    "authors": [
      "Bing Dai",
      "Srilalan Krishnamoorthy",
      "Emmanuel Morales",
      "Suleman Surti",
      "Joel S Karp"
    ],
    "abstract": "Objective. Pixelated detectors with single-ended readout are routinely used by commercial positron emission tomography scanners owing to their good energy and timing resolution and optimized manufacturing, but they typically do not provide depth-of-interaction (DOI) information, which can help improve the performance of systems with higher resolution and smaller ring diameter. This work aims to develop a technique for multi-level DOI classification that does not require modifications to the detector designs.Approach. We leveraged high-speed (5 Gs s-1) waveform sampling electronics with the Domino Ring Sampler (DRS4) and machine learning (ML) methods to extract DOI information from the entire scintillation waveforms of pixelated crystals. We evaluated different grouping schemes for multi-level DOI classification by analyzing the DOI positioning profile and DOI positioning error. We examined trade-offs among crystal configurations, detector timing performance, and DOI classification accuracy. We also investigated the impact of different ML algorithms and input features-extracted from scintillation waveforms-on model accuracy.Main results. The DOI positioning profile and positioning error suggest that 2- or 3-level binning was effective for 20 mm long crystals. 2-level discrete DOI models achieved 95% class-wise accuracy and 83% overall accuracy in positioning events into the correct DOI level and 3-level up to 90% class-wise accuracy for long and narrow crystals (2 × 2 × 20 mm3). Long short-term memory networks trained with time-frequency moments were twice as efficient in training time while maintaining equal or better accuracy compared to those trained with waveforms. Classical ML algorithms exhibit comparable accuracy while consuming one order less training time than deep learning models.Significance. This work demonstrates a proof-of-concept approach for obtaining DOI information from commercially available pixelated detectors without altering the detector design thereby avoiding potential degradation in detector timing performance. It provides an alternative solution for multi-level DOI classification, potentially inspiring future scanner designs.",
    "abstract_zh": "**翻译：**<br><br>**目的：** 具有单端读出的像素化探测器因其良好的能量和时间分辨率以及优化的制造工艺，而被商业正电子发射断层扫描（PET）扫描仪广泛使用。然而，它们通常不提供深度方向信息（DOI），而DOI信息有助于提高具有更高分辨率和更小环直径的系统的性能。本研究旨在开发一种无需修改探测器设计的、用于多级DOI分类的技术。<br><br>**方法：** 我们利用高速（5 Gs/s）波形采样电子设备（Domino Ring Sampler (DRS4)）和机器学习（ML）方法，从像素化晶体的整个闪烁波形中提取DOI信息。通过分析DOI定位分布图和DOI定位误差，我们评估了多级DOI分类的不同分组方案。我们研究了晶体配置、探测器时间性能和DOI分类准确性之间的权衡。我们还研究了不同ML算法以及从闪烁波形中提取的不同输入特征对模型准确性的影响。<br><br>**主要结果：** DOI定位分布图和定位误差表明，对于20毫米长的晶体，2级或3级分箱是有效的。2级离散DOI模型在将事件定位到正确的DOI水平时，达到了95%的类别准确率和83%的总体准确率；而对于长而窄的晶体（2 × 2 × 20 mm3），3级模型的类别准确率高达90%。与使用波形训练的模型相比，使用时频矩训练的长短期记忆网络在训练时间上效率提高了一倍，同时保持了相同或更好的准确性。经典的机器学习算法表现出相当的准确性，同时比深度学习模型消耗的训练时间少一个数量级。<br><br>**意义：** 这项工作展示了一种概念验证的方法，用于从商业上可用的像素化探测器中获取DOI信息，而无需改变探测器设计，从而避免了探测器时间性能的潜在退化。它为多级DOI分类提供了一种替代解决方案，可能启发未来的扫描仪设计。",
    "summary_zh": "该研究提出了一种利用高速波形采样和机器学习方法，从现有商用像素化PET探测器中提取深度方向信息（DOI）的技术，无需改变探测器物理设计。研究结果表明，通过对闪烁波形进行分析，可以实现多级DOI分类，且不同机器学习算法在训练时间和准确性之间存在权衡。该方法为提高PET扫描仪性能，特别是高分辨率小型化扫描仪，提供了一种有潜力的解决方案。",
    "journal": "Physics in medicine and biology",
    "pubdate": "",
    "doi": "10.1088/1361-6560/adc96d",
    "link": "https://doi.org/10.1088/1361-6560/adc96d"
  },
  {
    "title": "Predictive models of epidermal growth factor receptor mutation in lung adenocarcinoma using PET/CT-based radiomics features.",
    "authors": [
      "Zhikang Deng",
      "Di Jin",
      "Pei Huang",
      "Changchun Wang",
      "Yaohong Deng",
      "Rong Xu",
      "Bing Fan"
    ],
    "abstract": "BACKGROUND: Lung adenocarcinoma (LAC) comprises a substantial subset of non-small cell lung cancer (NSCLC) diagnoses, where epidermal growth factor receptor (EGFR) mutations play a pivotal role as indicators for therapeutic intervention with targeted agents. The emerging field of radiomics, which involves the extraction of numerous quantitative attributes from medical imaging, when coupled with positron emission tomography/ computed tomography (PET/CT) technology, has demonstrated promise in the prognostication of EGFR mutation status. The objective of this investigation is to construct and validate predictive models for EGFR mutations in LAC by leveraging PET/CT-derived radiomics features, thereby refining diagnostic precision and facilitating tailored treatment strategies.\nPURPOSE: The aim of this study was to develop a non-invasive radiomics model based on PET/CT with excellent performance for predicting the EGFR mutation status in LAC. Thus, it can provide the basis for the individualized treatment decision of patients.\nMETHODS: Positron emission tomography (PET), computed tomography (CT), clinical and pathological data of 112 patients with LAC admitted to our hospital from January 2019 to June 2023 were retrospectively analyzed. This research cohort encompassed 54 LAC patients with EGFR wild type and 58 LAC patients with EGFR mutated type. The participants were randomly assigned to the training group (n = 78) and the validation group (n = 34) in a 7:3 ratio. A sum of 3562 radiomics attributes were derived from PET/CT scans. The minimal absolute shrinkage and selection operator method was employed to identify 13 notable features. Based on these characteristics, support vector machine (SVM), gradient boosting decision tree (GBDT), random forest (RF) and extreme gradient boosting (XGBOOST) were constructed. The forecasting effectiveness of the model was assessed using the area under the receiver operating characteristic (ROC) Curve, the DeLong test, and decision curve analysis (DCA).\nRESULTS: SVM performance in PET/CT radiomics model was higher than that of other machine learning models (training group areas under the curve [AUC] of 0.916 and validation group AUC of 0.945, respectively). The integration of radiomics and clinical data did not yield a superior predictive performance compared to the radiomics model alone in terms of estimating EGFR mutation status (AUC: 0.916 vs. 0.921, 0.945 vs. 0.955, p> 0.05, in both the training and validation groups).\nCONCLUSIONS: The SVM model has emerged as a commendable non-invasive technique, showing high precision and dependability in forecasting EGFR mutation statuses in individuals with LAC. The radiomics model derived from PET/CT scans holds promise as a prognostic indicator of EGFR mutations in LAC, offering a valuable tool that could refine personalized therapeutic strategies and ultimately enhance the prognosis for LAC patients.",
    "abstract_zh": "**翻译：**<br><br>背景：肺腺癌（LAC）是非小细胞肺癌（NSCLC）的重要亚型，其中表皮生长因子受体（EGFR）突变是靶向药物治疗的关键指标。放射组学作为新兴领域，通过提取医学影像中的大量定量特征，并结合正电子发射断层扫描/计算机断层扫描（PET/CT）技术，已展现出在预测EGFR突变状态方面的潜力。本研究旨在构建和验证基于PET/CT放射组学特征的LAC患者EGFR突变预测模型，从而提高诊断精度，并促进个体化治疗策略的制定。<br><br>目的：本研究的目的是建立一个基于PET/CT的、性能优异的非侵入性放射组学模型，用于预测LAC患者的EGFR突变状态。因此，它可以为患者的个体化治疗决策提供依据。<br><br>方法：回顾性分析2019年1月至2023年6月我院收治的112例LAC患者的正电子发射断层扫描（PET）、计算机断层扫描（CT）、临床和病理数据。该研究队列包含54例EGFR野生型LAC患者和58例EGFR突变型LAC患者。参与者以7:3的比例随机分配到训练组（n = 78）和验证组（n = 34）。从PET/CT扫描中提取了总计3562个放射组学特征。采用最小绝对收缩和选择算子方法（LASSO）识别出13个显著特征。基于这些特征，构建了支持向量机（SVM）、梯度提升决策树（GBDT）、随机森林（RF）和极限梯度提升（XGBOOST）模型。使用受试者工作特征曲线（ROC）下面积、DeLong检验和决策曲线分析（DCA）评估模型的预测效果。<br><br>结果：PET/CT放射组学模型中，支持向量机（SVM）的性能优于其他机器学习模型（训练组ROC曲线下面积[AUC]为0.916，验证组AUC为0.945）。在估计EGFR突变状态方面，与单独的放射组学模型相比，放射组学和临床数据的整合并未产生更优的预测性能（训练组AUC：0.916 vs. 0.921，验证组AUC：0.945 vs. 0.955，p > 0.05）。<br><br>结论：支持向量机（SVM）模型已成为一种值得称赞的非侵入性技术，在预测LAC患者的EGFR突变状态方面表现出高精度和可靠性。源自PET/CT扫描的放射组学模型有望成为LAC中EGFR突变的预后指标，提供一种有价值的工具，可以优化个体化治疗策略，并最终改善LAC患者的预后。",
    "summary_zh": "本研究构建并验证了基于PET/CT放射组学的SVM模型，用于预测肺腺癌患者的EGFR突变状态。该模型无需侵入性操作，表现出较高的预测精度和可靠性，优于其他机器学习模型，且整合临床数据未显著提升预测性能。研究结果表明，该放射组学模型有望作为一种非侵入性的预后指标，指导个体化治疗，改善肺腺癌患者的预后。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17780",
    "link": "https://doi.org/10.1002/mp.17780"
  },
  {
    "title": "Hybrid method for estimating lung ventilation from CT by combining intensity and motion information.",
    "authors": [
      "Paris Tzitzimpasis",
      "Mario Ries",
      "Bas W Raaymakers",
      "Cornel Zachiu"
    ],
    "abstract": "BACKGROUND: Functional lung imaging modalities allow for capturing regional lung ventilation information. Computed Tomography based ventilation imaging (CTVI) has been proposed as a surrogate modality that relies on time-resolved anatomical data and image processing. However, generating accurate ventilation maps using solely computed tomography (CT) image information remains a challenging task, due to the need to derive functional information of ventilation from anatomical observations.\nPURPOSE: We introduce the hybrid estimation of computed tomography obtained respiratory function (HECTOR) method that consists of two components: a volume- and a density-based ventilation estimate. For the first component, a deformable image registration (DIR)-based solution for accurate volumetric CTVI generation is proposed, integrating the physical characteristics of the lung deformations in its design. For the second component, an already established air-tissue density model is used. Furthermore, a novel method is developed for combining the two components.\nMETHODS: The proposed method consists of four principal steps: (1) Application of a specially tailored DIR algorithm to estimate respiratory motion between inhale and exhale phases. (2) Conversion of the motion information to volumetric change maps using a variation of the Jacobian determinant method. (3) Computation of a HU-based method that estimates the local product of air-tissue densities. (4) Combination of the metrics estimated in steps 2 and 3 by means of a smooth minimum function. The proposed approach is validated using the publicly available VAMPIRE dataset consisting of two subgroups: 25 subjects scanned with Galligas 4DPET/CT and 21 subjects scanned with DTPA-SPECT. Another dataset of 18 patients available at The Cancer Imaging Archive (TCIA) was used for further validation. All datasets contain inhale/exhale CT scans paired with ground-truth ventilation images (RefVIs). The CTVIs generated by the proposed HECTOR method were tested against the RefVIs using the Spearman correlation coefficient and Dice overlap of low- and high-function lung (DSC-low and DSC-high, respectively).\nRESULTS: The proposed method achieved mean Spearman, DSC-high and DSC-low coefficients of 0.62, 0.55, and 0.59 on the Galligas PET subgroup and 0.49,0,48, and 0.50 on the DTPA-SPECT subgroup of the VAMPIRE dataset. This performance was better than the highest performing method reported in the original challenge. The same metrics for the TCIA dataset were 0.66, 0.60, and 0.60. The proposed hybrid ventilation method achieved higher Spearman correlation scores than the individual volume- and density-based components in all datasets. Additionally, the use of the specially tailored DIR algorithm was found to achieve higher scores than previously reported volume-based methods.\nCONCLUSIONS: Our work provides a novel processing workflow for CT ventilation imaging that can consistently generate ventilation maps with high fidelity compared to reference approaches. This study also provides further insights into the benefits of combining different types of information to model the complex dynamics of respiratory function. Such information can be useful for potential applications in radiation therapy treatment planning and thoracic dose-response assessment.",
    "abstract_zh": "**翻译：**<br><br>**背景：** 功能性肺部成像方式能够捕捉区域性肺部通气信息。基于计算机断层扫描的通气成像（CTVI）已被提出作为一种替代方式，它依赖于时间分辨的解剖数据和图像处理。然而，仅使用计算机断层扫描（CT）图像信息生成精确的通气图仍然是一项具有挑战性的任务，因为需要从解剖学观察中推导出通气的功能性信息。<br><br>**目的：** 我们介绍了一种混合估计计算机断层扫描获取的呼吸功能（HECTOR）的方法，该方法包含两个组成部分：基于体积的通气估计和基于密度的通气估计。对于第一个组成部分，提出了一种基于可变形图像配准（DIR）的解决方案，用于生成精确的体积CTVI，该解决方案在其设计中整合了肺部变形的物理特性。对于第二个组成部分，使用了一种已建立的空气-组织密度模型。此外，还开发了一种将这两个组成部分相结合的新方法。<br><br>**方法：** 所提出的方法包括四个主要步骤：（1）应用专门定制的DIR算法来估计吸气和呼气阶段之间的呼吸运动。（2）使用雅可比行列式方法的一种变体将运动信息转换为体积变化图。（3）计算基于HU值的方法，该方法估计空气-组织密度的局部乘积。（4）通过平滑最小值函数，将步骤2和3中估计的指标结合起来。使用公开可用的VAMPIRE数据集对所提出的方法进行验证，该数据集包含两个子组：25名受试者使用Galligas 4DPET/CT扫描，21名受试者使用DTPA-SPECT扫描。来自癌症影像档案库（TCIA）的另一个包含18名患者的数据集用于进一步验证。所有数据集都包含吸气/呼气CT扫描，并配有真实通气图像（RefVIs）。使用Spearman相关系数以及低功能和高功能肺的Dice重叠度（分别为DSC-low和DSC-high），针对RefVIs测试了由所提出的HECTOR方法生成的CTVI。<br><br>**结果：** 在VAMPIRE数据集的Galligas PET子组中，所提出的方法实现了平均Spearman、DSC-high和DSC-low系数分别为0.62、0.55和0.59；在DTPA-SPECT子组中，分别为0.49、0.48和0.50。该性能优于原始挑战中报告的性能最佳的方法。TCIA数据集的相同指标分别为0.66、0.60和0.60。在所有数据集中，所提出的混合通气方法都比单独的基于体积和基于密度的组成部分获得了更高的Spearman相关系数。此外，研究发现，使用专门定制的DIR算法比以前报道的基于体积的方法获得了更高的分数。<br><br>**结论：** 我们的工作为CT通气成像提供了一种新的处理流程，与参考方法相比，该流程可以持续生成高保真度的通气图。这项研究还进一步深入了解了结合不同类型的信息来模拟呼吸功能复杂动态的益处。此类信息可用于放射治疗计划和胸部剂量-反应评估中的潜在应用。",
    "summary_zh": "该研究提出了一种新的混合方法(HECTOR)用于生成基于CT的通气图。该方法结合了基于体积和基于密度的通气估计，通过可变形图像配准(DIR)算法准确计算体积变化，并利用空气-组织密度模型，最后将两者结果通过平滑函数结合。实验结果表明，该方法在多个公开数据集上表现优于现有方法，能更准确地反映肺部通气情况，有望应用于放射治疗计划等领域。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17787",
    "link": "https://doi.org/10.1002/mp.17787"
  }
]