[
  {
    "title": "Physical phantom validation of clustering-initiated factorization in dynamic PET.",
    "authors": [
      "Valerie Kobzarenko",
      "Suzanne L Baker",
      "Mustafa Janabi",
      "Woon-Seng Choong",
      "Grant T Gullberg",
      "Youngho Seo",
      "Rostyslav Boutchko",
      "Debasis Mitra"
    ],
    "abstract": "BACKGROUND: Dynamic positron emission tomography (PET) enables the quantification of physiological parameters of radiotracers employed in the investigation of neuropsychiatric disorders. We previously introduced a factor analysis-based algorithm, Cluster-Initialized Factor Analysis (CIFA), designed to overcome the problem of specifying reference regions. CIFA is capable of automatically extracting distinct radiotracer binding distributions across many modalities based on the differences in tracer dynamics, and thus can distinguish regions of specific- and non-specific binding without requiring prior segmentation.\nPURPOSE: Our goal is to quantitatively validate the ability of CIFA to resolve different dynamic biological processes by comparing the output of the algorithm to an independent benchmark. As an intermediate goal, we aim to create a physical phantom capable of modeling unique aspects of dynamic imaging and to use this phantom as the benchmark in evaluating CIFA.\nMETHODS: CIFA was used to reconstruct 18F-flortaucipir dynamic brain PET datasets acquired at Lawrence Berkeley National Lab. The resulting factor curves served as the foundation for creating dynamic input time-activity curve (TAC) combinations in a physical brain phantom specifically constructed for this purpose. The phantom represented three components: two overlapping tissue types and free radiotracer, constructed with a combination of small hydraulic elements. The physical components were scanned separately to generate a library of images, allowing us to reproduce scans of any duration with prescribed dynamics and realistic partial volume effects. The phantom was designed to produce noisy instances with compartment mixing of dynamic scans with desired activity TACs for free, non-specifically bound, and specifically bound radiotracers. Ten distinct dynamic simulations with varying levels of TAC similarity were estimated with CIFA.\nRESULTS: We directly evaluated CIFA's performance in analyzing each of the 10 dynamic datasets by computing the Pearson correlation coefficient between the estimated outputs and the ground truth tissue TACs and corresponding tissue distributions. For seven out of 10 modeled dynamics, which captured the full spectrum of realistically expected tissue TAC shapes, the curve correlation of the specific binding tissue was above 95%.\nCONCLUSIONS: This work formulated an innovative process by combining a physical phantom design with PET images for evaluating the application of CIFA in the extraction of dynamic TACs from dynamic PET image data. In most cases the CIFA algorithm accurately reproduced the dynamics of the phantom simulated data.",
    "abstract_zh": "**翻译：**\n\n背景：动态正电子发射断层扫描（PET）能够量化用于神经精神疾病研究的放射性示踪剂的生理参数。我们之前引入了一种基于因子分析的算法，即聚类初始化因子分析（CIFA），旨在克服指定参考区域的问题。CIFA能够基于示踪剂动力学的差异，自动提取跨多种模态的不同放射性示踪剂结合分布，从而无需预先分割即可区分特异性结合和非特异性结合的区域。\n\n目的：我们的目标是通过将算法的输出与独立的基准进行比较，来定量验证CIFA解析不同动态生物过程的能力。作为中间目标，我们旨在创建一个能够模拟动态成像独特方面的物理模型，并将该模型用作评估CIFA的基准。\n\n方法：CIFA被用于重建在劳伦斯伯克利国家实验室获取的18F-flortaucipir动态脑部PET数据集。生成的因子曲线作为基础，用于在专门为此目的构建的物理脑部模型中创建动态输入时间-活动曲线（TAC）组合。该模型代表了三个组成部分：两种重叠的组织类型和游离放射性示踪剂，由小型液压元件组合而成。物理组件被单独扫描以生成图像库，使我们能够重现任何持续时间的扫描，并具有规定的动力学和真实的局部容积效应。该模型旨在产生具有期望的活动TACs（游离的、非特异性结合的和特异性结合的放射性示踪剂）的动态扫描的噪声实例，其中包含区室混合。CIFA估计了十个具有不同TAC相似程度的不同动态模拟。\n\n结果：我们通过计算估计输出与真实组织TAC及其相应组织分布之间的Pearson相关系数，直接评估了CIFA在分析每个10个动态数据集中的性能。对于捕获了现实预期组织TAC形状的完整光谱的10个建模动力学中的7个，特异性结合组织的曲线相关性高于95％。\n\n结论：这项工作通过将物理模型设计与PET图像相结合，提出了一种创新的过程，用于评估CIFA在从动态PET图像数据中提取动态TAC的应用。在大多数情况下，CIFA算法准确地再现了模型模拟数据的动力学。",
    "summary_zh": "本研究旨在验证CIFA算法在动态PET数据分析中的准确性。研究人员构建了一个物理脑部模型，模拟不同示踪剂的动力学过程，并用CIFA算法分析模拟数据。结果表明，CIFA算法在大多数情况下能够准确地重现模型的动力学过程，验证了其在动态PET数据分析中的有效性。该研究为CIFA算法的应用提供了一个创新的评估方法。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17902",
    "link": "https://doi.org/10.1002/mp.17902"
  },
  {
    "title": "Generation of synthetic CT from MRI for MRI-based attenuation correction of brain PET images using radiomics and machine learning.",
    "authors": [
      "Amin Hoseinipourasl",
      "Gholam-Ali Hossein-Zadeh",
      "Peyman Sheikhzadeh",
      "Hossein Arabalibeik",
      "Shaghayegh Karimi Alavijeh",
      "Habib Zaidi",
      "Mohammad Reza Ay"
    ],
    "abstract": "BACKGROUND: Accurate quantitative PET imaging in neurological studies requires proper attenuation correction. MRI-guided attenuation correction in PET/MRI remains challenging owing to the lack of direct relationship between MRI intensities and linear attenuation coefficients.\nPURPOSE: This study aims at generating accurate patient-specific synthetic CT volumes, attenuation maps, and attenuation correction factor (ACF) sinograms with continuous values utilizing a combination of machine learning algorithms, image processing techniques, and voxel-based radiomics feature extraction approaches.\nMETHODS: Brain MR images of ten healthy volunteers were acquired using IR-pointwise encoding time reduction with radial acquisition (IR-PETRA) and VIBE-Dixon techniques. synthetic CT (SCT) images, attenuation maps, and attenuation correction factors (ACFs) were generated using the LightGBM, a fast and accurate machine learning algorithm, from the radiomics-based and image processing-based feature maps of MR images. Additionally, ultra-low-dose CT images of the same volunteers were acquired and served as the standard of reference for evaluation. The SCT images, attenuation maps, and ACF sinograms were assessed using qualitative and quantitative evaluation metrics and compared against their corresponding reference images, attenuation maps, and ACF sinograms.\nRESULTS: The voxel-wise and volume-wise comparison between synthetic and reference CT images yielded an average mean absolute error of 60.75 ± 8.8 HUs, an average structural similarity index of 0.88 ± 0.02, and an average peak signal-to-noise ratio of 32.83 ± 2.74 dB. Additionally, we compared MRI-based attenuation maps and ACF sinograms with their CT-based counterparts, revealing average normalized mean absolute errors of 1.48% and 1.33%, respectively.\nCONCLUSION: Quantitative assessments indicated higher correlations and similarities between LightGBM-synthesized CT and Reference CT images. Moreover, the cross-validation results showed the possibility of producing accurate SCT images, MRI-based attenuation maps, and ACF sinograms. This might spur the implementation of MRI-based attenuation correction on PET/MRI and dedicated brain PET scanners with lower computational time using CPU-based processors.",
    "abstract_zh": "**翻译：**\n\n**背景：** 在神经系统研究中，准确的定量PET成像需要适当的衰减校正。由于MRI信号强度与线性衰减系数之间缺乏直接关系，在PET/MRI中进行MRI引导的衰减校正仍然具有挑战性。\n\n**目的：** 本研究旨在结合机器学习算法、图像处理技术和基于体素的放射组学特征提取方法，生成准确的、患者特异性的连续值合成CT体数据、衰减图和衰减校正因子（ACF）正弦图。\n\n**方法：** 使用IR-点式编码时间缩减径向采集（IR-PETRA）和VIBE-Dixon技术采集了十名健康志愿者的脑部MR图像。利用一种快速且准确的机器学习算法LightGBM，从MR图像的基于放射组学和图像处理的特征图中生成合成CT（SCT）图像、衰减图和衰减校正因子（ACF）。此外，还采集了相同志愿者的超低剂量CT图像，作为评估的参考标准。使用定性和定量评估指标对SCT图像、衰减图和ACF正弦图进行了评估，并与相应的参考图像、衰减图和ACF正弦图进行了比较。\n\n**结果：** 合成CT图像与参考CT图像之间的体素级和体积级比较显示，平均绝对误差为60.75 ± 8.8 HU，平均结构相似性指数为0.88 ± 0.02，平均峰值信噪比为32.83 ± 2.74 dB。此外，我们将基于MRI的衰减图和ACF正弦图与基于CT的对应物进行了比较，显示平均归一化平均绝对误差分别为1.48%和1.33%。\n\n**结论：** 定量评估表明，LightGBM合成的CT图像与参考CT图像之间具有更高的相关性和相似性。此外，交叉验证结果表明，可以生成准确的SCT图像、基于MRI的衰减图和ACF正弦图。这可能会促进在PET/MRI和专用脑PET扫描仪上采用基于MRI的衰减校正，并使用基于CPU的处理器缩短计算时间。",
    "summary_zh": "本研究利用LightGBM机器学习算法，结合放射组学和图像处理技术，成功地从MRI图像生成了高质量的合成CT（SCT）图像、衰减图和衰减校正因子（ACF）正弦图，用于PET/MRI中的衰减校正。结果表明，生成的SCT图像与参考CT图像高度相似，衰减图和ACF正弦图与CT衍生的结果高度一致。该方法有望降低PET/MRI衰减校正的计算负担，并提高其准确性。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17867",
    "link": "https://doi.org/10.1002/mp.17867"
  },
  {
    "title": "Impact of tracer uptake rate on quantification accuracy of myocardial blood flow in PET: A simulation study.",
    "authors": [
      "Xiaotong Hong",
      "Amirhossein Sanaat",
      "Yazdan Salimi",
      "René Nkoulou",
      "Hossein Arabi",
      "Lijun Lu",
      "Habib Zaidi"
    ],
    "abstract": "BACKGROUND: Cardiac perfusion PET is commonly used to assess ischemia and cardiovascular risk, which enables quantitative measurements of myocardial blood flow (MBF) through kinetic modeling. However, the estimation of kinetic parameters is challenging due to the noisy nature of short dynamic frames and limited sample data points.\nPURPOSE: This work aimed to investigate the errors in MBF estimation in PET through a simulation study and to evaluate different parameter estimation approaches, including a deep learning (DL) method.\nMATERIALS AND METHODS: Simulated studies were generated using digital phantoms based on cardiac segmentations from 55 clinical CT images. We employed the irreversible 2-tissue compartmental model and simulated dynamic 13N-ammonia PET scans under both rest and stress conditions (220 cases each). The simulations covered a rest K1 range of 0.6 to 1.2 and a stress K1 range of 1.2 to 3.6 (unit: mL/min/g) in the myocardium. A transformer-based DL model was trained on the simulated dataset to predict parametric images (PIMs) from noisy PET image frames and was validated using 5-fold cross-validation. We compared the DL method with the voxel-wise nonlinear least squares (NLS) fitting applied to the dynamic images, using either Gaussian filter (GF) smoothing (GF-NLS) or a dynamic nonlocal means (DNLM) algorithm for denoising (DNLM-NLS). Two patients with coronary CT angiography (CTA) and fractional flow reserve (FFR) were enrolled to test the feasibility of applying DL models on clinical PET data.\nRESULTS: The DL method showed clearer image structures with reduced noise compared to the traditional NLS-based methods. In terms of mean absolute relative error (MARE), as the rest K1 values increased from 0.6 to 1.2 mL/min/g, the overall bias in myocardium K1 estimates decreased from approximately 58% to 45% for the NLS-based methods while the DL method showed a reduction in MARE from 42% to 18%. For stress data, as the stress K1 decreased from 3.6 to 1.2 mL/min/g, the MARE increased from 30% to 70% for the GF-NLS method. In contrast, both the DNLM-NLS (average: 42%) and the DL methods (average: 20%) demonstrated significantly smaller MARE changes as stress K1 varied. Regarding the regional mean bias (±standard deviation), the GF-NLS method had a bias of 6.30% (±8.35%) of rest K1, compared to 1.10% (±8.21%) for DNLM-NLS and 6.28% (±14.05%) for the DL method. For the stress K1, the GF-NLS showed a mean bias of 10.72% (±9.34%) compared to 1.69% (±8.82%) for DNLM-NLS and -10.55% (±9.81%) for the DL method.\nSIGNIFICANCE: This study showed that an increase in the tracer uptake rate (K1) corresponded to improved accuracy and precision in MBF quantification, whereas lower tracer uptake resulted in higher noise in dynamic PET and poorer parameter estimates. Utilizing denoising techniques or DL approaches can mitigate noise-induced bias in PET parametric imaging.",
    "abstract_zh": "**背景：** 心肌灌注PET常用于评估缺血和心血管风险，它可以通过动力学建模对心肌血流量(MBF)进行定量测量。然而，由于短动态帧的噪声特性和有限的样本数据点，动力学参数的估计具有挑战性。\n\n**目的：** 本研究旨在通过模拟研究探讨PET中MBF估计的误差，并评估不同的参数估计方法，包括深度学习(DL)方法。\n\n**材料与方法：** 基于55例临床CT图像的心脏分割，使用数字体模生成模拟研究数据。我们采用了不可逆的二室模型，并模拟了静息和负荷条件下的动态<sup>13</sup>N-氨PET扫描（每种条件220例）。模拟覆盖了心肌中0.6到1.2的静息K1范围以及1.2到3.6的负荷K1范围（单位：mL/min/g）。使用基于Transformer的DL模型，在模拟数据集上进行训练，以从含噪声的PET图像帧中预测参数图像(PIMs)，并使用5折交叉验证进行验证。我们将DL方法与应用于动态图像的体素级非线性最小二乘法(NLS)拟合进行比较，后者使用高斯滤波器(GF)平滑(GF-NLS)或动态非局部均值(DNLM)算法进行去噪(DNLM-NLS)。招募了两名进行冠状动脉CT血管造影(CTA)和血流储备分数(FFR)检查的患者，以测试将DL模型应用于临床PET数据的可行性。\n\n**结果：** 与传统的基于NLS的方法相比，DL方法显示出更清晰的图像结构，并降低了噪声。在平均绝对相对误差(MARE)方面，随着静息K1值从0.6增加到1.2 mL/min/g，基于NLS的方法的心肌K1估计的总体偏差从大约58%降低到45%，而DL方法显示MARE从42%降低到18%。对于负荷数据，随着负荷K1从3.6降低到1.2 mL/min/g，GF-NLS方法的MARE从30%增加到70%。相比之下，DNLM-NLS（平均值：42%）和DL方法（平均值：20%）都显示出随着负荷K1变化而产生的MARE变化明显更小。关于区域平均偏差（±标准差），GF-NLS方法的静息K1偏差为6.30%（±8.35%），而DNLM-NLS方法的偏差为1.10%（±8.21%），DL方法的偏差为6.28%（±14.05%）。对于负荷K1，GF-NLS显示平均偏差为10.72%（±9.34%），而DNLM-NLS为1.69%（±8.82%），DL方法为-10.55%（±9.81%）。\n\n**意义：** 本研究表明，示踪剂摄取率(K1)的增加对应于MBF定量的准确性和精度的提高，而较低的示踪剂摄取导致动态PET中更高的噪声和更差的参数估计。利用去噪技术或DL方法可以减轻PET参数图像中噪声引起的偏差。",
    "summary_zh": "该研究通过模拟数据对比了深度学习方法与传统非线性最小二乘法在心肌灌注PET图像中MBF估计的误差。结果表明，深度学习方法在降低噪声和提高MBF定量准确性方面优于传统方法，尤其是在低示踪剂摄取的情况下。研究强调了噪声对参数估计的影响，并表明去噪技术或深度学习方法能有效降低噪声引起的偏差。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17871",
    "link": "https://doi.org/10.1002/mp.17871"
  },
  {
    "title": "Instantaneous in vivo distal edge verification in intensity-modulated proton therapy by means of PET imaging.",
    "authors": [
      "Brian Zapien-Campos",
      "Zahra Ahmadi Ganjeh",
      "Giuliano Perotti-Bernardini",
      "Jeffrey Free",
      "Stefan Both",
      "Peter Dendooven"
    ],
    "abstract": "BACKGROUND: Intensity-modulated proton therapy (IMPT) holds promise for improving outcomes in head-and-neck cancer (HNC) patients by enhancing organ-at-risk (OAR) sparing. A key challenge in IMPT is ensuring an accurate dose delivery at the distal edge of the tumor, where the steep dose gradients make treatment precision highly sensitive to uncertainties in both proton range and patient setup. Thus, IMPT conformality is increased by incorporating robust margins in the treatment optimization. However, an increment in the plan robustness could lead to an OAR overdosing. Therefore, an accurate distal edge verification during dose delivery is crucial to increase IMPT conformality by reducing optimization settings in treatment planning.\nPURPOSE: This work aims to evaluate, in a quasi-clinical setting, a novel approach for accurate instantaneous proton beam distal edge verification in IMPT by means of spot-by-spot positron emission tomography (PET) imaging.\nMETHODS: An anthropomorphic head and neck phantom CIRS-731 HN was irradiated at the head and neck region. The targets were defined as 4 cm diameter spheres. A 60-ms delay was introduced between the proton beam spots in order to enable the spot-by-spot coincidence detection of the 511-keV photons resulting from positron annihilation following the positron emission from very short-lived positron-emitting, mainly 12N (T1/2  = 11.0 ms). Additionally, modified irradiations were carried out using solid water slabs of 2 and 5 mm thickness in the beam path to assess the precision of the approach for detecting range deviations. The positron activity range (PAR) was determined from the 50% distal fall-off position of the 1D longitudinal positron activity profile derived from the 2D image reconstructions. Furthermore, Monte Carlo (MC) simulations were performed using an in-house RayStation/GATE MC framework to predict the positron activity images and verify the PAR measurements.\nRESULTS: PAR measurements achieved a precision between 1.5 and 3.6 mm (at 1.5σ clinical level) at the beam spot level within sub-second time scales. Measured PAR shifts of 1.6-2.1  and 4.2--.7 mm were observed with the 2- and 5-mm thickness range shifters, respectively, aligning with the corresponding proton dose range (PDR) shifts of 1.3-1.8 and 3.9-4.3 mm. The simulated PAR agrees with the measured PARs, showing an average range difference of ∼0.4 mm.\nCONCLUSION: This study demonstrated the feasibility of instantaneous distal edge verification using PET imaging by introducing beam spot delays during dose delivery. The findings represent a first step toward the clinical implementation of instantaneous in vivo distal edge verification. The approach contributes to the development of real-time range verification aimed at improving IMPT treatments by mitigating range and setup uncertainties, thereby reducing dose to organs-at-risk and ultimately enhancing patient outcomes.",
    "abstract_zh": "**翻译：**\n\n背景：调强质子治疗（IMPT）有望通过增强危及器官（OAR）的保护，改善头颈癌（HNC）患者的治疗效果。IMPT 的一个关键挑战是确保在肿瘤远端边缘实现精确的剂量递送，因为在该区域陡峭的剂量梯度使得治疗精度对质子射程和患者摆位的不确定性高度敏感。因此，IMPT的适形性通过在治疗优化中加入稳健性边缘来提高。然而，计划稳健性的增加可能导致危及器官的过度照射。因此，在剂量递送过程中进行精确的远端边缘验证对于通过减少治疗计划中的优化设置来提高 IMPT 的适形性至关重要。\n\n目的：本研究旨在在准临床环境中评估一种新型方法，该方法通过逐点正电子发射断层扫描（PET）成像，对 IMPT 中的精确瞬时质子束远端边缘进行验证。\n\n方法：使用头颈部模型 CIRS-731 HN 在头颈区域进行照射。靶区定义为直径 4 厘米的球体。质子束光斑之间引入 60 毫秒的延迟，以实现对 511 keV 光子的逐点符合探测，这些光子来自正电子湮灭，而正电子湮灭是由于极短寿命的正电子发射体（主要是 12N (T1/2 = 11.0 毫秒)）发射正电子后产生的。此外，还使用厚度分别为 2 毫米和 5 毫米的固体水板在光束路径中进行改进的照射，以评估该方法检测射程偏差的精度。正电子活性范围（PAR）由二维图像重建得到的 1D 纵向正电子活性剖面的 50% 远端衰减位置确定。此外，使用内部 RayStation/GATE MC 框架进行蒙特卡罗（MC）模拟，以预测正电子活性图像并验证 PAR 测量结果。\n\n结果：PAR 测量在亚秒级时间尺度内，在光束光斑水平上实现了 1.5 至 3.6 毫米的精度（1.5σ 临床水平）。观察到使用 2 毫米和 5 毫米厚度的射程调节器时，测量的 PAR 偏移分别为 1.6-2.1 毫米和 4.2-4.7 毫米，与相应的质子剂量范围（PDR）偏移 1.3-1.8 毫米和 3.9-4.3 毫米一致。模拟的 PAR 与测量的 PAR 一致，显示平均射程差异约为 0.4 毫米。\n\n结论：本研究证明了通过在剂量递送过程中引入光束光斑延迟，使用 PET 成像进行瞬时远端边缘验证的可行性。研究结果代表了瞬时体内远端边缘验证临床实施的第一步。该方法有助于开发实时射程验证技术，旨在通过减轻射程和摆位不确定性来改善 IMPT 治疗，从而减少危及器官的剂量，最终改善患者的治疗效果。",
    "summary_zh": "本研究评估了一种利用逐点 PET 成像进行 IMPT 瞬时质子束远端边缘验证的新方法。实验结果表明，该方法具有亚秒级的时间分辨率和毫米级的精度，能够有效检测射程偏差。通过在质子束光斑之间引入延迟，实现了对正电子湮灭光子的逐点符合探测，从而实现了对质子射程的实时监测。该研究为临床应用实时远端边缘验证技术奠定了基础，有望提高 IMPT 治疗的精度和安全性，减少危及器官的受照剂量，并最终改善患者的治疗效果。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17850",
    "link": "https://doi.org/10.1002/mp.17850"
  },
  {
    "title": "Modeling inter-reader variability in clinical target volume delineation for soft tissue sarcomas using diffusion model.",
    "authors": [
      "Yafei Dong",
      "Thibault Marin",
      "Yue Zhuo",
      "Elie Najem",
      "Arnaud Beddok",
      "Laura Rozenblum",
      "Maryam Moteabbed",
      "Kira Grogg",
      "Fangxu Xing",
      "Jonghye Woo",
      "Yen-Lin E Chen",
      "Ruth Lim",
      "Xiaofeng Liu",
      "Chao Ma",
      "Georges El Fakhri"
    ],
    "abstract": "BACKGROUND: Accurate delineation of the clinical target volume (CTV) is essential in the radiotherapy treatment of soft tissue sarcomas. However, this process is subject to inter-reader variability due to the need for clinical assessment of risk and extent of potential microscopic spread. This can lead to inconsistencies in treatment planning, potentially impacting treatment outcomes. Most existing automatic CTV delineation methods do not account for this variability and can only generate a single CTV for each case.\nPURPOSE: This study aims to develop a deep learning-based technique to generate multiple CTV contours for each case, simulating the inter-reader variability in the clinical practice.\nMETHODS: We employed a publicly available dataset consisting of fluorodeoxyglucose positron emission tomography (FDG-PET), x-ray computed tomography (CT), and pre-contrast T1-weighted magnetic resonance imaging (MRI) scans from 51 patients with soft tissue sarcoma, along with an independent validation set containing five additional patients. An experienced reader drew a contour of the gross tumor volume (GTV) for each patient based on multi-modality images. Subsequently, two additional readers, together with the first one, were responsible for contouring three CTVs in total based on the GTV. We developed a diffusion model-based deep learning method that is capable of generating arbitrary number of different and plausible CTVs to mimic the inter-reader variability in CTV delineation. The proposed model incorporates a separate encoder to extract features from the GTV masks, leveraging the critical role of GTV information in accurate CTV delineation.\nRESULTS: The proposed diffusion model demonstrated superior performance with the highest Dice Index (0.902 compared to values below 0.881 for state-of-the-art models) and the best generalized energy distance (GED) (0.209 compared to values exceeding 0.221 for state-of-the-art models). It also achieved the second-highest recall and precision metrics among the compared ambiguous image segmentation models. Results from both datasets exhibited consistent trends, reinforcing the reliability of our findings. Additionally, ablation studies exploring different model structures and input configurations highlighted the significance of incorporating prior GTV information for accurate CTV delineation.\nCONCLUSIONS: The proposed diffusion model successfully generates multiple plausible CTV contours for soft tissue sarcomas, effectively capturing inter-reader variability in CTV delineation.",
    "abstract_zh": "**翻译：**\n\n**背景：** 准确勾画临床靶区（CTV）对于软组织肉瘤的放射治疗至关重要。然而，由于需要对潜在微观扩散的风险和范围进行临床评估，这一过程容易受到阅片者间差异的影响。这可能导致治疗计划的不一致，潜在地影响治疗结果。大多数现有的自动CTV勾画方法没有考虑到这种差异，每个病例只能生成一个CTV。\n\n**目的：** 本研究旨在开发一种基于深度学习的技术，为每个病例生成多个CTV轮廓，模拟临床实践中阅片者间的差异。\n\n**方法：** 我们使用了包含51名软组织肉瘤患者的氟代脱氧葡萄糖正电子发射断层扫描（FDG-PET）、X射线计算机断层扫描（CT）和预对比T1加权磁共振成像（MRI）扫描的公开数据集，以及包含5名额外患者的独立验证集。一位经验丰富的阅片者基于多模态图像为每位患者绘制了肿瘤大体体积（GTV）轮廓。随后，另外两位阅片者与第一位阅片者一起，负责基于GTV勾画总共三个CTV。我们开发了一种基于扩散模型的深度学习方法，该方法能够生成任意数量的不同的、合理的CTV，以模拟CTV勾画中阅片者间的差异。所提出的模型包含一个独立的编码器，用于从GTV掩膜中提取特征，利用GTV信息在准确CTV勾画中的关键作用。\n\n**结果：** 所提出的扩散模型表现出优异的性能，具有最高的Dice系数（0.902，而最先进模型的值低于0.881）和最佳的广义能量距离（GED）（0.209，而最先进模型的值超过0.221）。在所比较的模糊图像分割模型中，它还实现了第二高的召回率和精确率指标。来自两个数据集的结果都表现出一致的趋势，增强了我们研究结果的可靠性。此外，探索不同模型结构和输入配置的消融研究突出了纳入先验GTV信息对于准确CTV勾画的重要性。\n\n**结论：** 所提出的扩散模型成功地为软组织肉瘤生成了多个合理的CTV轮廓，有效地捕捉了CTV勾画中阅片者间的差异。",
    "summary_zh": "本研究提出了一种基于扩散模型的深度学习方法，旨在解决软组织肉瘤放射治疗中CTV勾画的阅片者间差异问题。该模型能够生成多个合理的CTV轮廓，有效模拟了临床实践中的差异性。实验结果表明，该模型在Dice系数和广义能量距离等指标上均优于现有方法，同时突出了GTV信息在准确CTV勾画中的重要性。这项研究为提高软组织肉瘤放射治疗计划的准确性和一致性提供了新的思路。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17865",
    "link": "https://doi.org/10.1002/mp.17865"
  },
  {
    "title": "Thorax-encompassing multi-modality PET/CT deep learning model for resected lung cancer prognostication: A retrospective, multicenter study.",
    "authors": [
      "Jaryd R Christie",
      "Perrin Romine",
      "Karen Eddy",
      "Delphine L Chen",
      "Omar Daher",
      "Mohamed Abdelrazek",
      "Richard A Malthaner",
      "Mehdi Qiabi",
      "Rahul Nayak",
      "Paul Kinahan",
      "Viswam S Nair",
      "Sarah A Mattonen"
    ],
    "abstract": "BACKGROUND: Patients with early-stage non-small cell lung cancer (NSCLC) typically receive surgery as their primary form of treatment. However, studies have shown that a high proportion of these patients will experience a recurrence after their resection, leading to an increased risk of death. Cancer staging is currently the gold standard for establishing a patient's prognosis and can help clinicians determine patients who may benefit from additional therapy. However, medical images which are used to help determine the cancer stage, have been shown to hold unutilized prognostic information that can augment clinical data and better identify high-risk NSCLC patients. There remains an unmet need for models to incorporate clinical, pathological, surgical, and imaging information, and extend beyond the current staging system to assist clinicians in identifying patients who could benefit from additional therapy immediately after surgery.\nPURPOSE: We aimed to determine whether a deep learning model (DLM) integrating FDG PET and CT imaging from the thoracic cavity along with clinical, surgical, and pathological information can predict NSCLC recurrence-free survival (RFS) and stratify patients into risk groups better than conventional staging.\nMATERIALS AND METHODS: Surgically resected NSCLC patients enrolled between 2009 and 2018 were retrospectively analyzed from two academic institutions (local institution: 305 patients; external validation: 195 patients). The thoracic cavity (including the lungs, mediastinum, pleural interfaces, and thoracic vertebrae) was delineated on the preoperative FDG PET and CT images and combined with each patient's clinical, surgical, and pathological information. Using the local cohort of patients, a multi-modal DLM using these features was built in a training cohort (n = 225), tuned on a validation cohort (n = 45), and evaluated on testing (n = 35) and external validation (n = 195) cohorts to predict RFS and stratify patients into risk groups. The area under the curve (AUC), Kaplan-Meier curves, and log-rank test were used to assess the prognostic value of the model. The DLM's stratification performance was compared to the conventional staging stratification.\nRESULTS: The multi-modal DLM incorporating imaging, pathological, surgical, and clinical data predicted RFS in the testing cohort (AUC = 0.78 [95% CI:0.63-0.94]) and external validation cohort (AUC = 0.66 [95% CI:0.58-0.73]). The DLM significantly stratified patients into high, medium, and low-risk groups of RFS in both the testing and external validation cohorts (multivariable log-rank p < 0.001) and outperformed conventional staging. Conventional staging was unable to stratify patients into three distinct risk groups of RFS (testing: p = 0.94; external validation: p = 0.38). Lastly, the DLM displayed the ability to further stratify patients significantly into sub-risk groups within each stage in the testing (stage I: p = 0.02, stage II: p = 0.03) and external validation (stage I: p = 0.05, stage II: p = 0.03) cohorts.\nCONCLUSION: This is the first study to use multi-modality imaging along with clinical, surgical, and pathological data to predict RFS of NSCLC patients after surgery. The multi-modal DLM better stratified patients into risk groups of poor outcomes when compared to conventional staging and further stratified patients within each staging classification. This model has the potential to assist clinicians in better identifying patients that may benefit from additional therapy.",
    "abstract_zh": "翻译：\n\n背景：早期非小细胞肺癌（NSCLC）患者通常接受手术作为主要治疗方式。然而，研究表明，相当一部分患者在切除术后会出现复发，从而增加死亡风险。癌症分期是目前确定患者预后的金标准，可以帮助临床医生确定可能受益于额外治疗的患者。然而，用于辅助确定癌症分期的医学影像已被证明蕴含着未被充分利用的预后信息，可以补充临床数据，更好地识别高风险的NSCLC患者。目前仍然迫切需要构建整合临床、病理、手术和影像信息的模型，并在现有分期系统的基础上进行扩展，以帮助临床医生识别术后立即可能受益于额外治疗的患者。\n\n目的：我们的目的是确定一个整合来自胸腔的FDG PET和CT影像，以及临床、手术和病理信息的深度学习模型（DLM）是否能够比传统分期更好地预测NSCLC的无复发生存期（RFS）并将患者分层到不同的风险组。\n\n材料与方法：回顾性分析了2009年至2018年间在两家学术机构（本地机构：305名患者；外部验证：195名患者）登记的接受手术切除的NSCLC患者。在术前FDG PET和CT图像上勾画出胸腔（包括肺、纵隔、胸膜界面和胸椎），并结合每位患者的临床、手术和病理信息。利用本地患者队列，在使用这些特征的训练队列（n = 225）中构建了一个多模态DLM，在验证队列（n = 45）中进行调整，并在测试（n = 35）和外部验证（n = 195）队列中进行评估，以预测RFS并将患者分层到不同的风险组。使用曲线下面积（AUC）、Kaplan-Meier曲线和log-rank检验来评估模型的预后价值。将DLM的分层性能与传统分期的分层性能进行比较。\n\n结果：整合了影像、病理、手术和临床数据的多模态DLM在测试队列（AUC = 0.78 [95% CI: 0.63-0.94]）和外部验证队列（AUC = 0.66 [95% CI: 0.58-0.73]）中预测了RFS。该DLM在测试和外部验证队列中均显著地将患者分层为RFS的高、中、低风险组（多变量log-rank p < 0.001），并且优于传统分期。传统分期无法将患者分层为RFS的三个不同的风险组（测试：p = 0.94；外部验证：p = 0.38）。最后，该DLM还能够在测试（I期：p = 0.02，II期：p = 0.03）和外部验证（I期：p = 0.05，II期：p = 0.03）队列中的每个分期类别内进一步显著地将患者分层为亚风险组。\n\n结论：这是第一项使用多模态影像以及临床、手术和病理数据来预测NSCLC患者术后RFS的研究。与传统分期相比，多模态DLM能更好地将患者分层为预后不良的风险组，并且进一步将每个分期分类中的患者进行分层。该模型具有帮助临床医生更好地识别可能受益于额外治疗的患者的潜力。",
    "summary_zh": "本研究开发了一种整合FDG PET/CT影像、临床、手术和病理信息的多模态深度学习模型（DLM），用于预测早期NSCLC患者术后的无复发生存期（RFS）并进行风险分层。结果表明，该DLM在预测RFS和进行风险分层方面均优于传统分期，能够更准确地识别高风险患者，并可在现有分期基础上进一步细化患者风险等级。该模型有望辅助临床决策，识别术后可能受益于辅助治疗的患者。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17862",
    "link": "https://doi.org/10.1002/mp.17862"
  },
  {
    "title": "Evaluation of a motion correction algorithm in lung cancer PET/CT: Phantom validation and patient studies.",
    "authors": [
      "Ziyang Wang",
      "Jianjing Liu",
      "Di Lu",
      "Guoqing Sui",
      "Yaya Wang",
      "Lina Tong",
      "Xueyao Liu",
      "Yan Zhang",
      "Jie Fu",
      "Wengui Xu",
      "Dong Dai"
    ],
    "abstract": "BACKGROUND: Data-driven gating (DDG) is an emerging technology that can reduce the respiratory motion artifacts in positron emission tomography (PET) images.\nPURPOSE: The aim of this study is to use phantom and patient data to validate the performance of DDG with a motion correction algorithm based on the reconstruct, register, and average (RRA) method.\nMETHODS: A customized motion platform drove the phantom (five spheres with diameters of 10-28 mm) using a periodic motion that had a duration of 3-5 s and amplitudes of 2-4 cm. Normalized ratio of ungated and RRA PET relative to the ground-truth static PET was calculated for RSUVmax, RSUVmean, RSUVpeak, RVolume, and relative contrast-to-noise ratio (RCNR). Additionally, 30 lung cancer patients with 76 lung lesions less than 3 cm in diameter were prospectively studied. The overall image quality of patient examination was scored using a 5-point scale by two radiologists. SUVmax, SUVmean, SUVpeak, volume, and CNR of lesions measured in ungated and RRA PET were compared, and subgroup analysis was conducted.\nRESULTS: In RRA PET images, motion artifacts of the spheres in the phantom were effectively mitigated, regardless of changes in movement amplitudes or duration. For all spheres with different ranges of motion and cycles, RSUVmax, RSUVmean, RSUVpeak, and RCNR increased significantly (p ≤ 0.001) and RVolume decreased significantly (p < 0.001) in RRA PET images. The average radiologist scores of image quality were 3.90 ± 0.86 with RRA PET, and 3.03 ± 1.19 with ungated PET. In RRA PET images, the SUVmax (p < 0.001), SUVmean (p < 0.001), SUVpeak (p < 0.001), and CNR (p < 0.001) of the lesions increased, while the volume (p < 0.001) of the lesions decreased. Δ%SUVmax, Δ%SUVmean, Δ%SUVpeak, and Δ%CNR of the lesions increased by 3.9%, 6.5%, 5.6%, and 4.3%, respectively, while Δ%Volume of the lesions decreased by 18.4%. Subgroup analysis showed that in lesions in the upper and middle lobes, only SUVpeak (p < 0.001) significantly increased by 5.6% in RRA PET, while their volume (p < 0.001) notably decreased by 12.4% (p < 0.001).\nCONCLUSION: DDG integrated with RRA motion correction algorithm can effectively mitigate motion artifacts, thus enhancing the quantification accuracy and visual quality of images in lung cancer PET/CT.",
    "abstract_zh": "**翻译：**\n\n**背景：** 数据驱动门控(DDG)是一种新兴技术，可以减少正电子发射断层扫描(PET)图像中的呼吸运动伪影。\n\n**目的：** 本研究旨在利用体模和患者数据，验证DDG与基于重建、配准和平均(RRA)方法的运动校正算法的性能。\n\n**方法：** 使用定制的运动平台驱动体模（五个直径为10-28毫米的球体），进行周期性运动，运动周期为3-5秒，振幅为2-4厘米。计算了未门控和RRA PET相对于真实静态PET的归一化比率，评估指标包括RSUVmax、RSUVmean、RSUVpeak、RVolume和相对对比噪声比(RCNR)。此外，前瞻性地研究了30名患有76个直径小于3厘米的肺部病灶的肺癌患者。两名放射科医生使用5分制对患者检查的总体图像质量进行评分。比较了未门控和RRA PET中病灶的SUVmax、SUVmean、SUVpeak、体积和CNR，并进行了亚组分析。\n\n**结果：** 在RRA PET图像中，体模中球体的运动伪影得到了有效减轻，不受运动振幅或周期变化的影响。对于所有具有不同运动范围和周期的球体，RRA PET图像中RSUVmax、RSUVmean、RSUVpeak和RCNR均显著增加（p ≤ 0.001），RVolume显著减少（p < 0.001）。RRA PET的平均放射科医生图像质量评分为3.90 ± 0.86，未门控PET为3.03 ± 1.19。在RRA PET图像中，病灶的SUVmax (p < 0.001)、SUVmean (p < 0.001)、SUVpeak (p < 0.001) 和 CNR (p < 0.001) 均增加，而病灶的体积 (p < 0.001) 减少。病灶的Δ%SUVmax、Δ%SUVmean、Δ%SUVpeak和Δ%CNR分别增加了3.9%、6.5%、5.6%和4.3%，而病灶的Δ%Volume减少了18.4%。亚组分析显示，在上叶和中叶病灶中，RRA PET仅使SUVpeak显著增加5.6%（p < 0.001），而体积显著减少12.4%（p < 0.001）。\n\n**结论：** 集成RRA运动校正算法的DDG可以有效减轻运动伪影，从而提高肺癌PET/CT图像的量化准确性和视觉质量。",
    "summary_zh": "该研究评估了数据驱动门控（DDG）结合重建、配准和平均（RRA）运动校正算法在肺癌PET/CT中的应用。结果表明，该方法能有效减少呼吸运动伪影，提高图像质量，增加SUVmax、SUVmean、SUVpeak和CNR，并减小病灶体积，从而提高肺癌病灶的量化准确性。对体模和患者数据的分析均支持该结论。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17846",
    "link": "https://doi.org/10.1002/mp.17846"
  },
  {
    "title": "Hepatocellular carcinoma 18F-FDG PET/CT kinetic parameter estimation based on the advantage actor-critic algorithm.",
    "authors": [
      "Jianfeng He",
      "Siming Li",
      "Yiwei Xiong",
      "Yu Yao",
      "Siyu Wang",
      "Sidan Wang",
      "Shaobo Wang"
    ],
    "abstract": "BACKGROUND: Kinetic parameters estimated with dynamic 18F-fluorodeoxyglucose (18F-FDG) positron emission tomography (PET)/computed tomography (CT) help characterize hepatocellular carcinoma (HCC), and deep reinforcement learning (DRL) can improve kinetic parameter estimation.\nPURPOSE: The advantage actor-critic (A2C) algorithm is a DRL algorithm with neural networks that seek the optimal parameters. The aim of this study was to preliminarily assess the role of the A2C algorithm in estimating the kinetic parameters of 18F-FDG PET/CT in patients with HCC.\nMATERIALS AND METHODS: 18F-FDG PET data from 14 liver tissues and 17 HCC tumors obtained via a previously developed, abbreviated acquisition protocol (5-min dynamic PET/CT imaging supplemented with 1-min static imaging at 60 min) were prospectively collected. The A2C algorithm was used to estimate kinetic parameters with a reversible double-input, three-compartment model, and the results were compared with those of the conventional nonlinear least squares (NLLS) algorithm. Fitting errors were compared via the root-mean-square errors (RMSEs) of the time activity curves (TACs).\nRESULTS: Significant differences in K1, k2, k3, k4, fa, and vb according to the A2C algorithm and k3, fa, and vb according to the NLLS algorithm were detected between HCC and normal liver tissues (all p < 0.05). Furthermore, A2C demonstrated superior diagnostic performance over NLLS in terms of k3 and vb (both p < 0.05 in the Delong test). Notably, A2C yielded a smaller fitting error for normal liver tissue (0.62 ± 0.24 vs. 1.04 ± 1.00) and HCC tissue (1.40 ± 0.42 vs. 1.51 ± 0.97) than did NLLS.\nCONCLUSIONS: Compared with the conventional postreconstruction NLLS method, the A2C algorithm can more precisely estimate 18F-FDG kinetic parameters with a reversible double-input, three-compartment model for HCC tumors, attaining better TAC fitting with a lower RMSE.",
    "abstract_zh": "**翻译：**\n\n背景：利用动态18F-氟代脱氧葡萄糖(18F-FDG)正电子发射断层扫描(PET)/计算机断层扫描(CT)估计的动力学参数有助于表征肝细胞癌(HCC)，而深度强化学习(DRL)可以改进动力学参数的估计。\n\n目的：优势行动者-评论家(A2C)算法是一种具有神经网络的DRL算法，旨在寻找最优参数。本研究旨在初步评估A2C算法在估计HCC患者18F-FDG PET/CT动力学参数中的作用。\n\n材料与方法：前瞻性地收集了通过先前开发的简化采集方案（5分钟动态PET/CT成像，辅以60分钟时1分钟静态成像）获得的14个肝脏组织和17个HCC肿瘤的18F-FDG PET数据。采用A2C算法，使用可逆的双输入三室模型估计动力学参数，并将结果与传统的非线性最小二乘法(NLLS)算法的结果进行比较。通过时间活动曲线(TAC)的均方根误差(RMSE)比较拟合误差。\n\n结果：根据A2C算法，在HCC和正常肝组织之间检测到K1、k2、k3、k4、fa和vb的显著差异；根据NLLS算法，检测到k3、fa和vb的显著差异（所有p < 0.05）。此外，在k3和vb方面，A2C显示出优于NLLS的诊断性能（DeLong检验中，p < 0.05）。值得注意的是，与NLLS相比，A2C对正常肝组织(0.62 ± 0.24 vs. 1.04 ± 1.00)和HCC组织(1.40 ± 0.42 vs. 1.51 ± 0.97)均产生了更小的拟合误差。\n\n结论：与传统的后重建NLLS方法相比，A2C算法可以更精确地估计HCC肿瘤的可逆双输入三室模型的18F-FDG动力学参数，从而实现更好的TAC拟合，并获得更低的RMSE。",
    "summary_zh": "本研究评估了基于深度强化学习的A2C算法在肝细胞癌(HCC) 18F-FDG PET/CT动力学参数估计中的应用。结果表明，A2C算法在区分HCC和正常肝组织方面优于传统的非线性最小二乘法(NLLS)，并能更精确地估计动力学参数，实现更好的时间活动曲线拟合，降低拟合误差。这表明A2C算法在HCC的PET成像分析中具有潜在的应用价值。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17851",
    "link": "https://doi.org/10.1002/mp.17851"
  },
  {
    "title": "Predicting [177Lu]Lu-DOTA-TATE dosimetry by using pre-therapy [68Ga]Ga-DOTA-TATE PET/CT and biomarkers in patient with neuroendocrine tumors.",
    "authors": [
      "Hongxing Yang",
      "Ming Qi",
      "Zhihao Chen",
      "Fei Liu",
      "Junyan Xu",
      "Xiaoping Xu",
      "Qing Kong",
      "Jianping Zhang",
      "Shaoli Song"
    ],
    "abstract": "BACKGROUND: Lutetium-177 DOTA-TATE peptide receptor radionuclide therapy (PRRT) is an established and effective treatment modality for patients with metastatic neuroendocrine tumors (NETs).\nPURPOSE: This study aims to predict patient-absorbed doses from [177Lu]Lu-DOTA-TATE PRRT in the liver, kidney and lesion by utilizing patient-specific absorbed doses from pre-therapeutic [68Ga]Ga-DOTA-TATE PET/CT.\nMETHODS: Before the treatment of cycle 1, 11 patients with NETs underwent PET/CT scans at 0.5, 1.0, 2.0 and 4.0 h after the injection of [68Ga]Ga-DOTA-TATE. Patients then received [177Lu]Lu-DOTA-TATE PRRT and underwent SPECT/CT scans at 4, 24, 96, and 168 h post-administration. The segmentations and dosimetry were performed by using a professional software. The linear regression model used the absorbed doses from [68Ga]Ga-DOTA-TATE alone as the predictor variable. The multiple linear regression model used the absorbed doses from [68Ga]Ga-DOTA-TATE and the relevant clinical biomarkers as the predictor variables.\nRESULTS: The mean absorbed doses from [177Lu]Lu-DOTA-TATE PRRT in kidney and liver were 4.1 and 2.1 Gy, respectively. In comparison, the mean absorbed doses from [68Ga]Ga-DOTA-TATE were significantly lower: 18.0 mGy and 11.0 mGy, respectively. For lesions, the maximum absorbed dose from [68Ga]Ga-DOTA-TATE ranged from 24.1 to 170.4 mGy, while the maximum absorbed dose from [177Lu]Lu-DOTA-TATE PRRT was significantly higher, ranging from 9.6 to 77.9 Gy. The linear regression model yielded moderate R-squared values of 0.50, 0.59, and 0.36 for kidney, liver and lesion, respectively. The performance of multiple linear regression model was better, with R-squared values increasing to 0.81, 0.77, and 0.84.\nCONCLUSION: Absorbed doses from [177Lu]Lu-DOTA-TATE PRRT can be accurately predicted. Moreover, our models are formalized into simple equations.",
    "abstract_zh": "**翻译:**\n\n背景：镥-177 DOTA-TATE肽受体放射性核素疗法 (PRRT) 是一种成熟且有效的治疗转移性神经内分泌肿瘤 (NETs) 的方法。\n\n目的：本研究旨在利用预治疗的 [68Ga]Ga-DOTA-TATE PET/CT获得的患者个体吸收剂量，预测[177Lu]Lu-DOTA-TATE PRRT在肝脏、肾脏和病灶中的患者吸收剂量。\n\n方法：在第一个疗程治疗前，11名NETs患者在注射[68Ga]Ga-DOTA-TATE后0.5、1.0、2.0和4.0小时进行PET/CT扫描。随后患者接受[177Lu]Lu-DOTA-TATE PRRT治疗，并在给药后4、24、96和168小时进行SPECT/CT扫描。使用专业软件进行分割和剂量测定。线性回归模型仅使用[68Ga]Ga-DOTA-TATE的吸收剂量作为预测变量。多元线性回归模型使用[68Ga]Ga-DOTA-TATE的吸收剂量和相关的临床生物标志物作为预测变量。\n\n结果：[177Lu]Lu-DOTA-TATE PRRT在肾脏和肝脏中的平均吸收剂量分别为4.1 Gy和2.1 Gy。相比之下，[68Ga]Ga-DOTA-TATE的平均吸收剂量显著较低，分别为18.0 mGy和11.0 mGy。对于病灶，[68Ga]Ga-DOTA-TATE的最大吸收剂量范围为24.1至170.4 mGy，而[177Lu]Lu-DOTA-TATE PRRT的最大吸收剂量显著较高，范围为9.6至77.9 Gy。线性回归模型对肾脏、肝脏和病灶的R平方值分别为0.50、0.59和0.36，显示出中等程度的相关性。多元线性回归模型的性能更好，R平方值提高到0.81、0.77和0.84。\n\n结论：可以准确预测[177Lu]Lu-DOTA-TATE PRRT的吸收剂量。此外，我们的模型已被形式化为简单的方程式。",
    "summary_zh": "本研究旨在通过预治疗的[68Ga]Ga-DOTA-TATE PET/CT数据预测[177Lu]Lu-DOTA-TATE PRRT在NETs患者肝脏、肾脏和病灶中的吸收剂量。结果表明，利用线性回归和多元线性回归模型可以较为准确地预测[177Lu]Lu-DOTA-TATE PRRT的吸收剂量，特别是多元线性回归模型表现更好，且模型可简化为简单方程式。该研究有助于个体化PRRT治疗方案的制定。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17852",
    "link": "https://doi.org/10.1002/mp.17852"
  },
  {
    "title": "Predictive models of epidermal growth factor receptor mutation in lung adenocarcinoma using PET/CT-based radiomics features.",
    "authors": [
      "Zhikang Deng",
      "Di Jin",
      "Pei Huang",
      "Changchun Wang",
      "Yaohong Deng",
      "Rong Xu",
      "Bing Fan"
    ],
    "abstract": "BACKGROUND: Lung adenocarcinoma (LAC) comprises a substantial subset of non-small cell lung cancer (NSCLC) diagnoses, where epidermal growth factor receptor (EGFR) mutations play a pivotal role as indicators for therapeutic intervention with targeted agents. The emerging field of radiomics, which involves the extraction of numerous quantitative attributes from medical imaging, when coupled with positron emission tomography/ computed tomography (PET/CT) technology, has demonstrated promise in the prognostication of EGFR mutation status. The objective of this investigation is to construct and validate predictive models for EGFR mutations in LAC by leveraging PET/CT-derived radiomics features, thereby refining diagnostic precision and facilitating tailored treatment strategies.\nPURPOSE: The aim of this study was to develop a non-invasive radiomics model based on PET/CT with excellent performance for predicting the EGFR mutation status in LAC. Thus, it can provide the basis for the individualized treatment decision of patients.\nMETHODS: Positron emission tomography (PET), computed tomography (CT), clinical and pathological data of 112 patients with LAC admitted to our hospital from January 2019 to June 2023 were retrospectively analyzed. This research cohort encompassed 54 LAC patients with EGFR wild type and 58 LAC patients with EGFR mutated type. The participants were randomly assigned to the training group (n = 78) and the validation group (n = 34) in a 7:3 ratio. A sum of 3562 radiomics attributes were derived from PET/CT scans. The minimal absolute shrinkage and selection operator method was employed to identify 13 notable features. Based on these characteristics, support vector machine (SVM), gradient boosting decision tree (GBDT), random forest (RF) and extreme gradient boosting (XGBOOST) were constructed. The forecasting effectiveness of the model was assessed using the area under the receiver operating characteristic (ROC) Curve, the DeLong test, and decision curve analysis (DCA).\nRESULTS: SVM performance in PET/CT radiomics model was higher than that of other machine learning models (training group areas under the curve [AUC] of 0.916 and validation group AUC of 0.945, respectively). The integration of radiomics and clinical data did not yield a superior predictive performance compared to the radiomics model alone in terms of estimating EGFR mutation status (AUC: 0.916 vs. 0.921, 0.945 vs. 0.955, p> 0.05, in both the training and validation groups).\nCONCLUSIONS: The SVM model has emerged as a commendable non-invasive technique, showing high precision and dependability in forecasting EGFR mutation statuses in individuals with LAC. The radiomics model derived from PET/CT scans holds promise as a prognostic indicator of EGFR mutations in LAC, offering a valuable tool that could refine personalized therapeutic strategies and ultimately enhance the prognosis for LAC patients.",
    "abstract_zh": "**翻译：**\n\n背景：肺腺癌（LAC）是非小细胞肺癌（NSCLC）的重要亚型，其中表皮生长因子受体（EGFR）突变是靶向药物治疗的关键指标。新兴的放射组学领域，通过从医学影像中提取大量定量特征，结合正电子发射断层扫描/计算机断层扫描（PET/CT）技术，已显示出预测EGFR突变状态的潜力。本研究旨在构建和验证基于PET/CT放射组学特征的LAC患者EGFR突变预测模型，从而提高诊断精确度，并促进个体化治疗策略的制定。\n\n目的：本研究旨在开发一种基于PET/CT的、具有优异性能的无创放射组学模型，用于预测LAC患者的EGFR突变状态。从而为患者的个体化治疗决策提供依据。\n\n方法：回顾性分析了2019年1月至2023年6月期间入住我院的112例LAC患者的正电子发射断层扫描（PET）、计算机断层扫描（CT）、临床和病理数据。该研究队列包括54例EGFR野生型LAC患者和58例EGFR突变型LAC患者。参与者以7:3的比例随机分为训练组（n = 78）和验证组（n = 34）。从PET/CT扫描中提取了总计3562个放射组学特征。采用最小绝对收缩和选择算子方法（LASSO）识别出13个显著特征。基于这些特征，构建了支持向量机（SVM）、梯度提升决策树（GBDT）、随机森林（RF）和极限梯度提升（XGBOOST）模型。使用受试者工作特征曲线下面积（AUC）、DeLong检验和决策曲线分析（DCA）评估模型的预测效果。\n\n结果：PET/CT放射组学模型中，支持向量机（SVM）的性能优于其他机器学习模型（训练组AUC为0.916，验证组AUC为0.945）。在评估EGFR突变状态方面，与单独使用放射组学模型相比，整合放射组学和临床数据并未产生更优的预测性能（训练组和验证组的AUC分别为0.916 vs. 0.921, 0.945 vs. 0.955, p> 0.05）。\n\n结论：支持向量机（SVM）模型已成为一种值得推荐的无创技术，在预测LAC患者EGFR突变状态方面显示出高精度和可靠性。基于PET/CT扫描的放射组学模型有望成为LAC患者EGFR突变的预测指标，为优化个体化治疗策略，最终改善LAC患者的预后提供有价值的工具。",
    "summary_zh": "本研究构建并验证了基于PET/CT放射组学特征的肺腺癌（LAC）患者EGFR突变预测模型。研究结果表明，支持向量机（SVM）模型表现出优异的预测性能，且优于其他机器学习模型，整合临床数据并未显著提升预测效果。该模型有望成为无创预测LAC患者EGFR突变状态的有效工具，为个体化治疗决策提供依据，并改善患者预后。",
    "journal": "Medical physics",
    "pubdate": "",
    "doi": "10.1002/mp.17780",
    "link": "https://doi.org/10.1002/mp.17780"
  }
]